/* 
	音乐列表的排序、分类方法
	1. 个人喜好（喜欢程度）
	2. 时间：
		收藏时间
		发布时间
	3. 播放次数
		1. 自己的播放次数
		2. 所有用户总计播放次数
	4. 分类：
		1. 做什么事适合听什么分类
			1. 学习
				1. 激进
				2. 安静
				3. 舒缓的
	5. 随机播放
	6. 名称
		1. 歌曲名
		2. 歌手名
	7. 自定义
	【正序、倒序】
	
	
	未来数据格式
	[
		{
			ID
			歌曲名
			作者
			封面
			歌词
			MV
			弹幕
			字幕
			专辑
			分类【歌单】：影视剧、乐器
			关联：人、事、物、场景等待，一般由每个人自己设定
			元数据：
				时间
				音质
				作曲
				作词
				...
		}
	]
	
	数据目录
		音乐文件目录：mp3、wav ...一般存放最高级音质，前端请求带上所需音质，按固定音质压缩返回
		封面存放目录：优先png格式，小文件无损压缩
		歌词文件目录：lrc，逐行打点、逐字打点。逐行打点规范：“[00:00.0000] 词：郑国江”
		MV存放目录：
		弹幕存放目录：
		字幕存放目录：
*/

/**
 * 顶级配乐大师
 * 
 * - 许镜清：西游记系列
 * - 胡伟立：市集、嬉戏
 * - 刘家昌：只要为你活一天、往事只能回味
 * - 顾家辉：铁血丹心、上海滩
 * - 吴冠廷：一生所爱、赌圣出场
 * - 黄英华：大话西游主题曲？Opening、闯将令
 * - 黄霑：沧海一声笑
 * - 赵季平：王进打高球
 * - 左宏元：渡情、天也不懂情
 * - 陈国梁：天龙八部间奏曲
 * - 陈勋奇：天地孤影任我行、挚爱
 * - 麦振鸿：雪见落入凡
 * 
 * - 萧敬腾：雨神
 * - 张译：上过的所有学校倒闭
 * 
 */

/**
 * 🎵 中国民族乐器（经典代表）
 * - 二胡（千年琵琶万年筝一把二胡拉一生）：《二泉映月https://v.douyin.com/H-yEbGpyjR4/》（阿炳）、《赛马》、《良宵》、《游子梦》、《痴情冢》、《渴望》、《片片相思赋予谁 已经添加》、《风居住的街道》
 * - 古筝：《渔舟唱晚》、《高山流水》、《战台风》
 * - 琵琶：《十面埋伏》、《阳春白雪》、《琵琶语》
 * - 笛子：《荒》、《姑苏行》、《牧民新歌》、《鹧鸪飞》、《扬鞭催马运粮忙》
 * - 唢呐：《百鸟朝凤》、《黄土情》
 * - 古琴：《广陵散》、《梅花三弄》、《平沙落雁》
 * - 葫芦丝：《月光下的凤尾竹》、《竹林深处》
 * - 马头琴：《鸿雁》、《万马奔腾》、《安河桥》
 * - 扬琴：《旱天雷》、《将军令》
 * - 笙：《凤凰展翅》、《草原骑兵》
 *
 *  🎹 西洋乐器（经典代表）
 * - 钢琴：贝多芬《悲怆奏鸣曲》、肖邦《夜曲》、《致爱丽丝》
 * - 小提琴：《梁祝》、柴可夫斯基《D 大调小提琴协奏曲》、《沉思》
 * - 大提琴：《天鹅》、埃尔加《E 小调大提琴协奏曲》、《殇》
 * - 单簧管：莫扎特《A 大调单簧管协奏曲》、《查尔达什舞曲》
 * - 萨克斯：《回家》、《茉莉花》、《我心永恒》
 * - 小号：《西班牙斗牛士》、《威廉退尔序曲》、《拿波里舞曲》
 * - 长笛：德彪西《牧神午后前奏曲》、《梁祝》（长笛版）
 * - 吉他：《斯卡布罗集市》、《爱的罗曼史》、《加州旅馆》（木吉他）
 * - 管风琴：巴赫《d 小调托卡塔与赋格》
 * - 竖琴：德彪西《神圣与世俗舞曲》、《绿袖子》
 * - 老北京老佛爷BGM
 * 
 * 民族音乐
 * 傣族：傣族舞曲
 * 
 * 各省省歌
 * 云南：打歌舞、老司机带带我
 * 新疆：欢乐的跳吧
 * 
 * 情绪
 */


// 音乐信息
let songs = [
	/* My·爱人先爱己 所有人都没有自己重要 */
	"宿敌_田人", // 可能重复·A(高度相似)
	"田人 - 宿敌",
	"浮夸-陈奕迅", // 可能重复·A(高度相似)
	/* MyEnd */
	"寂寞寂寞不好-曹格", // 可能重复·A(高度相似)
	"绅士-薛之谦", // 可能重复·A(高度相似)
	"其实-薛之谦", // 可能重复·A(高度相似)
	"一时的选择-林俊杰", // 25-07-30 14:29:48
	"一点归鸿-平生青涯", // 可能重复·A(高度相似)
	"画-赵雷", // 可能重复·A(高度相似)
	"《人世间》主题曲", // 可能重复·B(较可能同一首)
	"花间", // 已添加MV // 可能重复·A(高度相似)
	"陈楚生 - 有没有人告诉你", // 可能重复·C(可能同一首)
	"孙楠-拯救",
	"徐誉滕 - 天使的翅膀",	// 安琥版（原唱，徐誉滕版需音乐包）
	"柳爽-漠河舞厅", // 可能重复·B(较可能同一首)
	"恋人-李荣浩", // 已添加MV // 可能重复·A(高度相似)
	"Despacito", // 可能重复·A(高度相似)
	"广东雨神 - 广东爱情故事",
	"骗子", // 可能重复·A(高度相似)
	"幻昼", // 可能重复·C(可能同一首)
	"艾辰 - 烟火里的尘埃",
	"康硕Kenny - 喜剧之王 Silent Open (電影喜劇之王原聲)",
	"龙梅子、王强 - 你把爱情给了谁", // 已添加MV·同「我创建·Yy」
	"自娱自乐-金志文", // 翻唱版（金志文原唱需付费） // 可能重复·A(高度相似)
	"铁血丹心", // 正常或二胡 // 可能重复·A(高度相似)
	"爱错", // 可能重复·A(高度相似)
	"年轻不懂爱", // 粤语 // 可能重复·A(高度相似)
	"偷心",
	"卓玛",
	"Oliver Tree-Life Goes On",
	"借月",
	"黄安 - 东南西北风", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"你郝兄 - 往后余生（不见）", // 可能重复·A(高度相似) // 已换成你郝兄本尊 11s 试听（酷我）；原版 180s 全平台付费/已下架，此前 204s 那条是何小渝同一录音（波形相关1.0000）
	"马良、孙茜茹 - 往后余生",

	/* KTV ·start */
	// —— 华语经典 · K歌常点 ——
	"费玉清 - 一剪梅",
	"慕容晓晓 - 爱情买卖",
	"兮有妹 - 梦里梦外都是你",
	"陈奕迅、王菲 - 因为爱情",
	"凤凰传奇 - 最炫民族风",
	"安苏羽 - 左肩",
	"梁静茹 - 勇气", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"林志炫 - 单身情歌",
	"江珊 - 梦里水乡",
	"陈慧琳 - 记事本",
	"Zealot周星星 - 我看过",
	"说散就散-袁娅维TIA RAY", // 可能重复·A(高度相似) 音频换“袁娅维TIA RAY - 说散就散”这首的音频
	"陈雪凝 - 你的酒馆对我打了烊",
	"郭顶 - 水星记", // 不想唱
	"张宇 - 雨一直下", // 不太好唱
	"阿牛 - 桃花朵朵开",
	/* KTV·End */
	// —— 外文 · 电音 · 提神 ——
	"KALEO - Way Down We Go",
	"Mario & Nasty - Never Say Good Bye",
	"ASPINAL - Always Remember Us This Way",
	"Trouble Maker - Trouble Maker",
	"幻昼4.0 - 斩", // 替代 DJ落雨版（伏黑甚尔进行曲·幻昼4.0）
	"FLYSBR - Titanic (Cover Energy)(电音版)", // 替代 Energy 版
	"Jami Soul、Mr. Bang、시나에 - She",
	/* happy·新增歌单 2025-10-11（30首）· 同风格相邻排序 */
	// —— 国风 · 民乐 · 民歌 ——
	"琵琶曲", // 可能重复·B(较可能同一首)
	"一城山水",
	"孤独诗人-渡我不渡她",
	"罗生门", // 音频不对
	"苹果香",
	// —— 网络热歌 · 伤感 ——
	"少一点天分",
	"不配说爱我",
	"其实雨也没多大", // 音频不对
	"爱你没差",
	"原谅我还没忘记",
	"总有一天你会出现在我身边",
	"陷阱",
	"他真的对你好吗",
	// —— 经典 · 抒情K歌 ——
	"林俊杰 - 可惜没如果 (Live)",
	"郑源 - 包容 (Live)",
	"黄鹤翔 - 九妹",
	"英雄泪", // 可能重复·A(高度相似)
	"鹏鹏音乐、池立铎 - 英雄泪",
	"像风一样", // 可能重复·B(较可能同一首)
	"许巍 - 像风一样自由",
	"爱我还是他",
	"世界赠予我的",
	// —— 民谣 · 都市 ——
	"晚安（颜人中）",
	"晚安（汪苏泷）", // Live版
	// —— DJ · 电子 ——
	"听（DJ化妆变装）",
	// —— 英文 · 励志 ——
	"Zombie-The Cranberries", // 可能重复·B(较可能同一首)
	"The Cranberries - Zombie (DJ金6、DJ金6(5)版)", // 同「我创建·two」
	"free & unafraid 自由与勇敢",
	// —— 其它 ——
	"脱变",
	"尕连手",
	"清早起来去拾粪",
	"浪子的心情-叶启田",
	/* happyEnd */
	// —— 2026-10-26 追加 ——
	"鱼蛋 - 夜色",
	"余书瑶 - 芊芊", // 余书瑶翻唱版（回音哥原版/来一碗老于版抓不到）
	/* happy·爱人先爱己 所有人都没有我的快乐重要 */
	"林志炫 - 你的样子",
	"纤夫的爱-尹相杰&于文华", // 可能重复·C(可能同一首)
	"We Will Rock You", // 可能重复·A(高度相似)
	"Estudio Miami Ritmo - We Will Rock You", // 同「我创建·默认收藏」
	"李克勤-护花使者",
	"Wellerman-NathanEvans(Sea_Shanty)",
	"回首掏 (伴奏)-一只小胖胖",
	"兰花草-半吨兄弟",
	"天真的橡皮 (DJ版)-白水寒", // 可能重复·C(可能同一首)
	"Haha Hihi Huhu Heheh", // ha hi hu he ho 日语五十音，ha行 // 可能重复·A(高度相似)
	"Maman Vibez - Haha Hihi Huhu Heheh",
	"星光下的梦想", // 可能重复·A(高度相似)
	"吉米，来吧",
	"洛天依 - 我在东北玩泥巴",
	"燃烧的爱火",
	"恭喜发财-刘德华", // 可能重复·A(高度相似)
	"恭喜恭喜-卓依婷", // 可能重复·C(可能同一首)
	/* happyEnd */
	"焚情-黄凯芹", // 可能重复·A(高度相似)
	"孤单心事", // 可能重复·A(高度相似) // 女声
	"蓝又时 - 孤单心事", // 男声
	"春涧",
	"李袁杰 - 大天蓬", // 翻唱版（原唱需付费） // 可能重复·B(较可能同一首)
	"赵方婧 - 尽头", // Remix版 // 可能重复·B(较可能同一首)
	"长安姑娘", // https://www.bilibili.com/video/BV13Z4y1G7S1/
	"金莎 - 星月神话",
	"琪大妈 - 星月神话", // 24秒电子琴弹唱片段（原版需音乐包）
	"成龙、金喜善 - 美丽的神话", // 版本不太好，歌词是两套·同「我创建·默认收藏」
	"孙楠、韩红 - 美丽的神话", // https://www.douyin.com/video/7511704286113369384 
	"华语群星 - 明天会更好", // 男声抒情版
	"入戏太深 - 马旭东", // 可能重复·A(高度相似)
	"未知歌手 - 说谎 (DJ赵小涣)", // 可能重复·A(高度相似)
	"DJ - 虹之间 (DJ版)",
	"加快版中文网络流行歌曲劲爆串烧 - 2014年12月收录 (DJ版)",
	"未知歌手 - 百听不厌全中文网络流行歌曲慢摇串烧",
	"未知歌手 - 我愿用我半生年华",
	"DJ - Pyro",
	"DJ - Waiting For Love (Remix)",
	"金贵晟 - 虹之间",
	"未知歌手 - 2010年伤感网络流行歌曲劲爆舞曲串烧 by DJ阿喜 (DJ版)",
	"未知歌手 - Color",
	"Chester Young、Castion - PYRO", // 同「我创建·two」
	"DJ - 我愿用我半生年华", // MC泽说版
	"DJ - 我的草原我的马 (10秒DJ版片段)", // 迪总版·同「我创建·改编/鬼畜/片段/DJ」
	"DJ - 我的歌声里 (12秒DJ版片段)", // 同「我创建·改编/鬼畜/片段/DJ」
	"DJ - 有多少爱可以重来 (DJ R7版)", // 7妹妹版（R7版需音乐包）
	"徐梦圆 - color-X",
	"我是一颗葱",
	"魏新雨 - 恋人心",
	"张敬轩 - 只是太爱你",
	"可能-李怡然同学", // 两个是不同的原创版本
	"程响 - 可能", // 音频不对
	/* 250111·比完赛在搜不是因为寂寞才想你的时候偶然间发现这首歌，顺便听一下，感觉还行，就加上吧。不知不觉就找了好多歌 */
	"童话镇-陈一发儿", // 暗杠版（陈一发儿版已下架） // 可能重复·B(较可能同一首)
	"封茗囧菌 - 童话镇 (Demo版)",
	"童话镇-苗疆少女",
	"光良 - 童话",
	"李翊君 - 雨蝶",
	"T.R.Y - 不是因为寂寞才想你",
	"随风而去-云菲菲", // 可能重复·C(可能同一首)
	"云菲菲 - 殇雪",
	"阿悠悠 - 一生与你擦肩而过", // 音频不对
	"交换余生（林俊杰）-林宥嘉", // 可能重复·B(较可能同一首)
	"林宥嘉 - 说谎", // 音频不对
	"阿冗 - 你的答案", // 音频不对
	"宇桐非、胡雯 - 擦肩而过",
	"容祖儿 - 就让这大雨全都落下",
	"容祖儿 - 挥着翅膀的女孩", // 同「我创建·默认收藏」
	"阿木 - 有一种爱叫做放手",
	"陈奕迅 - 淘汰",
	"苏星婕 - 风吹过八千里",
	"死心塌地去爱你", // 可能重复·A(高度相似)
	"舍国庆、怪阿姨 - 死心塌地去爱你",
	/*
		250111·End
	*/
	/* shw */
	"庾澄庆 - 春泥",
	"张信哲 - 别怕我伤心",
	"羊羊 - 别怕我伤心", // DJ阿若版（原版需音乐包）
	"胡彦斌-你要的全拿走",
	"萧敬腾 - 怎么说我不爱你",
	/* shw·end */
	/* 泪水打湿数据线 边听音乐边漏电 不分敌我一穿七 全体给我忆亡妻 */
	"小咪-我走后", // 可能重复·A(高度相似)
	"来一碗老于 - 我走后 (片段)",
	"戴羽彤-来迟",
	"再见-G.E.M.邓紫棋",
	"刘大壮 - 说了再见 (片段)",
	"刘大壮 - 再见 (片段)",
	"王津凯 - 再见 (Live片段)",
	"张震岳 - 再见", // 同「我创建·two」
	"G.E.M.邓紫棋 - 再见",
	"周杰伦 - 说了再见",
	"琪大妈-画心", // 可能重复·B(较可能同一首)
	"周林枫 - 忘了", // 可能重复·A(高度相似)
	"王菲 - 匆匆那年", // 可能重复·B(较可能同一首)·同「我创建·。」
	"用情", // 可能重复·A(高度相似)
	"羊羊 - 用情", // 同「我创建·默认收藏」
	"羊羊 - 用情 (DJ楠哈哈版)", // 伴奏版（原版需音乐包）
	"张信哲 - 用情",
	"谁",
	"五月天 - 后来的我们",
	"安河桥", // 可能重复·B(较可能同一首)
	/* 前任3 */
	"体面-于文文", // 可能重复·A(高度相似)
	"Nicky - 说散就散 (弹唱版)", // 同「我创建·改编/鬼畜/片段/DJ」
	/* 前任3End */
	/* K */
	"火风 - 大花轿", // 可能重复·B(较可能同一首)·同「我创建·。」
	"花儿乐队 - 化蝶飞", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"虎二 - 永不失联的爱", // 可能重复·C(可能同一首)
	/* K·End */
	"留什么给你(Live)-孙楠", // 可能重复·B(较可能同一首)
	"Two Steps From Hell-Star Sky 活有余罪 - 可有道", // 可能重复·C(可能同一首)
	"春风何时来", // 可能重复·A(高度相似)
	"福禄寿FloruitShow - 我用什么把你留住 (Live)",
	"谁 (Live版)-廖俊涛",
	"李巨儒 - 男孩别哭", // 可能重复·B(较可能同一首)
	"Collapsing World",
	"lifeline", // 可能重复·A(高度相似)
	"Zeraphym - Lifeline (生命线)",
	"M.Graveyard - You",
	"Approaching Nirvana - You", // 同「我创建·。」
	"Ephemeral Memories-转瞬即逝的记忆",
	"金琳 - 雨落长安", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"锦江music - 周笔畅《笔记》",
	"丁可 - If",
	"七元 - IF",
	"彩云之南-徐千雅", // 可能重复·A(高度相似)
	"老人与海 - 海鸣威", // 可能重复·C(可能同一首)
	"许巍 - 曾经的你 (Live)", // 可能重复·C(可能同一首)
	"许巍 - 旅行 (Live)",
	"许巍 - 蓝莲花", // 可能重复·B(较可能同一首)
	"坟草钢木",
	"是想你的声音啊（DJ版）_傲七爷", // 可能重复·C(可能同一首)
	"氟西汀 - 是想你的声音啊 (DJ版)",
	"氟西汀 - 是想你的声音啊+忘川彼岸",
	"挪威的森林-伍佰", // 可能重复·C(可能同一首)
	"吕明轩 - 悬溺",
	"离歌-信乐团", // 可能重复·A(高度相似)
	"李健 - 假如爱有天意",
	"邵帅 - 写给黄淮 (Demo)",
	/* 23年左右一次暑假去宕昌时在君成的车载音乐上听到的感觉不错就搞到了 */
	"探清水河-摩登兄弟", // 可能重复·C(可能同一首)
	"刀郎 - 罗刹海市",
	/* End */
	"刘牧 - 十三不亲",
	"刘牧-十三亲",
	"吉他的天空 - 暗里着迷", // 可能重复·A(高度相似)
	"沦陷-王靖雯", // 可能重复·A(高度相似)
	"Sea Shanty Medley(串烧曲)",
	"曹操-林俊杰", // 可能重复·A(高度相似)
	"林忆莲-至少还有你", // 可能重复·C(可能同一首)
	"张碧晨 - 开往早晨的午夜",
	"陈粒 - 走马",
	"精忠报国-洪屠刚", // 可能重复·C(可能同一首)
	/* New Songs 241225 */
	"松紧先生 李宗锦 - 你走",
	"孙燕姿 - 我怀念的",
	"越来越不懂-蔡健雅", // 可能重复·A(高度相似)
	"DJ马哥 - C哩C哩", // 可能重复·A(高度相似)
	"Gamper & Dadoni、Ember Island - Creep", // 可能重复·B(较可能同一首)
	"老妖-985声工场 - Creep",
	"Mike Zhou - The Dawn (亡灵序曲完美钢琴版)",
	"乌兰图雅、师鹏、沙溢、胡可、云朵、云飞 - 歌舞：点赞新时代 (Live)", // 同「我创建·Yy」
	"于溪悦 - 万爱千恩", // 可能重复·C(可能同一首)
	"于溪悦 - 万爱千恩 (女声版)",
	"华语群星 - 杂技：争奇斗技 (Live)",
	"晓依 - 片片相思赋予谁",
	"吉克隽逸 - 歌舞：映山红 (Live)", // 同「我创建·Yy」
	"小易萨克斯 - 风筝误", // 可能重复·B(较可能同一首)
	"小易萨克斯 - 【风筝误】小易萨克斯",
	"彭雨菲 - 超级棒棒糖", // 可能重复·B(较可能同一首)·同「我创建·动画片」
	"未知歌手 - Autumn (DJ版)",
	"林志玲 - 特别设计：绽放 (Live)", // 同「我创建·gg」
	"柳轻颂 - 舞い落ちる花びら(Fallin' Flower) (飘落的花瓣)(钢琴版)",
	"段丽阳 - 小孩的梦", // 可能重复·B(较可能同一首)·同「我创建·动画片」
	"翟亚楠 - 心中的另一个自己",
	"萧亮 - 梦的过客",
	"要不要买菜 - 全是爱 (片段)", // 可能重复·A(高度相似)
	"凤凰传奇 - 全是爱", // 同「我创建·Yy」
	"凤凰传奇 - 全是爱 (DJ沐羽曦版)",
	"徐泽（要不要买菜） - 多情种",
	"陈依梦 - 忘情果 (伤感女声版)",
	"韩可可 - 错位时空 (女版)",
	/* New Songs 241225 End */
	"刘德华 - 世界第一等",
	"周杰伦-蒲公英的约定", // 可能重复·A(高度相似)
	"Salvatore", // 可能重复·A(高度相似)
	"欢乐地跳吧", // 可能重复·A(高度相似)
	"张杰-他不懂", // 可能重复·A(高度相似)
	"毛不易-借", // 可能重复·B(较可能同一首)
	"毛不易-消愁", // 可能重复·B(较可能同一首)
	"苏打绿-我好想你", // 可能重复·B(较可能同一首)
	"来一碗老于 - 我好想你 (片段)",
	"苏打绿 - 小情歌", // 同「我创建·默认收藏」
	"薛之谦-我好像在哪见过你", // 可能重复·A(高度相似)
	"薛之谦-木偶人",
	"许飞-父亲写的散文诗", // 可能重复·A(高度相似)
	"开始懂了-孙燕姿", // 可能重复·A(高度相似)
	"远山少年", // 可能重复·A(高度相似)
	/* ===GYL */
	"黄小琥 - 没那么简单", // 可能重复·B(较可能同一首)
	"光泽 - 空心", // 可能重复·B(较可能同一首)
	"刘鹏 - 太阳 (你看着我眼睛)",
	/* ===GYLEnd */
	/* ===LR */
	"黄征 - 你是另一个我",
	"DP龙猪、阿水SWEI、Rays陈袁 - 风吹一夏",
	"G.G - 给陌生的你听",
	"七星 - 佛说",
	"徐秉龙、沈以诚 - 白羊", // 可能重复·B(较可能同一首)
	"旺仔小乔 - 剑伤 (片段)", // 可能重复·B(较可能同一首)
	"李鑫ya - 剑伤 (片段)",
	"半吨兄弟 - 剑伤",
	"棉子 - 勇气", // 另一个版本
	"汪苏泷 - 不分手的恋爱", // 可能重复·C(可能同一首)
	"程响 - 不再联系", // 可能重复·B(较可能同一首)
	"Yiu玥 - 不再联系",
	"筷子兄弟 - 老男孩 (Live)", // 可能重复·A(高度相似)
	"Jam - 七月上",
	"Leon不太冷的哈哈 - Time Back", // 可能重复·B(较可能同一首)
	"Leon不太冷的邓壬鑫 - Time Back",
	"前男友 - 你离开的事实",
	"Sing, R. Sing! - 幼女幻奏",
	"林俊杰 - 交换余生 (Live)", // 可能重复·C(可能同一首)·同「我创建·。」
	"汪苏泷 - 那个男孩",
	/* ===LREnd */
	/* li·刘某人 黄某人 奖励哥 */
	"Lemon Tree - Fool's Garden", // 可能重复·A(高度相似)
	"许嵩 - 有何不可",
	"那女孩对我说", // 可能重复·A(高度相似)
	"黄义达 - 那女孩对我说",
	"Free Loop-七元", // 可能重复·B(较可能同一首)
	"遥望-Beyond",
	"永久指针-海贼王片尾曲",
	"Life Is Like A Boat（生如行舟）",
	/* li·end */
	"听(DJ阿哲版)-LF路飞",
	"最美的瞬间 (女版)_弹棉花的小花", // 可能重复·A(高度相似)
	"顿啦 爱你（小花版）-弹棉花的小花", // 可能重复·A(高度相似)
	"新疆美丽公主组合 - 欢乐的跳吧", // 同「我创建·。」
	"徐怀钰 - 踏浪 (Live)", // 可能重复·B(较可能同一首)
	"郁可唯 - 路过人间",
	"Ofenbach、Brodie Barclay - You Don't Know Me",
	"精卫-30年前，50年后",
	"弹吉他的小马哥 - 逃",
	"毛不易 - 牧马城市",
	"周传雄 - 黄昏 (Live)", // 可能重复·B(较可能同一首)
	"苏天伦 - 黄昏 (DJ版)",
	"周传雄 - 黄昏",
	"我爱他_王小帅", // 可能重复·A(高度相似)
	"孔柏森 - 我爱他 (片段)",
	"王小帅 - 我爱他",
	"我还能把你抢回来", // 可能重复·A(高度相似)
	"白雲兮、DJ家兴、寐加岛-我还能把你抢回来",
	"Зая（扎娅）", // 可能重复·A(高度相似)
	"Бамбинтон - Зая (扎娅)", // 同「我创建·two」
	"笼",
	"许嵩 - 断桥残雪", // 可能重复·A(高度相似)
	"断桥残雪--许嵩",
	"许嵩 - 多余的解释",
	"许嵩 - 幻听", // 特殊项xx ren // 可能重复·B(较可能同一首)
	"许嵩 - 庐州月", // 可能重复·A(高度相似)
	"庐州月--许嵩",
	"怨苍天变了心", // 可能重复·A(高度相似)
	"王小帅 - 怨苍天变了心",
	"南合文斗 - 让泪化作相思雨",
	"有幸来过",
	"原谅", // 可能重复·A(高度相似)
	"张玉华 - 原谅",
	"我的眼泪你的战利品", // 可能重复·A(高度相似)
	"于冬然 - 我的眼泪你的战利品",
	"走着走着就散了", // 可能重复·A(高度相似)
	"庄心妍 - 走着走着就散了",
	"天亮以前说再见", // 可能重复·A(高度相似)
	"何野 - 天亮以前说再见",
	"曲艳娇 - 天亮以前说再见 (片段)",
	"杨硕哥哥 - 天亮以前说再见 (杨硕 remix)", // 小闪电版（杨硕版缺）
	"沈园外", // 可能重复·A(高度相似)
	"阿YueYue、戾格、小田音乐社 - 沈园外",
	"夜曲 清空 to she",
	"男人哭吧不是罪",
	"光明", // 可能重复·A(高度相似)
	"谭艳 - 光明",
	"我曾", // 可能重复·A(高度相似)
	"鱼大仙儿 - 我曾",
	"我好像在哪里见过你",
	"做我老婆好不好", // 可能重复·A(高度相似)
	"刘大壮 - 做我老婆好不好 (Live片段)", // 待添加（原版需音乐包）
	"徐誉滕 - 做我老婆好不好", // DJ版（原版需音乐包）
	"单恋一枝花", // 可能重复·A(高度相似)
	"张宇 - 单恋一枝花",
	"蝴蝶花", // 可能重复·C(可能同一首)
	"李健 - 蝴蝶花 (Live)",
	"钱来钱来",
	"想-朱添泽", // 可能重复·C(可能同一首)
	"朱添泽 - 想 (DJ版)",
	"麻雀", // 可能重复·A(高度相似)
	"讲真的", // 可能重复·A(高度相似)
	"唯一", // 可能重复·A(高度相似) 以后再看
	"告五人 - 唯一",
	"孙语赛、萧全 - 不仅仅是喜欢", // 可能重复·B(较可能同一首)
	"黄榕生 - 青春留白",
	"篝火旁", // 可能重复·A(高度相似)
	"雨花石",
	"茂茂呀 - 洪荒之力 (越南鼓)", // 同「我创建·。」
	"羽·泉、黄征 - 奔跑", // 可能重复·B(较可能同一首) 旅游[团队]
	"金玟岐 - 岁月神偷",
	"馒头 - 胖人愁 (变音版)", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"杨丞琳 - 雨爱",
	"海来阿木_浮生记",
	"米津玄師、DAOKO - 打上花火",
	"Cornfield Chase",
	"Thr rain - 久石譲",
	"Are you OK.m4a",
	"蔡淳佳 - 对不起我爱你", // 可能重复·C(可能同一首)
	"小霞、海洋Bo - 向云端",
	"DJ马哥 - 最火OK (DJ版)",
	"别想她_高进", // 可能重复·A(高度相似)
	"阿冗 - 别想她 (片段)",
	"James Newton Howard - Chase Across DC", // 同「我创建·。」
	"Nightwish - Last Ride Of The Day",
	"张佳乐 - 忘记时间 (温柔版)",
	"黄雅莉 - 蝴蝶泉边",
	"源辰 - Two Steps From Hell-Star Sky (源辰 Remix)",
	"少不更事 - 浅影阿", // 可能重复·B(较可能同一首)
	"梁静茹 - 会呼吸的痛",
	"林俊杰 - 美人鱼",
	"林俊杰 - 江南", // 同「我创建·默认收藏、。」
	"林俊杰 - 背对背拥抱",
	"明天过后-张杰", // 可能重复·A(高度相似)
	"李克勤、周深 - 天下有情人 (Live)",
	"7爷、9爷 - 漫步人生路 (DJ版)", // 可能重复·C(可能同一首)
	"一杯陈豆浆 - 漫步人生路",
	"大宝 - 青海摇",
	"N29 - SADDDDDDDD",
	"十三叔 - 囧架架 (DJ版)",
	"官云康 - 穿越时空的思念", // 可能重复·B(较可能同一首)
	"阿梨粤 - 秒针", // 可能重复·B(较可能同一首)
	"9馨 - Bater Official", // 可能重复·B(较可能同一首)
	"郝琪力、书岩 - 黎明前的黑暗",
	"Bater official - 迷人的危险",
	"蔡黄汝 - 迷人的危险",
	"无敌灏克 - Bater official (DJ版)", // 待添加（原版需音乐包）
	"Dschinghis Khan - Moskau",
	"刘大壮 - 会不会 (吉他版)", // 可能重复·C(可能同一首)
	"白小白 - 会不会",
	"林俊杰 - 修炼爱情",
	"221小伙伴 - 遥远的你 (室友合唱版片段)", // 可能重复·B(较可能同一首)
	"Achim Reichel - Aloha Heja He", // 张同学·同「我创建·two」
	"Adam Clayton、Larry Mullen Jr. - Theme From Mission：Impossible",
	"Ahxello - Horizon (地平线)", // 可能重复·B(较可能同一首)
	"Janji - Horizon (地平线)", // 同「我创建·。」
	"Alan Walker - Faded", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"DJ潇洒先生、马帅帅、M爷 - Wake (DJ版)",
	"ANU - FLY", // 可能重复·C(可能同一首)
	"ANU - FLY-飞",
	"BGM供货商 - 通往胜利 (钢琴版)", // 同「我创建·默认收藏」
	"任然 - 后继者",
	"Cagnet - 24／7 (演奏曲)",
	"Calypso、DJ Despacito、Échame La Culpa - Despactio",
	"虎二 - 一百万个可能",
	"阿禹ayy - 盗墓笔记·十年人间 (片段)",
	"李常超（Lao乾妈） - 盗墓笔记·十年人间",
	"Corki - 下坠Falling", // 可能重复·B(较可能同一首)
	"Cuishan He - If You’re Happy",
	"凤凰传奇 - 感到幸福你就拍拍手", // 同「我创建·儿歌」
	"DJ蚕豆好吃 - Lendo Calendo", // 可能重复·B(较可能同一首)
	"Dan Balan、Tany Vander、Brasco - Lendo Calendo",
	"dwayne ford - Perseus",
	"ediq - 路过八零",
	"en - 可不可以 (片段)", // 可能重复·B(较可能同一首)
	"en(王翊恩)-嚣张",
	"Epic Score - You Must Overcome",
	"艾辰 - 你,好不好",
	"F.I.R.飞儿乐团 - 你的微笑",
	"F.O.O.L - Criminals (罪犯)",
	"G.E.M.邓紫棋 - 来自天堂的魔鬼",
	"GooGoo - 不要慌太阳下山有月光",
	"G.G - 小可爱与小领带", // 可能重复·B(较可能同一首)
	"ghfhgfyg - 王者荣耀 (口白)",
	"GTRS - 伊格赛听-谪仙 (DJR7版)", // 可能重复·B(较可能同一首)
	"hea2t - 恋殇", // 可能重复·B(较可能同一首)
	"iw ix - 月光の雲海 (月光下的云海)",
	"Klaus Badelt - He's a Pirate (他是海盗)", // 同「我创建·默认收藏」
	"Lefty Hand Cream - 恋音と雨空 (恋歌与雨天)",
	"Li-2c - 隔岸观火", // 可能重复·B(较可能同一首)
	"LKer林柯 - 满目星辰皆是你", // 可能重复·B(较可能同一首)
	"林宁 - 满目星辰皆是你",
	"MC天子、夏沫MOMO - 不爱又何必纠缠",
	"MC浪子楚阳 - 江海不渡你 (烟嗓版)", // 可能重复·C(可能同一首)
	"MJ-7 - Sorry 对不起",
	"MuSik I、满舒克、廖伟珊 - My Heart Will Go On",
	"Rompasso - Angetenar (安捷纳尔)(Subkills Remix)",
	"S.H.E - 不想长大",
	"Sami & Sasha - Love You Like A Love Song",
	"Sand - CHINA-2",
	"Sand - China-4",
	"Steven Burke - Hero's Theme (英雄之魂)", // 可能重复·B(较可能同一首)
	"Suprafive、Kelly Clarkson - Catch My Breath (Remix)", // 可能重复·C(可能同一首)
	"久石譲 - Mad Summer (疯狂的夏天)",
	/* 260307 */
	"宋拾一 - 深爱过的人怎么放手",
	"000x - 酒喝不尽磕唠不完", // 同「我创建·改编/鬼畜/片段/DJ」
	"1coco - 把回忆拼好给你 (0.8)",
	"ALisa - insomnia (治愈版)",
	"hanser - 恋爱循环",
	"郑源 - 别说我的眼泪你无所谓",
	"丢火车乐队 - 火车日记 (2021枣庄热浪音乐节现场)",
	"于毅 - 灵魂咒",
	"今晚打老虎 - 客官不可以 (58秒Live 片段)",
	"伦桑、橙光音乐 - 山有木兮",
	"凯瑟喵 - 撒野",
	"凯瑟喵 - 谎",
	"刘嘉亮 - 你到底爱谁",
	"刘楚 - 爱了就痛",
	"刘欢 - 从头再来", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"刘瑞琦 - 房间",
	"华晨宇 - 寻",
	"华语群星 - 北京东路的日子", // 可能重复·B(较可能同一首)
	"南辰Music - 琴师 (二胡版)", // 同「我创建·。」
	"后弦 - 9公主 (国语)",
	"后弦 - 西厢",
	"唐磊 - 丁香花", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"大莱 - 男人要坚强",
	"嫣木果果 - 爱情36度8",
	"小右 - 你是我的女朋友", // 可能重复·B(较可能同一首)
	"小右(陈柯右) - 你是我的女朋友",
	"陈柯右 - 你是我的女朋友",
	"小洲 - 怀念青春", // 可能重复·B(较可能同一首)
	"小洲 - 爱情 (DJ版)", // 可能重复·B(较可能同一首)
	"小贱（谭冰尧） - 欠你的太多",
	"崔羽明 - 爱如指间沙",
	"张玮伽 - 海浪", // 可能重复·B(较可能同一首)
	"黄品源 - 海浪",
	"徐良 - 七秒钟的记忆", // 可能重复·B(较可能同一首)
	"徐良、孙羽幽 - 七秒钟的记忆",
	"徐良 - 犯贱", // 可能重复·B(较可能同一首)
	"徐良、阿悄 - 犯贱 (Remix版)",
	"徐良、阿悄 - 犯贱",
	"搬运工 - 反正他都不难受", // 同「我创建·改编/鬼畜/片段/DJ」
	"文静 - 要多美有多美",
	"旺仔小乔 - 失控 (14秒片段)", // 同「我创建·改编/鬼畜/片段/DJ」
	"未知歌手 - 独忆 (红旗)", // 可能重复·B(较可能同一首)
	"网络歌手 - 独忆 (红旗)",
	"末喏 - 纪念", // 可能重复·B(较可能同一首)
	"西洛卡 - 纪念",
	"来一碗老于 - 我好想你 (28秒片段)", // 同「我创建·改编/鬼畜/片段/DJ」
	"梁炜️（黄瓜哥） - 新娘嫁人了新郎不是我", // 同「我创建·改编/鬼畜/片段/DJ」
	"梦飞船 - 不值得",
	"汪苏泷 - 专属味道", // 可能重复·B(较可能同一首)
	"汪苏泷、林希儿 - 专属味道",
	"汪苏泷 - 巴赫旧约", // 可能重复·B(较可能同一首)
	"沈唁 - 一直想着他",
	"浪子兮 - 别看了会上 瘾 (Remix)",
	"深七 - 你说别再笑了", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"王呈章 - 舍得", // 可能重复·B(较可能同一首)
	"王恩信Est、二胖u - 你走以后1.0",
	"王恩琦 - 会有天使替我爱你",
	"王曼力 - 东北虎",
	"王梦露 - 世本常态", // 可能重复·B(较可能同一首)
	"石雪峰 - 爱情没钱就不行",
	"祥嘞嘞 - 难却", // 可能重复·B(较可能同一首)
	"秋裤大叔 - 三十年后的我",
	"秋裤大叔 - 我这样的男人",
	"秋裤大叔 - 有故事的男人",
	"罗大佑 - 恋曲1990", // 可能重复·B(较可能同一首)
	"高胜美 - 恋曲1990",
	"胡夏 - 夏至未至",
	"胡夏 - 念",
	"苏星辰 - 删了吧",
	"苏琛 - 不定",
	"蔡健雅 - 红色高跟鞋", // 可能重复·C(可能同一首)
	"韩雪、刘敏涛、万茜 - 红色高跟鞋 (Live)",
	"刘大壮 - 红色高跟鞋 (片段)",
	"蔡炆天 - 主播也有爱",
	"薛之谦 - 意外", // 可能重复·B(较可能同一首)
	"薛之谦 - 暧昧", // 可能重复·B(较可能同一首)
	"杨丞琳 - 暧昧",
	"袁成杰 - 拥抱到最后",
	"许嵩 - 城府", // 可能重复·B(较可能同一首)
	"赵俊飞、DJ YiXiu、圈妹 - 我们都在用力的活着 (45秒片段)",
	"迪总 - 江归江山归山 (DJ版片段)",
	"郑毅 - 贝多芬的悲伤",
	"阮言Ruany - 琉璃 (32秒片段)",
	"陈旭 - 边做边爱",
	"颜小健 - 一不小心", // 可能重复·B(较可能同一首)
	"马沂茹 - 我不痛",
	"马磊 - 给我个理由就好",
	"黄品源 - 你怎么舍得我难过", // 可能重复·B(较可能同一首)
	"小阿枫 - 你怎么舍得我难过",
	// ===
	"SWIN-S - 只因你太美",
	"华语群星 - Super Star (2023青岛大学毕业典礼现场)",
	"杨仁清 - 是我一人放不下", // 可能重复·B(较可能同一首)
	"杨仁清、苏小纯 - 是我一人放不下",
	"李荣浩、王俊凯 - 李白 (Live)", // 可能重复·C(可能同一首)
	"李荣浩 - 李白",
	// ===End
	"Anna Yvette、Rootkit - Against The Sun", // 可能重复·B(较可能同一首)
	"Rootkit、Anna Yvette - Against The Sun", // 同「我创建·two」
	"Anuo. - 喜欢你 (x0.8)",
	"Armağan Oruç - Gun Double",
	"Audiomachine - Breath And Life (呼吸与生命)",
	"Audiomachine - The New Earth (No Choir)",
	"Austin Mahone、Rich Homie Quan - Send It (网友改编)",
	"Avicii - The Nights (DJ NOXMU版)",
	"Ayo97、周思涵 - 感谢你曾来过",
	"B216_ - 无感 (纯音乐0.8x慢速) (remix)",
	"BachBeats - Super Love",
	"BOSS HAN - 搞笑音乐", // 同「我创建·改编/鬼畜/片段/DJ」
	"Brass Roots - Chachita",
	"Christina Aguilera、A Great Big World、Sebastien - Say Something (Sebastien Remix)",
	"CNBALLER、DP龙猪、CLOUDWANG 王云 - 全部都是你", // 可能重复·B(较可能同一首)
	"周翊涛、李宏镇、郑人予、许文哲 - 全部都是你 (Live)",
	"CNBALLER、DP龙猪、王云 Cloud Wang - 全部都是你",
	"CO1 - 给陌生的你听 (0.8x)",
	"Cypis - Gdzie jest biały węgorz", // 可能重复·B(较可能同一首)
	"Cypis - Gdzie jest biały węgorz？(Zejśćie) (“白鳗鱼”在哪里)(Explicit)",
	"Cypis - Gdzie jest biały węgorz？(Zejśćie) (Explicit)",
	"D1ofAquavibe - The Happy Troll",
	"Damon Empero - I Promise (我承诺)", // 可能重复·B(较可能同一首)
	"Damon Empero - I Promise",
	"Dancelife Orchestra - Espana cani (Paso Doble ／ 60 BPM)",
	"dancing baby - 真真真的爱 (TV版)", // 可能重复·B(较可能同一首)
	"dancing baby - 真真真的爱",
	"Daniel Yount - Novera (诺维拉)", // 可能重复·B(较可能同一首)
	"Daniel Yount - Novera", // 同「我创建·默认收藏」
	"Devotion - My Prayer",
	"DJ HAI CENA - Not the One (不是那个)", // 可能重复·B(较可能同一首)
	"DJ HAI CENA - Not the One", // 同「我创建·two」
	"DJ HAI CENA - Not The One (Complete Version)",
	"DJ Okawari - Luv Letter (情书)", // 可能重复·A(高度相似)
	"DJxia Y、龍先森 - 步步 (-0.8x)",
	"DJ沈念、承利 - 爱情主演 (咚鼓版)",
	"Don Omar、Lucenzo - Danza Kuduro",
	"Electronic Arts - Red Alert 3 Theme： Soviet March", // 可能重复·B(较可能同一首)
	"Electronic Arts - Soviet March",
	"Eleonora Gioeni、Angelo Compagnoni、Anna Amato - Paper Sun",
	"Epic Score - Advancing the Troops (推进部队)", // 可能重复·B(较可能同一首)
	"Epic Score - Advancing the Troops",
	"Epic Score - Freedom Is Ours (No Vocals)",
	"Epic Score - Full Armor Full Force (全副武装 全力出击)", // 可能重复·B(较可能同一首)
	"Epic Score - Full Armor Full Force",
	"Epic Score - Make Your Own Fate",
	"Epic Score - Time Will Remember Us (时间会记住我们)",
	"F-777 - The 7 Seas (七片海)", // 可能重复·C(可能同一首)
	"F-777 - The 7 Seas",
	"Fall Out Boy - Immortals", // 可能重复·B(较可能同一首)
	"GANK - Resurrection",
	"Harry George Lightfoot - Rebirth (重生)",
	"Htikkw - Waka (0.7X)",
	"i5 - 越来越不懂 (0.8x)",
	"Idina Menzel - Let It Go",
	"Imagine Dragons - Natural (Live)", // 可能重复·B(较可能同一首)
	"Imagine Dragons - Natural (枪声版)",
	"J.Boss - Sweetie(Be_Mine)",
	"Jack Stauber - Buttercup",
	"January - 나를 위한 여행 (为了我的旅行)",
	"Jason Chen(陈以桐) - We Can't Stop", // 可能重复·B(较可能同一首)
	"Jason Chen - We Can't Stop",
	"Jasper Forks - River Flows In You (你的心河)", // 可能重复·B(较可能同一首)
	"Martin Ermen - River Flows In You (你的心河)",
	"Jim Yosef - Link (连接)",
	"John Dreamer - Rise (上升 - 史诗音乐)", // 可能重复·A(高度相似)
	"The Glitch Mob、Mako、The Word Alive - RISE",
	"Rise - Epic Music (崛起 - 史诗音乐)",
	"True Strength - Epic Music",
	"John Dreamer - Rise - Epic Music",
	"John Dreamer - True Strength - Epic Music",
	"John Dreamer - Rise (上升)",
	"Jonathan Buchanan - Champions (冠军)", // 可能重复·B(较可能同一首)
	"Jonathan Buchanan - Champions",
	"July - A cut in Love", // 可能重复·B(较可能同一首)
	"July - In Love",
	"K.Williams - 卡农变奏曲",
	"K-391 - Summertime (夏日时光)", // 同「我创建·默认收藏、。」
	"K-391、Alan Walker、Julie Bergan、胜利 - Ignite",
	"Kenny G - Going Home (纯音乐)",
	"Kevin MacLeod - Scheming Weasel (faster version)",
	"Kiiiu_ - 怪咖 (降调版)",
	"Lady Gaga - Poker Face (Makkur Remix)", // 可能重复·B(较可能同一首)
	"Lady Gaga - Poker Face", // 同「我创建·和平精英音乐合集、QQ飞车音乐合集哈」
	"Lady Gaga - Poker Face (remix：Makkur)", // 同「我创建·two」
	"LIUXY-XY - 女孩 (0.8x片段)", // 可能重复·C(可能同一首)
	"LIUXY-XY - 女孩 (0.8)",
	"Ludwig van Beethoven - 命运交响曲",
	"MAKE-UP - ペガサス幻想", // 可能重复·C(可能同一首)
	"Mark Petrie - Go Time (出发时间)", // 可能重复·B(较可能同一首)
	"Mark Petrie - Go Time",
	"Mark.kevin(허야동) - Suspense opening", // 可能重复·B(较可能同一首)
	"Mark.kevin - Suspense opening",
	"MC贱人 - 我们毕业了",
	"MC颖三儿、蔚蓝 - 百家姓", // 同「我创建·默认收藏」
	"Michael Conn - Pitcairn Story",
	"Michael Hunter - The Theme From San Andreas",
	"MOONBOI(杨望舒)、李开心 - 可不可以给我你的微信", // 可能重复·A(高度相似)
	"曹珅 - 可不可以给我你的微信", // 同「我创建·改编/鬼畜/片段/DJ」
	"MoreanP - Feeling The Rain",
	"Muzikfabrik、Anatoliy Frolov - Leaving (DJ版片段)", // 可能重复·C(可能同一首)
	"Nana、Booya Family - Lonely (2021 Remastered Version)",
	"Nanne Grönvall - Håll om mig",
	"Nino学长 - 若之前",
	"Phao、CM1X - Hai Phút Hơn (两分多钟)(Remix)", // 可能重复·B(较可能同一首)
	"Pháo、CM1X - Hai Phút Hơn (两分多钟)(Remix)",
	"Philter - Adventure Time (冒险时刻)", // 可能重复·B(较可能同一首)
	"Philter - Adventure Time",
	"Position Music - Man At Arms (重骑兵)", // 同「我创建·默认收藏」
	"PSY - Gentleman",
	"Really Slow Motion - Deadwood Main (朽木主题)",
	"Rezz - Edge (边缘)",
	"Richard Clayderman - A Comme Amour (秋日的私语)", // 可能重复·C(可能同一首)
	"Richard Clayderman - Für Elise (致爱丽丝)",
	"Sia、Alan Walker - Move Your Body (Alan Walker Remix)", // 同「我创建·two」
	"Sia、ZAYN - Dusk Till Dawn (DJ愉先生版)",
	"Silver Screen、久升音艺 Silver Screen - Beneath The Horizon", // 可能重复·B(较可能同一首)
	"Skrillex、Sirah - Bangarang",
	"Space - Just Blue (只有蓝色)",
	"SteveGlen - 震撼大气开场音乐.wav", // 可能重复·B(较可能同一首)
	"SteveGlen - 震撼大气开场音乐",
	"TAIGA - Middle Of The Night (Extended Mix)",
	"Tăng Duy Tân、BAE - Dạ Vũ (夜舞)",
	"TFBOYS - 浪花一朵朵 (MV版)",
	"TFBOYS - 我和2035有个约 (Live)",
	"TheFatRat - Unity (团结)", // 可能重复·B(较可能同一首)
	"TheFatRat - Unity",
	"TheFatRat - Xenogenesis",
	"Thomas Bergersen - El Dorado (黄金国)(Dubstep Remix)",
	"Thomas Bergersen - Empire of Angels (天使之城)", // 可能重复·B(较可能同一首)
	"Thomas Bergersen - Empire of Angels",
	"Tiger JK、Jinsil - Reset (伴奏)",
	"Timmy Trumpet、XING KONG、SAVAGE - Freaks (怪物)(XING KONG When Mom Isn't Home Edit ｜ Bass Boosted)",
	"Tobu - Higher (更高)", // 可能重复·B(较可能同一首)
	"Tobu - Higher",
	"Toby Fox - His Theme (他的主题)", // 可能重复·B(较可能同一首)
	"Toby Fox - His Theme",
	"Toby Fox - Megalovania (狂妄之人)",
	"Tule、Chris Linton - Fearless Pt. II", // 可能重复·B(较可能同一首)
	"Lost Sky、Chris Linton - Fearless Pt. II",
	"Turtles - 빙고 (答对了)", // 可能重复·B(较可能同一首)
	"乌龟组合 - 빙고 (答对了)", // 同「我创建·two」
	"Two Steps From Hell - Archangel",
	"Two Steps From Hell - Atlantis",
	"Two Steps From Hell - Disappear", // 可能重复·B(较可能同一首)
	"Two Steps From Hell、Thomas Bergersen - Disappear",
	"Two Steps From Hell - Dragon Rider (龙骑士)", // 可能重复·B(较可能同一首)
	"Two Steps From Hell - Dragon Rider",
	"Two Steps From Hell - Protectors of The Earth",
	"Vanni G - I Say Yeah (DJ蔡萝莉版)",
	"Vexento - Anesthesia (麻木)",
	"Vexento - Masked Heroes (蒙面英雄)",
	"Virtual Riot - Energy Drink (能量饮料)", // 可能重复·B(较可能同一首)
	"Virtual Riot - Energy Drink", // 同「我创建·默认收藏、two」
	"W.K. - 逆战 (王者荣耀版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"Waiss ANG、Memo Cash - Dein Weg",
	"XXXDAION - 默 (0.8×)",
	"Y2002 - 澜拿蓝 (王者版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"Yoav Goren - Tales of the Electric Romeo (电气罗密欧的故事)", // 可能重复·B(较可能同一首)
	"Yoav Goren - Tales of the Electric Romeo",
	"Zedd、Jon Bellion - Beautiful Now", // 同「我创建·默认收藏、two」
	"Zwette、Tom Rosenthal - Go Solo",
	"Бамбинтон - 3aR",
	"阿宝 - 山丹丹开花红艳艳", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"王二妮 - 山丹丹开花红艳艳", // 同「我创建·Yy」
	"阿里郎 - 隔壁泰山",
	"阿桑 - 寂寞在唱歌", // 可能重复·B(较可能同一首)
	"阿细 - 高山低谷 (片段)",
	"阿悠悠 - 你若三冬",
	"艾辰 - 盗将行", // 可能重复·B(较可能同一首)
	"花粥、马雨阳 - 盗将行",
	"艾辰 - 归还",
	"艾辰 - 桃花凉",
	"艾辰 - 为你写诗", // 可能重复·B(较可能同一首)
	"TTTony - 为你写诗",
	"艾热AIR、JelloRio李佳隆 - 星球坠落 (Live)",
	"艾一 - 我们不一样",
	"爱吃巧乐兹 - 山海 (合唱版片段)", // 可能重复·B(较可能同一首)
	"万豹 - 山海",
	"安辞 - 原来占据你内心的人不是我 (cover： 贺一航)",
	"安小木 - 少年 (男声版)", // 可能重复·C(可能同一首)
	"梦然 - 少年",
	"安筱冷 - Sexy lady (Original Mix)",
	"八云轨 - 秒 · 清风",
	"巴巴贝 - 侧脸 (片段)", // 可能重复·C(可能同一首)
	"于果 - 侧脸",
	"白一阳 - 忍者时代即将结束 (白一阳 remix)",
	"百石元 - 楽しいねぇ", // 可能重复·B(较可能同一首)
	"百石元 - 楽しいねぇ♪",
	"百石元 - 猪突猛進", // 可能重复·B(较可能同一首)·同「我创建·two」
	"坂本龍一 - Merry Christmas Mr.Lawrence (圣诞快乐,劳伦斯先生)",
	"鲍比达、黄霑 - 定情", // 可能重复·B(较可能同一首)
	"北川同学 - 日不落 (片段)", // 可能重复·C(可能同一首)
	"蔡依林 - 日不落",
	"贝瓦儿歌 - 茉莉花", // 可能重复·B(较可能同一首)·同「我创建·儿歌」
	"笨蛋在嘛 - 心做し (0.8x)",
	"冰冰超人 - 杰出星空",
	"不是花火呀 - 不知所措 (片段)", // 可能重复·C(可能同一首)
	"王靖雯 - 不知所措",
	"布仁巴雅尔、乌日娜、英格玛、华语群星 - 吉祥三宝 (蒙语)",
	"才旦卓玛 - 北京的金山上", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"才旦卓玛 - 在北京的金山上", // 同「我创建·Yy」
	"索朗旺姆 - 北京的金山上", // 同「我创建·Yy」
	"才旦卓玛 - 唱支山歌给党听", // 同「我创建·Yy」
	"蔡舜禹、张一末（灰老板） - 断念", // 可能重复·B(较可能同一首)
	"蔡沐崎_Cais、张一末（灰老板） - 断念",
	"灿烂 - 魑魅魍魉",
	"禅颜、一柠吖 - 官方的回答 (好听度版)", // 可能重复·B(较可能同一首)
	"一柠吖、一K先生 - 官方的回答 (好听度版)",
	"陈柏宇 - 你满我满 (DJ版)",
	"陈逗逗 - 简单点",
	"陈红 - 常回家看看", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"陈涓 - 相见难别亦难", // 可能重复·B(较可能同一首)·同「我创建·西游记音乐合集」
	"陈明 - 快乐老家",
	"陈星 - 流浪歌",
	"陈学冬 - 不再见",
	"陈雅森 - 温柔乡",
	"陈奕迅 - 孤勇者",
	"陈奕迅 - 红玫瑰", // 可能重复·B(较可能同一首)
	"宸荨 - Morsmordre (DJ版)", // 可能重复·B(较可能同一首)
	"大腾子 - Morsmordre (DJ版)",
	"成龙、吴京 - 中国", // 可能重复·B(较可能同一首)·同「我创建·gg」
	"郭峰 - 中国",
	"承利 - 一个人的北京",
	"承利、苏小纯 - 是我放不下",
	"川 - 落空 (0.8X)",
	"纯音乐 - FAKE LOVE", // 可能重复·B(较可能同一首)
	"辛永吉 - FakeLove",
	"崔伟立 - 对面的小姐姐 (DJ何鹏版)",
	"哒斯！ - 过去的就让它过去吧",
	"大D(DLyn)、驴 - 小毛驴之歌", // 同「我创建·儿歌、改编/鬼畜/片段/DJ」
	"大柯 - 看透以后",
	"大柯 - 喜欢",
	"大壮 - 差一步",
	"德干旺姆 - 香巴拉并不遥远", // 可能重复·B(较可能同一首)
	"邓超 - 无敌",
	"邓超、李晨、陈赫、郑恺、鹿晗、王祖蓝 - 超级英雄 (Live)",
	"邓超、佟大为、黄晓明 - 光阴的故事", // 可能重复·B(较可能同一首)
	"罗大佑 - 光阴的故事",
	"邓丽君 - 路边的野花不要采", // 同「我创建·Yy」
	"邓壬鑫 - 告白之夜 (治愈版)", // 可能重复·B(较可能同一首)
	"Leon不太冷的邓壬鑫 - 告白之夜 (治愈版)",
	"翟迎新 - 鬼子进村", // 可能重复·B(较可能同一首)·同「我创建·电视剧、改编/鬼畜/片段/DJ」
	"第五个季节 - @第五个季节创作的原声一第五个季节",
	"丁译林 - 我们", // 可能重复·B(较可能同一首)
	"杨清纯 - 我们",
	"刘初寻、白色 - 我们",
	"丢丢 - 伤自己",
	"豆包 - 此生过半 (DJ阿卓版)", // 可能重复·B(较可能同一首)
	"豆包 - 此生过半",
	"嘟比Dubi、匀子 - 好像掉进爱情海里",
	"段丽阳 - 爸爸妈妈听我说", // 同「我创建·儿歌」
	"段丽阳 - 超级拍档",
	"队长 - 哪里都是你",
	"对爱的执念从不是海 - 和你 (0.85x)",
	"樊十三 - 幹物女 (0.8)",
	"范小蛙 - 会长大的幸福",
	"房东的猫 - 所念皆星河 (Live)",
	"费翔 - 冬天里的一把火",
	"费翔 - 故乡的云",
	"风起词 - 玫瑰少年 (小提琴版)", // 可能重复·B(较可能同一首)
	"五月天 - 玫瑰少年",
	"BGM热曲 - 玫瑰少年 (钢琴版)",
	"封茗囧菌 - アイロニ (反语)(Demo)",
	"凤凰传奇 - 最炫民族风 (广场舞版)", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"缝纫机乐队 - 都选C",
	"付雪 - 金玉良缘",
	"傅许 - 寂静之空",
	"傅许 - 桜花雨 (樱花雨)", // 可能重复·B(较可能同一首)
	"傅许 - 桜花雨",
	"高安、杭娇 - 一生无悔",
	"高进 - 正义之道 (Live)",
	"格格 - 雪莲", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"葛顺 - Tears", // 可能重复·B(较可能同一首)
	"OCTOBER - Tears",
	"葛顺 - 一个人的浪漫",
	"跟风超人 - 你打不过我吧", // 同「我创建·改编/鬼畜/片段/DJ」
	"顾峰、斯琴高丽 - 猜",
	"顾嘉辉 - Mark's Theme", // 可能重复·B(较可能同一首)
	"顾嘉煇 - Mark's Theme",
	"顾小柒 - 怕的不是等 是等不到", // 同「我创建·改编/鬼畜/片段/DJ」
	"冠军 - 11 (0.8X)",
	"冠军 - 人鱼的眼泪 (0.8X)",
	"冠军 - 做我的猫 (0.8X)",
	"鬼岛、MC演绎超 - 我的天空 (DJ版)", // 可能重复·C(可能同一首)
	"南征北战NZBZ - 我的天空",
	"郭顶 - 我们俩", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"郭美美 - 不怕不怕", // 可能重复·B(较可能同一首)
	"海伦 - 桥边姑娘",
	"海梦 - 红色高跟鞋 (0.8x)",
	"海梦 - 千年泪 (0.8x)",
	"涵の心事. - 先说谎的人 (0.8X)",
	"韩ye - Dancing With Your Ghost (Remix)", // 可能重复·B(较可能同一首)
	"Jerry - Dancing With Your Ghost (Remix)",
	"Sasha Alex Sloan - Dancing With Your Ghost",
	"韩宝仪 - 你潇洒我漂亮",
	"韩红 - 天亮了 (Live)", // 可能重复·C(可能同一首)
	"韩红 - 祖国不会忘记", // 可能重复·B(较可能同一首)·同「我创建·gg」
	"韩文轩 - 佳人轻抚桃花扇",
	"杭天琪 - 黄土高坡", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"航航 - 我最思念的某人",
	"好妹妹 - 不说再见", // 可能重复·B(较可能同一首)
	"好妹妹乐队 - 不说再见",
	"好想谈恋爱啊 - 喜欢你 (0.8x版)",
	"何炅、王诗龄 - 栀子花开", // 可能重复·B(较可能同一首)
	"何炅 - 栀子花开",
	"黑龙 - 我爱你你却爱着他",
	"黑猫 - 九张机", // 可能重复·B(较可能同一首)
	"叶炫清 - 九张机",
	"胡力 - 分手以后才知道最珍贵",
	"胡夏 - 如果可以 (DJ豪大大版)", // 可能重复·B(较可能同一首)
	"胡夏 - 如果可以",
	"胡夏、郁可唯 - 知否知否",
	"胡彦斌 - 不负人间", // 可能重复·B(较可能同一首)
	"阿YueYue - 不负人间",
	"胡杨林 - 香水有毒",
	"虎二 - 跨不过的距离",
	"虎二 - 你应该很快乐", // 可能重复·B(较可能同一首)
	"花姐 - 狂浪",
	"花僮 - 公子向北走",
	"花粥 - 归去来兮", // 可能重复·B(较可能同一首)
	"叶炫清 - 归去来兮",
	"花粥、王胜娚 - 出山", // 可能重复·B(较可能同一首)
	"馅儿、汤汤不理 - 出山",
	"华语群星 - 爸爸去哪儿 (改编版片段)",
	"华语群星 - 北京欢迎你", // 同「我创建·gg、Yy」
	"华语群星 - 歌舞：找朋友 (Live)", // 同「我创建·儿歌」
	"华语群星 - 舞法天女",
	"华语群星 - 真心英雄",
	"黄飞鸿 - 拾忆", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"王欣宇 - 拾忆",
	"张翰 - 拾忆 (快四版)",
	"苏琛 - 拾忆 (伴奏)",
	"苏琛 - 拾忆",
	"黄宏、魏宗万、徐玉琨 - 弹棉花 (TV版)", // 同「我创建·电视剧」
	"黄龄 - High歌",
	"黄龄 - 痒",
	"黄圣依 - 只要为你活一天", // 可能重复·C(可能同一首)
	"黄诗佳 - 樱花草", // 可能重复·B(较可能同一首)
	"黄依玲 - 只对你有感觉", // 可能重复·B(较可能同一首)
	"飞轮海、田馥甄 - 只对你有感觉",
	"黄英华 - Opening", // 可能重复·B(较可能同一首)
	"黄霑 - 傲气傲笑万重浪 (终曲)", // 同「我创建·two」
	"黄霑 - 男儿当自强", // 可能重复·B(较可能同一首)
	"成龙 - 男儿当自强",
	"林子祥 - 男儿当自强",
	"火火兔 - 一闪一闪亮晶晶", // 同「我创建·儿歌」
	"霍建华、赵丽颖 - 不可说", // 可能重复·B(较可能同一首)·同「我创建·花千骨」
	"姬神 - 千年の祈り (千年的祈祷)",
	"吉田潔 - はるかな旅 (远行)",
	"贾玲、刘维 - 感觉自己萌萌哒", // 同「我创建·儿歌」
	"贾乃亮 - 炽热的青春", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"贾青 - 傻得可以",
	"简弘亦 - 出卖 (DJ阿所版)", // 可能重复·B(较可能同一首)
	"简弘亦 - 出卖",
	"姜鹏Calm - Lover Boy 88 (Live片段)", // 可能重复·C(可能同一首)
	"刘亦心(可乐就是力量) - Lover Boy 88 (片段)",
	"姜奕呈 - 今天你弹弹堂了吗",
	"蒋大为 - 送别", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"朴树 - 送别",
	"蒋龙 - 行者",
	"蒋先生、DJ阿金、李安芳 - DA DA DA", // 可能重复·B(较可能同一首)
	"Tanir、Tyomcha、Tanir & Tyomcha - Da Da Da",
	"Tanir & Tyomcha - Da Da Da", // 同「我创建·。」
	"蒋欣 - 一时间",
	"蒋欣妤 - 追梦",
	"降央卓玛 - 美丽的草原我的家", // 可能重复·B(较可能同一首)
	"龚玥 - 美丽的草原我的家",
	"焦迈奇 - 我的名字",
	"叫宝宝 - 愿 (Live 片段)",
	"锦零 - 恋爱画板",
	"玖月奇迹 - 踩踩踩",
	"玖月奇迹 - 中国范儿",
	"鞠文娴 - BINGBIAN病变 (女声版)", // 同「我创建·默认收藏」
	"軍 - 喜欢你", // 可能重复·A(高度相似)
	"刘俊骐 - 好喜欢你",
	"喜欢你",
	"赵马熙汝 - 喜欢你 (翻唱版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"G.E.M.邓紫棋 - 喜欢你",
	"陈百强 - 偏偏喜欢你",
	"侃侃 - 滴答", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"来一碗老于 - 解药 (新版)",
	"蓝心羽 - 来不及 (片段)",
	"蓝心羽 - 落 (片段)",
	"蓝馨馨 - 我是否也在你心中", // 可能重复·B(较可能同一首)
	"高安、郑莉莉 - 我是否也在你心中",
	"浪子阿赛、沈晗鸢 - 海棠花下",
	"浪子康 - 没有什么不同 (浪子康Remix)",
	"老狼 - 同桌的你", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"乐池风 - 找朋友", // 可能重复·B(较可能同一首)·同「我创建·儿歌」
	"冷漠、杨小曼 - 我爱你胜过你爱我", // 可能重复·B(较可能同一首)
	"冷漠 - 我爱你胜过你爱我",
	"冷雪儿 - 可能否", // 可能重复·B(较可能同一首)
	"李代沫 - 这就是爱情",
	"李谷一 - 难忘今宵", // 可能重复·B(较可能同一首)·同「我创建·gg」
	"李哈哈 - 半壶老酒",
	"李哈哈、沈熙、沈熙 - 花开花落一地伤",
	"李佳雨 - 梨花凉",
	"李俊佑、小潘潘(潘柚彤) - 宠坏",
	"李娜 - 青藏高原", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"韩红 - 青藏高原",
	"李森 - 城市套路深 我要回农村",
	"李少白 - 山楂树之恋",
	"李晓杰 - 好姑娘", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"李鑫ya - 白山茶 (Live片段)", // 可能重复·C(可能同一首)
	"柯柯柯啊 - 白山茶 (片段)",
	"李鑫ya - 好想爱这个世界啊 (片段)", // 可能重复·C(可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"华晨宇、郎朗 - 好想爱这个世界啊 (Live)",
	"李羿慧 - 花开花落", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"梁龙、黄渤、沈腾 - 疯狂的外星人",
	"林达浪 - 不找了 (片段)", // 可能重复·C(可能同一首)
	"林俊杰 - 她说", // 可能重复·B(较可能同一首)
	"林秋楠、龙拳小子组合、RJ - 龙拳小子",
	"林希儿、精彩明sir、阴兵兄弟 - 千本樱",
	"刘大壮 - 寂寞沙洲冷 (片段)", // 可能重复·B(较可能同一首)
	"苏晗 - 寂寞沙洲冷",
	"周传雄 - 寂寞沙洲冷",
	"刘大壮 - 可惜不是你", // 可能重复·B(较可能同一首)
	"梁静茹 - 可惜不是你",
	"刘大壮 - 我不是你的宋冬野 (Live片段)",
	"刘德华 - 中国人",
	"刘欢 - 好汉歌", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"刘欢 - 好汉歌 (CCTV音乐频道)",
	"刘佳 - 爱的就是你", // 可能重复·B(较可能同一首)
	"刘佳、十二星宿 风之少年 - 爱的就是你",
	"刘三姐 - 山歌好比春江水", // 同「我创建·Yy」
	"刘思奇 - 彩虹", // 可能重复·B(较可能同一首)·同「我创建·熊出没」
	"刘玥含 - 小冤家 (俏皮女声版)", // 可能重复·C(可能同一首)
	"刘玥含 - 小冤家 (俏皮女声)", // 同「我创建·儿歌」
	"柳岩 - 男神",
	"六道 - 惊雷",
	"六三四 - 沸き上がる闘志",
	"六哲 - 潮流串烧", // 可能重复·B(较可能同一首)·同「我创建·串烧」
	"六哲 - 多情的人总被无情的伤",
	"六哲 - 你给的幸福不是我想要的",
	"陆嘉诚 - 像我这样的人", // 可能重复·C(可能同一首)
	"毛不易 - 像我这样的人 (Live)",
	"罗百吉、宝贝 - I Miss You", // 可能重复·B(较可能同一首)
	"罗高丞 - 森林时光 (TV Version)",
	"罗震环 - 我们能不能",
	"吕飞、陈星 - 离家的孩子", // 可能重复·B(较可能同一首)
	"陈星、吕飞 - 离家的孩子",
	"吕继宏、宋祖英 - 九九艳阳天", // 同「我创建·Yy」
	"麻雀音乐人 - 此地无银二百两",
	"马可 - 两生缘", // 可能重复·B(较可能同一首)·同「我创建·花千骨」
	"马天宇 - 该死的温柔", // 可能重复·B(较可能同一首)
	"马小马 - 下个，路口，见 (0.8x)",
	"麦振鸿 - 疤痕 (纯音乐)", // 可能重复·B(较可能同一首)·同「我创建·花千骨」
	"麦振鸿 - 曾经拥有 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 痴颜 (纯音乐)", // 可能重复·B(较可能同一首)·同「我创建·花千骨」
	"麦振鸿 - 美人的吻 (痴颜) (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 倒大霉 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 恩断情绝 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 戒情 (纯音乐)", // 可能重复·B(较可能同一首)·同「我创建·花千骨」
	"麦振鸿 - 念难断 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 七分伤 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 牵绊一生 (不可说) (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 天水滴 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 五上仙 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 一心修仙 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 异香 (纯音乐)", // 可能重复·B(较可能同一首)·同「我创建·花千骨」
	"麦振鸿 - 长留山 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 知晓万里 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 遵从本心 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿、罗坚 - 天下第一", // 同「我创建·电视剧」
	"馒头 - 38度6", // 可能重复·B(较可能同一首)
	"黑龙 - 38度6 (DJ小鱼儿版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"黑龙 - 38度6", // 同「我创建·改编/鬼畜/片段/DJ」
	"伤过的心谁来弥补 - 38度6 (改编版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"云凌蘑菇头 - 38度6 (改编版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"宾哥 - 38度6 (改编版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"搞笑蘑菇君 - 38度6 (改编版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"网络歌手 - 38度6 (改编版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 变态单身狗", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 吃的是啥东西", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 大哥大姐如果你要骂我就请这样骂", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 肥宅快乐歌", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 挂科版凉凉 (《凉凉》改编版)", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 鬼才会想起", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 画个圈圈祝福你", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 浪里个浪", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 两只野狗在恋爱", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 撸串之歌", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 旅行青蛙好害怕", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 灭霸之歌", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 期末之歌",
	"馒头 - 沙漠骆驼 (馒头版)", // 可能重复·B(较可能同一首)
	"展展与罗罗 - 沙漠骆驼",
	"馒头 - 沙漠骆驼", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 生僻字", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"陈同学 - 生僻字",
	"馒头 - 苏大强之歌", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 我的对象啊", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 我是一条酸菜鱼", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 小屁孩你快走开", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 嘤嘤嘤", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 在人间扎心歌",
	"馒头 - 最炫猪肉风", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"慢热的气球 - 在你的身边 (片段)", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"盛哲 - 在你的身边",
	"盛哲 - 在你的身边 (0.8x)",
	"毛阿敏 - 同一首歌", // 可能重复·B(较可能同一首)·同「我创建·儿歌」
	"毛华锋 - 奇迹再现 (DJ J.C.Zhou版)", // 可能重复·B(较可能同一首)
	"毛华锋 - 奇迹再现", // 同「我创建·默认收藏、动画片」
	"梅朵 - 如果最先遇到的人是我", // 同「我创建·默认收藏」
	"门丽、胡小宝 - 哥哥妹妹", // 可能重复·C(可能同一首)
	"哥哥妹妹 - 杀破狼",
	"萌萌哒天团 - 咖喱咖喱",
	"梦柯 - 菠萝咒", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"梦柯 - 温柔只给意中人",
	"明洋 - 好心分手 (DJ版)", // 可能重复·C(可能同一首)
	"孟祥龙 - 好心分手 (片段) (Demo)",
	"明洋 - 离开我你会遇见更好的人 (DJ版)",
	"莫叫姐姐 - 当我娶过她", // 可能重复·B(较可能同一首)
	"何深彰 - 当我娶过她",
	"木秦、吉丁Kiddin - 碳酸饮料",
	"慕寒、糖瓷 - 述岚记", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"慕容晓晓 - 黄梅戏",
	"那英 - 三生三世十里桃花", // 同「我创建·电视剧」
	"南辰Music、杨玉环、苏可可 - 如果后来的我们 都已经忘了对方 (片段)",
	"逆时针向 - Asphyxia", // 可能重复·B(较可能同一首)
	"逆时针向 - Asphyxia (窒息)",
	"彭铭 - Asphyxia (窒息)",
	"女王☁ - 铃声多多_清唱《泡沫》为什么难过全都是泡沫只一刹的花火你所有承诺",
	"欧阳菲菲 - 感恩的心", // 可能重复·B(较可能同一首)·同「我创建·儿歌」
	"欧阳耀莹、街道办GDC - 春娇与志明 (DJ版)", // 可能重复·B(较可能同一首)
	"街道办GDC、欧阳耀莹 - 春娇与志明",
	"街道办GDC、欧阳耀莹 - 春娇与志明 (男明星0.8x版)",
	"庞龙 - 两只蝴蝶", // 可能重复·C(可能同一首)
	"袁吉 - 两只蝴蝶 (男声版)",
	"鹏鹏、杨小壮 - 口是心非", // 可能重复·B(较可能同一首)
	"鹏鹏音乐、杨小壮 - 口是心非",
	"鹏泊 - 啷个哩个啷",
	"平生不晚 - 君知否", // 可能重复·B(较可能同一首)
	"国风新语、平生不晚 - 君知否",
	"朴永纯 - 个人简介+百变酒精 (×0.8)",
	"齐会超 - 爱了给了伤了痛了",
	"齐秦 - 大约在冬季", // 可能重复·B(较可能同一首)
	"齐秦 - 外面的世界", // 可能重复·B(较可能同一首)
	"奇然 - 花千殇", // 可能重复·B(较可能同一首)·同「我创建·花千骨」
	"千古(Live)--许嵩", // 可能重复·B(较可能同一首)
	"许嵩 - 千古",
	"阿兰 - 千古",
	"青海龙泽 - 山楂啊梨啊",
	"清水準一 - Bloom of Youth (风华正茂)", // 可能重复·B(较可能同一首)
	"Key Sounds Label - Bloom of Youth (风华正茂)",
	"清漪 - 执念", // 可能重复·B(较可能同一首)·同「我创建·花千骨」
	"情词尧、李哈哈 - 小女子不才", // 同「我创建·改编/鬼畜/片段/DJ」
	"任妙音 - 花千骨", // 可能重复·B(较可能同一首)·同「我创建·花千骨」
	"容中尔甲 - 高原红", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"阮豆 - 马德里不思议",
	"阮豆 - 想要你知道",
	"三亩地 - 城南花已开",
	"莎莎 - Remember Our Summer (小提琴版)", // 可能重复·C(可能同一首)
	"FrogMonster - Remember Our Summer",
	"山岡晃 - True",
	"山鹰组合 - 唐古拉风暴 (DJ版)", // 同「我创建·Yy」
	"邵雨涵 - 拉拉爱", // 可能重复·B(较可能同一首)·同「我创建·Yy、动画片」
	"深七 - 我们不是情侣",
	"沈春阳、小沈阳 - 都要好好的", // 可能重复·B(较可能同一首)
	"小沈阳、沈春阳 - 都要好好的",
	"沈熙 - 凤舞九天", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"沈绪 - 哪里都是你 (0.8x)",
	"十二大美女 - 免失志 (MV版)",
	"时代少年团 - 霍元甲 (Live)", // 可能重复·C(可能同一首)
	"周杰伦 - 霍元甲",
	"矢野立美 - LOVE Theme From TIGA (迪迦的爱情主题曲)",
	"矢野立美 - 遠き呼び声の彼方へ (那来自远方的呼唤)",
	"说者瑞泽 - 再见王者荣耀2", // 同「我创建·改编/鬼畜/片段/DJ」
	"司徒兰芳、赵真 - 闯天涯", // 可能重复·B(较可能同一首)
	"四只烤翅 - 耿 (四合院版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"宋祖英 - 爱我中华", // 可能重复·B(较可能同一首)
	"宋祖英 - 小背篓", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"苏静 - 沉稳总在爱意里翻船", // 同「我创建·改编/鬼畜/片段/DJ」
	"苏芮 - 奉献", // 可能重复·B(较可能同一首)
	"孙楠 - 为江山", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"孙燕姿 - 遇见 (DJ版)", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"孙燕姿 - 遇见", // 同「我创建·默认收藏」
	"孙子涵 - 唐人",
	"谭晶 - 唐韵",
	"汤潮、小沈阳 - 美了美了",
	"唐古 - 孟婆的碗",
	"桃子啊 - 听闻爱情十有九悲 (片段)",
	"藤竹京 - 孤独 (片段)", // 可能重复·C(可能同一首)
	"王佳杨 - 孤独",
	"天龙八部之宿敌--许嵩", // 可能重复·A(高度相似)
	"许嵩 - 天龙八部之宿敌",
	"天才 - 天龙八部之宿敌 (片段)", // 同「我创建·改编/鬼畜/片段/DJ」
	"田馥甄 - 魔鬼中的天使", // 可能重复·B(较可能同一首)
	"庄心妍 - 魔鬼中的天使",
	"田一名 - 给我一首歌的时间", // 可能重复·C(可能同一首)
	"田震 - 好大一棵树",
	"屠洪刚 - 藏龙卧虎",
	"晚安、误 - 落空 (cover：印子月) (Live)",
	"万茜、音频怪物 - 为你成全", // 同「我创建·默认收藏」
	"汪峰 - 我爱你中国", // 可能重复·B(较可能同一首)
	"汪峰 - 像梦一样自由",
	"王贰浪 - 像鱼",
	"王菲 - 传奇", // 可能重复·B(较可能同一首)
	"王键 - 冰吻 (网络版)",
	"王玖 - 我熬夜在凌晨三点", // 同「我创建·默认收藏」
	"王俊凯 - 我在诛仙逍遥涧",
	"王俊凯、王源 - 掌声响起来",
	"王铭基、刘晔 - 孤海", // 可能重复·B(较可能同一首)·同「我创建·王者荣耀音乐合集」
	"王沐轩 - 我爱你不问归期 (烟酒嗓版)",
	"王强 - 秋天不回来", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"王韵壹 - 今生感谢你",
	"韦康 - Breathe",
	"未知歌手 - only look at me (降调0.9x)", // 可能重复·B(较可能同一首)
	"网络歌手 - only look at me (降调0.9x)",
	"未知歌手 - 两只老虎", // 可能重复·B(较可能同一首)
	"未知歌手 - 盛夏的果实 (片段)", // 可能重复·B(较可能同一首)
	"莫文蔚 - 盛夏的果实",
	"小阿枫 - 盛夏的果实",
	"魏小然 - 让我做你的眼睛", // 可能重复·B(较可能同一首)
	"文氓苏 - 2308",
	"乌兰图雅 - 火辣辣的情歌", // 同「我创建·Yy」
	"乌兰图雅 - 套马杆", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"乌兰托娅 - 套马杆", // 同「我创建·Yy」
	"乌兰图雅 - 信天游", // 可能重复·B(较可能同一首)
	"乌兰托娅 - 火红的萨日朗", // 可能重复·B(较可能同一首)
	"乌兰托娅 - 火红的萨日朗 (DJ阿卓、DJ阿龙版)",
	"乌兰托娅 - 梦高原", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"乌兰托娅 - 梦高原 (广场舞)", // 同「我创建·默认收藏」
	"吾尊 - 当你走了", // 可能重复·C(可能同一首)
	"可以喜欢我吗 - 当你走了 (改编版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"吴奇隆 - 祝你一路顺风",
	"武聆音雄 - 六脉神剑", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"夏天Alex - 等我先说 (DJ阿喜版)", // 可能重复·B(较可能同一首)
	"夏天Alex - 等我先说",
	"小曾 - 军中绿花",
	"小峰峰(陈峰) - 足够", // 可能重复·B(较可能同一首)
	"Zealot周星星 - 足够",
	"小虎队 - 爱",
	"小鸟伏特加 - 雷霆嘎巴", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"拼音师 - 小鸟伏特加", // 同「我创建·改编/鬼畜/片段/DJ」
	"伶伶er - 小鸟伏特加", // 同「我创建·改编/鬼畜/片段/DJ」
	"小潘潘(潘柚彤)、小峰峰(陈峰) - 学猫叫",
	"小少焱 - 李太白", // 可能重复·B(较可能同一首)
	"梦柯 - 李太白",
	"小沈阳 - 我只是个传说",
	"小沈阳、邵帅 - 你是人间四月天 (Live)", // 可能重复·B(较可能同一首)
	"小熊弹吉他 - 灰色轨迹 (吉他版片段)", // 可能重复·C(可能同一首)
	"BEYOND - 灰色轨迹",
	"小徐酱 - 自我感动都是病态", // 同「我创建·默认收藏」
	"小杨Remix - 你爱我嘛",
	"新旭 - 洪荒之力 (钢琴版)", // 可能重复·C(可能同一首)
	"青海龙泽 - 洪荒之力",
	"徐秉龙 - 千禧 (Live)",
	"徐海俏 - 空",
	"徐佳莹 - 最初的记忆",
	"徐真真、黑猫警长Giao哥 - 开心真Giao",
	"许华升 - 无法证明 (改编版)",
	"许镜清、叶矛 - 无底船歌", // 可能重复·B(较可能同一首)
	"许茹芸 - 不爱我放了我",
	"续集 - 心墙 (0.8x)",
	"丫蛋蛋(马启涵)、沈虫虫 - 流行歌曲串烧", // 可能重复·B(较可能同一首)
	"烟把儿乐队 - 纸短情长",
	"阎维文 - 打靶归来", // 可能重复·B(较可能同一首)·同「我创建·gg」
	"阎维文 - 一二三四歌", // 可能重复·B(较可能同一首)·同「我创建·gg」
	"央金兰泽 - 爱琴海", // 可能重复·B(较可能同一首)
	"杨臣刚 - 老鼠爱大米", // 可能重复·B(较可能同一首)
	"未知歌手 - 大话西游 (片段)",
	"杨臣刚 - 大话西游",
	"杨臣刚 - 妹儿爱我 杨臣刚",
	"杨坤、郭采洁 - 答案 (Live)", // 可能重复·C(可能同一首)
	"杨坤、郭采洁 - 答案",
	"杨庆煌 - 雪中情", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"杨烁 - 让我们荡起双桨", // 可能重复·B(较可能同一首)·同「我创建·儿歌」
	"杨烁 - 小草", // 可能重复·B(较可能同一首)·同「我创建·儿歌」
	"杨阳、想一想、哎呦喂 - 呼噜歌", // 同「我创建·动画片」
	"杨莹 - booty Music",
	"杨颖、李晨、郑恺、邓超、王祖蓝、陈赫 - 超级英雄 (2015奔跑吧兄弟魅力盛典现场)",
	"杨宗纬、张碧晨 - 凉凉 (Live)", // 同「我创建·花千骨」
	"洋子默 - 下个路口见", // 可能重复·B(较可能同一首)
	"妖蝠 - 来不及说再见",
	"野小马 - 当真", // 可能重复·B(较可能同一首)
	"叶翠 - 我的祖国", // 可能重复·B(较可能同一首)·同「我创建·gg」
	"叶洛洛 - 小了白了兔",
	"叶洛洛、Babystop_山竹 - 特别关注",
	"叶琼琳、董唧唧 - 爱你 (情话多说一点)", // 可能重复·B(较可能同一首)
	"叶琼琳、董唧唧 - 爱你",
	"王贰浪 - 爱你",
	"叶子 - 吻和泪 (午夜深情版)",
	"夜光下的扮演者 - 我的歌声里 (0.8x)",
	"依邦妮 - 大猩猩舞 (DJ版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"易安音乐社 - Side By Side",
	"易烊千玺 - 丹青千里",
	"音乐之声-SongTaste - Micmacs A La Gare",
	"银临、Aki阿杰 - 牵丝戏",
	"尹昔眠 - 落在生命里的光",
	"印子月 - 借过",
	"印子月 - 落空",
	"英雄联盟 - 涅槃 (Phoenix)", // 同「我创建·怀旧单机游戏音乐」
	"樱九 - 画骨成沙", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"樱木BGM - 怦然心动",
	"颖儿 - 他们",
	"永彬Ryan.B - 放个大招给你看",
	"优秀少年好好 - 可爱小宝贝", // 可能重复·B(较可能同一首)
	"好好（张轩睿） - 可爱小宝贝", // 同「我创建·儿歌」
	"悠悠琴韵 - Illusionary Daytime (钢琴版)", // 可能重复·C(可能同一首)
	"块冰 - Illusionary Daytime",
	"尤枫 - 醉流年",
	"游本昌 - 鞋儿破帽儿破", // 同「我创建·电视剧」
	"酉阳美人 - 迷雾散尽一切终于变清晰",
	"鱼多余 - 剑魂 (DJ版)", // 可能重复·B(较可能同一首)
	"汪苏泷 - 剑魂",
	"宇桐非 - 爱上不该爱的人",
	"雨宗林 - 那一刻",
	"郁钧剑 - 沂蒙山好风光",
	"郁可唯 - 夙念", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"郁可唯 - 像小时候一样", // 可能重复·B(较可能同一首)·同「我创建·熊出没」
	"原来是萝卜丫 - 是心动啊",
	"在忠 - 遇到 (DJ梦菲版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"澤野弘之、mizuki - aLIEz", // 可能重复·B(较可能同一首)
	"瑞葵、SawanoHiroyuki[nZk] - aLIEz",
	"扎西顿珠 - 康定情歌", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"张家旺 - 冬天的秘密 (片段)", // 可能重复·B(较可能同一首)
	"周传雄 - 冬天的秘密",
	"张杰 - 逆战",
	"张恺彤、周晋进 - 安眠药",
	"张明明 - 千般", // 可能重复·B(较可能同一首)·同「我创建·花千骨」
	"张茗 - 守护",
	"张韶涵、阿云嘎 - 星辰大海 (中国梦·祖国颂2021国庆特别节目现场)",
	"张伟进 - 猴哥", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"张卫健 - 把酒狂歌",
	"张远喆 - 不配做你男朋友",
	"张芸京 - 偏爱 (DJ林凉、DJ无毒井野版)",
	"赵俊铭 - 鲸落WF End (钢琴版片段)", // 可能重复·B(较可能同一首)
	"赵俊铭 - 鲸落WF End",
	"赵丽颖 - 十年", // 可能重复·B(较可能同一首)
	"陈奕迅 - 十年",
	"郑源 - 不要在我寂寞的时候说爱我",
	"栀hen - may i see u again (我们还能再见吗)", // 可能重复·B(较可能同一首)
	"栀hen - may i see u again",
	"栀hen - May i see u again (Inst.)",
	"中央乐团交响乐队 - 春节序曲", // 可能重复·B(较可能同一首)·同「我创建·gg」
	"中国国家交响乐团 - 春节序曲",
	"周华健 - 朋友",
	"周杰伦 - 不能说的秘密 (Live)",
	"周杰伦 - 稻香", // 可能重复·B(较可能同一首)
	"周杰伦 - 稻香 (3D环绕版)",
	"周资恒、小奶瓶 - 那就晚安 (片段)",
	"庄学忠 - 妹妹你大胆的往前走",
	"庄园 - 都说",
	"坠. - 关键词 (女版片段)",
	"卓依婷 - 好人一生平安",
	"梓冷 - 情不知所起一往而深", // 同「我创建·改编/鬼畜/片段/DJ」
	"紫陌 - 前度",
	"纵贯线 - 爱的初体验 (Live)", // 可能重复·B(较可能同一首)
	"张震岳 - 爱的初体验", // 同「我创建·QQ飞车音乐合集哈」
	"祖海 - 好运来", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"祖海 - 为了谁", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"醉影An、谣君 - 小巷酒馆",
	"泡沫", // 可能重复·A(高度相似)
	"G.E.M.邓紫棋 - 泡沫",
	"杨树人 - 泡沫 (男声版)",
	"草蜢 - 失恋阵线联盟",
	"Against The Current - Legends Never Die",
	"Alan Walker、Coldplay - Hymn For The Weekend (Remix)",
	"李佩琪 - 改革春风吹满地 (片段)",
	"王雨桐 - 画皮 (片段)",
	"未知歌手 - 龙卷风 (0.8版)",
	/* 我喜欢的歌单·酷狗·start 下载成功 498 首（共 2353 首，重复 877 首已跳过） */
	"王蓉 - 小鸡小鸡",
	"顾峰 - 猜",
	"Delacey - Dream It Possible",
	"牙牙乐、格子兮 - 秋殇别恋",
	"汪峰 - 怒放的生命",
	"光头华夏 - 无期",
	"王建荣、司徒兰芳 - 女人没有错",
	"张茜（张惜淇） - 用力活着",
	"程佳佳 - 山楂树の恋", // 可能重复·B(较可能同一首)
	"白小白 - 我爱你不问归期",
	"魏佳艺 - 忘川的河",
	"吴亦凡、王者荣耀 - 侠客行",
	"刘大壮 - 一吻天荒 (吉他版)", // 可能重复·C(可能同一首)
	"胡歌 - 一吻天荒",
	"胡歌 - 一吻天荒 (Live)",
	"Tobu、Itro - Sunburst", // 同「我创建·。」
	"佐橋俊彦 - ツナ覚醒 (阿纲觉醒)", // 同「我创建·two」
	"久升音艺 Silver Screen - Simplicity",
	"Axero - Trip (Original Mix)",
	"桑子 - 夜、萤火虫和你", // 可能重复·B(较可能同一首)
	"Diana Boncheva - Purple Passion (紫色激情)",
	"阳山伟伟 - The end point",
	"BH、Kirk Cosier、Cheney - Slipping Away (Original Mix)",
	"Little Mix、Charlie Puth - Oops",
	"双笙 (陈元汐) - 心做し (心理作用)",
	"宋冬野 - 安和桥", // 可能重复·B(较可能同一首)
	"陈慧琳 - 希望",
	"DJ热歌2021 - 怕错过",
	"面包 - 木漏れ日 (叶隙间洒落的阳光)",
	"Swagger - Señorita (片段)", // 可能重复·C(可能同一首)
	"Feint - Stray (游荡)",
	"Barcode Brothers - Flute (Radio Edit)",
	"Interupt、Luna LePage - Power (In Your Soul)",
	"者思范 - 五月雨",
	"Tez Cadey - Seve (Radio Edit)",
	"Tungevaag & Raaban、Emila - Samsara",
	"Ember Island、Matte - Umbrella (Matte Remix)",
	"虚哥、圈妹 - 水花 (DJ版)",
	"艺宝音乐、子芮吖、浩浩 - Twisted (DJ版)", // 可能重复·B(较可能同一首)
	"еяхат музыка - Twisted",
	"Nanne - Håll om mig (抱紧我)",
	"司令 - Shots (DJ版)",
	"猴七七 - Om Mig (DJ版)",
	"Feint、Laura Brehm - Solace",
	"英雄联盟、Against The Current - Legends Never Die (传奇永不熄)",
	"张杰、张碧晨 - 只要平凡", // 可能重复·B(较可能同一首)
	"Calvin Harris、Ellie Goulding - Outside", // 可能重复·C(可能同一首)
	"Alan Walker、K-391、Tungevaag、Mangoo - Play",
	"高林生 - 牵挂你的人是我",
	"温奕心 - 一路生花", // 可能重复·B(较可能同一首)
	"王七七 - 我愿意平凡的陪在你身旁",
	"张可儿 - 时间煮雨",
	"彭十六 - 戏影",
	"小乐哥（王唯乐） - 执迷不悟", // 可能重复·C(可能同一首)
	"Two Steps From Hell - Star Sky (Instrumental)",
	"Two Steps From Hell、Thomas Bergersen - Victory", // 可能重复·B(较可能同一首)
	"Uu (刘梦妤) - 气象站台",
	"Craig David - Insomnia (Up All Night Mix)", // 可能重复·B(较可能同一首)
	"Otomania、初音ミク - Ievan Polkka (Replica ver.)", // 可能重复·B(较可能同一首)
	"初音ミク、Otomania - Ievan Polkka (Replica ver.)",
	"Blazo - Righteous Path",
	"Jonathan Buchanan - Red Dawn",
	"华语群星 - 夏唤 (钢琴版)",
	"Neray Network - We Are Not Alone",
	"Snigellin - Sakura Tears (樱花泪)",
	"Otokaze - 夏恋", // 同「我创建·默认收藏」
	"十三叔 - X8飞曲 (麻木版)", // 同「我创建·two」
	"Cindy兔子 - 入戏太深 (女生版)",
	"邓寓君(等什么君) - 春庭雪", // 可能重复·B(较可能同一首)
	"等什么君(邓寓君) - 春庭雪",
	"隔壁老樊_樊凯杰 - 多想在平庸的生活拥抱你 (Live)", // 可能重复·B(较可能同一首)
	"隔壁老樊 - 多想在平庸的生活拥抱你 (Live)",
	"宝石Gem、陈伟霆 - 野狼Disco (feat.陈伟霆)", // 同「我创建·two」
	"伊格赛听、叶里 - 谪仙",
	"杨钰莹、毛宁 - 心雨",
	"奇然、沈谧仁 - 琵琶行",
	"PSY - 강남스타일 (Gangnam Style)", // 同「我创建·two」
	"顾依辰 - Promise. (片段)", // 可能重复·C(可能同一首)
	"腾格尔 - 天堂",
	"云朵 - 我的楼兰",
	"en (王翊恩) - 曲终人亦散",
	"Olly Murs - That Girl",
	"宋孟君、威仔 - 9277",
	"River - Solo", // 可能重复·C(可能同一首)
	"Candy_Wind - 青空",
	"Fun.、Janelle Monáe - We Are Young (feat. Janelle Monáe)",
	"全弟 - You Spin Me Round (说唱原版)", // 同「我创建·two」
	"何文宇 - 我不再打扰你了",
	"Vicetone - Tremble",
	"Disco Fries、Raquel Castro - U Make Me (Natan Chaim & Asketa Remix)",
	"Hawk Nelson、Jonathan Steingard - Sold Out",
	"Lindsey Stirling - Senbonzakura (千本樱)(纯音乐)",
	"The Tokens - The Lion Sleeps Tonight (Wimoweh)(Remastered)", // 同「我创建·two」
	"周杰伦 - 以父之名",
	"酥糖Yuki - 晚安，私のかみさま (晚安,我的神明大人)",
	"川青、Morerare - 下潜",
	"CORSAK胡梦周、马吟吟 - 溯 (Reverse)(feat. 马吟吟)",
	"JVKE、Charlie Puth - Upside Down",
	"傅许 - 夏日之梦",
	"张宇桦 - 优美的小调",
	"莫文蔚 - 这世界那么多人",
	"新乐尘符 - 123我爱你",
	"Vitas - Опера 2 (歌剧2)",
	"Angelika Vee - You Are My Sunshine",
	"S.E.N.S. - Palace Memories (故宫的记忆)",
	"Tyomcha、Tanir - Да да да (嗯 嗯 嗯)(Jarico Remix)", // 同「我创建·two」
	"Bad Style - Time Back (时光倒流)(钢琴版)", // 可能重复·C(可能同一首)
	"Bad Style - Time Back (时光倒流)",
	"OAO - Summer is Coming",
	"蔡萝莉 - 为你心动 (DJ弹鼓版)",
	"笑白Ermy、White Wolf Tracks - 消逝的光芒 Dying Light",
	"Dj Tik Tok Mix - Simpa Papa Palyu",
	"Daniele Leoni、Edoardo Brugnoli - Summer (Piano Version)",
	"张茗 - 快乐生活",
	"生子 - 人心太复杂",
	"奥黛丽·赫本 - Moon River",
	"树泽 - 后来的你在哪",
	"昼夜 - 千与千寻 (钢琴版)",
	"吉田潔 - TVエンディングテーマ (遥远的旅途)",
	"半吨兄弟 - 对你说", // 可能重复·B(较可能同一首)
	"RAiNBOW计划、雷雨心 - 记念",
	"Dr. Dre、Snoop Dogg、Kurupt、Nate Dogg - The Next Episode",
	"DeeJay Ghost - Betty Swing",
	"Rihanna - Umbrella (Grakk & Tiger Jz Remix)", // 同「我创建·two」
	"坤哲 - Love You Three",
	"小拾柒 - EA7 经典依旧",
	"MOGUAI、Cheat Codes - Hold On (Radio Edit)",
	"69 - 大自然的声音 (纯音乐)",
	"闫东炜 - 夏野与暗恋",
	"Kina、Adriana Proenza - Can We Kiss Forever (MC赵小磊变速版)", // 可能重复·B(较可能同一首)
	"Kina、Adriana Proenza - Can We Kiss Forever",
	"Capo Productions - Journey", // 同「我创建·。」
	"ZER0 - Stay With Me (留在我身边)",
	"何鹏、大哲 - 闯码头 (DJ何鹏版)", // 可能重复·B(较可能同一首)
	"孙耀威 - 爱的故事(上集)", // 可能重复·B(较可能同一首)
	"DJ梦菲、梦涵 - 爱的故事上集 (DJ版)",
	"梦涵 - 爱的故事上集 (DJ版)",
	"Ben Morfitt (SquidPhysics) - GTA San Andreas Theme (Remake)",
	"李玉刚 - 新贵妃醉酒 (2013CCTV-15音乐频道精彩音乐汇现场)", // 可能重复·B(较可能同一首)
	"郁可唯 - 时间煮雨 (2016CCTV-15音乐频道精彩音乐汇现场)",
	"SynBlazer - 10%",
	"陈雪燃 - 无名之辈",
	"Dennis Kuo - Track in Time", // 可能重复·C(可能同一首)
	"Toby Fox - sans",
	"苏泽、北筱 - 温柔只给你",
	"周慧敏、刘青云 - 红河谷",
	"文科 - 卡门序曲",
	"王泓翔、犀 - 墨梅",
	"李先森 - Move the west mouth",
	"王以太 - 目不转睛",
	"林烁 - 夜色 (纯音乐版)",
	"林寒恩 - 80000",
	"冯提莫 - What Are Words (纯音版)(DJ王俊骅版)",
	"Eminem、Rihanna - The Monster (DJ版)",
	"王沐轩 - 粤语最嗨欢喜就好 (DJ版)",
	"BugMan、CEM - 蛮",
	"Russ - Psycho, Pt. 2 (Live)",
	"承利 - Regrete (变速版)",
	"于文华、尹相杰 - 天不下雨天不刮风天上有太阳", // 同「我创建·默认收藏」
	"毛不易 - 看得最远的地方",
	"黄诗扶 - 九万字 (念白版)",
	"明洋 - 太阳后裔",
	"弦小皑 - 两个人的剧场",
	"Thomas Gold、Kosling、Matthew Steeper - Wildest Dream",
	"t.A.T.u. - Loves Me Not", // 同「我创建·QQ飞车音乐合集哈」
	"ILLENIUM、Nevve - Fractures",
	"Jiaye - Seven (Jiaye Reboot)",
	"Ahxello - Frisbee (飞盘)", // 同「我创建·默认收藏」
	"Jonas Blue、RAYE - By Your Side", // 同「我创建·默认收藏」
	"Brooks、GRX - Boomerang (回旋镖)", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"HINA - Boomerang (回旋镖)",
	"Dirty Palm、Conor Ross、Andy Jarvis、Chandler Blasé、Chandler Blasé - Flowers (Andy Jarvis Remix)", // 同「我创建·默认收藏」
	"Besomorph、Anthony Keyrouz、Lunis - Apologize",
	"Hillsong Young & Free - Wake (2013 We Are Young & Free现场)", // 同「我创建·和平精英音乐合集」
	"吴蕙如 - MOM (吉他女版)",
	"白小白 - 我们终究是错过", // 可能重复·C(可能同一首)
	"刘大壮 - 我们终究是错过 (片段)",
	"诗人凉 - 江海不渡你",
	"cici_ - 把回忆拼好给你", // 可能重复·B(较可能同一首)
	"SLJ - 把回忆拼好给你",
	"DJ Timeline - I Just Want To (Chuck Lepley Remix)",
	"程今 - 爱是无畏的冒险", // 可能重复·B(较可能同一首)
	"是爱酱吖 - 爱是无畏的冒险",
	"王小旭 - 膨胀 (2019中国达人秀第六季现场)",
	"nevva - ❀",
	"やまだ豊 - やわらかな光 (柔和之光)",
	"Various Artists - Funk Shui (Main Track｜Full Length)", // 可能重复·A(高度相似)·同「我创建·熊出没」
	"Various Artists - 玛丽医生 (乡村民谣版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"Various Artists - Dum Dee Dum (Main Track｜Full Length)", // 同「我创建·熊出没」
	"Various Artists - Empty Hands (Main Track｜Full Length)", // 同「我创建·熊出没」
	"Various Artists - Gotta Go (Main Track｜Full Length)", // 同「我创建·熊出没」
	"Various Artists - Frantic Fire Brigade (Main Track｜Full Length)", // 同「我创建·熊出没」
	"Various Artists - A Sly One (Main Track) (Full Length)", // 同「我创建·熊出没」
	"Various Artists - Collapsing World (崩溃的世界)(Remix)",
	"Various Artists - 斗牛5",
	"Various Artists",
	"Various Artists - Rindu Semalam (DJ沈梦逸版)",
	"DEAF KEV - Samurai", // 同「我创建·默认收藏」
	"Various Artists - FREE Lucky (Inst.)",
	"Various Artists - 불꽃 (火花)(DJ版)",
	"Various Artists - Slapstick (Main Track｜Full Length)", // 同「我创建·熊出没」
	"Various Artists - Tricks And Traps (Alternative Version)(Full Length)", // 同「我创建·熊出没」
	"Various Artists - Tokyo (Remix)",
	"DJ Kantik - Tokyo (Remix)",
	"采风乐坊 - 蓄勢 ～ GEAR UP ～ (蓄势~准备就绪~)",
	"威可 - 滑稽的夜晚 (Remix)",
	"阎维文 - 在那遥远的地方", // 可能重复·B(较可能同一首)
	"阿肆 - 热爱105℃的你",
	"李谷一 - 我和我的祖国", // 可能重复·B(较可能同一首)
	"郑浩 - 须尽欢", // 可能重复·B(较可能同一首)
	"渡 - 须尽欢",
	"韩嘉琪 - 世界美好与你环环相扣",
	"可陌 - Autumn 秋", // 可能重复·B(较可能同一首)
	"唐小力 - Autumn (秋)",
	"纯音乐 - Breath And Life",
	"贺一航 - 原来占据你内心的人不是我",
	"纯音乐 - 渔舟唱晚", // 可能重复·B(较可能同一首)·同「我创建·gg」
	"未知歌手 - 渔舟唱晚",
	"金志文 - 左眼皮跳跳", // 可能重复·B(较可能同一首)
	"馒头 - 123喝热水 (王者荣耀版)",
	"Urban Sound Collective - This Girl",
	"樊慕慕 - Want U More (DJ版)",
	"Laura Shigihara - Brainiac Maniac", // 同「我创建·怀旧单机游戏音乐」
	"Ultimate Party Jams (最强派对混音)、Ultimate Party Jams - Good Time", // 可能重复·B(较可能同一首)
	"Owl City、Carly Rae Jepsen - Good Time", // 同「我创建·。」
	"南宫嘉骏、姜玉阳 - 回忆总想哭", // 可能重复·B(较可能同一首)
	"姜玉阳 - 回忆总想哭",
	"DJ Tokeo - Hey Mama", // 可能重复·B(较可能同一首)
	"David Guetta、Nicki Minaj、Bebe Rexha、Afrojack - Hey Mama",
	"席 Music - Hey Mama",
	"David Guetta、Afrojack、Bebe Rexha、Nicki Minaj - Hey Mama",
	"ALisa - 青空 (治愈版)",
	"ALisa - 溯Reverse (治愈版)",
	"胡歌 - 忘记时间",
	"DJ小鱼儿 - 她会魔法吧",
	"Vicetone、Cozi Zuehlsdorff - Way Back",
	"林翠萍 - 相会在梦里 (爱拼才会赢)",
	"纯音乐 - あなたの後ろで (在你身后)",
	"Lucian、Alessia Cara - Here (Remix)",
	"ALisa - The Way I Still Love You (治愈版)",
	"ElYotto - SugarCrash! (Explicit)",
	"Tài Muzik、Bích Phương、UTHIEU - Từ Chối Nhẹ Nhàng Thôi (DJ版)",
	"彭家丽 - 昨天．今天．下雨天",
	"胡彦斌 - One Night In Shanghai",
	"锤娜丽莎 - 我太笨", // 可能重复·B(较可能同一首)
	"MMZ-BOY - Yasuo(亚索纯音乐版)面对疾风吧！ (亚索)", // 可能重复·C(可能同一首)
	"Johnyrighthere - Wake up (Original Mix)",
	"Jiaye - Astronomia", // 可能重复·B(较可能同一首)
	"MaxRiven - Astronomia (天文学)",
	"Vicetone、Tony Igy - Astronomia (天文学)",
	"MaxRiven - Astronomia",
	"IN-K、安苏羽、傅梦彤 - 潮汐(Natural)", // 可能重复·B(较可能同一首)
	"宋祖英 - 孟姜女", // 可能重复·B(较可能同一首)
	"未知歌手 - 孟姜女",
	"Rival、Cadmium、Harley Bird - Seasons (remix：Futuristik、Whogaux)",
	"暖豪 - Something Just Like This (Live)", // 可能重复·B(较可能同一首)
	"The Chainsmokers、Coldplay - Something Just Like This (DJ沐泽版)",
	"The Chainsmokers、Coldplay - Something Just Like This (网友改编)",
	"The Chainsmokers、Coldplay - Something Just Like This",
	"Anthony Keyrouz、Romy Wave - Something Just Like This",
	"Deepmaniak - Something Just Like This (remix)",
	"腾血冥 - Something Just Like This (DJ版)",
	"Vicetone、Cozi Zuehlsdorff、LFZ - Way Back (LFZ Remix)",
	"Mia Love、James Major - Wolves", // 可能重复·B(较可能同一首)
	"贝海石 - ให้เคอรีมาส่งได้บ่ (让KERRY来送东西可以吗)",
	"纯音乐 - Strength Of A Thousand Men", // 可能重复·B(较可能同一首)
	"Two Steps From Hell - Strength of a Thousand Men",
	"Epic Score - Strike Package Ready", // 可能重复·B(较可能同一首)
	"Epic Score - Strike Package Ready (No Vocals)",
	"沐羽曦 - 买了否冷",
	"崔子格、老猫 - 老婆最大",
	"周艳泓 - 要嫁就嫁灰太狼",
	"兮龙 - 抒情(take me hand)动感车载",
	"和田薫 - 時代を越える想いⅡ (穿越时空的思念)",
	"Lost Sky - Fearless", // 可能重复·B(较可能同一首)
	"Gargantuan Music - Fearless (无所畏惧)",
	"Gargantuan Music - Fearless",
	"叶嘉 - 你笑起来真好看", // 可能重复·B(较可能同一首)
	"李昕融、樊桐舟、李凯稠 - 你笑起来真好看",
	"Ed Sheeran - Shape of You", // 可能重复·B(较可能同一首)·同「我创建·QQ飞车音乐合集哈」
	"玄冥二老 - Shape Of You (DJ版)",
	"耀仔 - Shape Of You",
	"烟(许佳豪) - 想你这件事", // 可能重复·C(可能同一首)
	"Jurrivh - Lonely Day",
	"Ludovico Einaudi - Una Mattina", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"Jacob's Piano - Una Mattina",
	"时光胶囊 - 青丝", // 可能重复·C(可能同一首)
	"小伊伊 - 黑人抬棺 (唢呐版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"迪总 - 今夜星光闪闪", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"王搏 - 尿床记", // 可能重复·B(较可能同一首)·同「我创建·儿歌」
	"小阿诺 - 上天安排的最大 (Remix)", // 同「我创建·改编/鬼畜/片段/DJ」
	"未知歌手 - 耍猴儿 (片段)", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"网络歌手 - 耍猴儿 (片段)",
	"张一诺 - 天空之城 (吉他版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"8先生 - 万有引力 (吃鸡版)", // 可能重复·B(较可能同一首)
	"汪苏泷 - 万有引力",
	"Y2002 - 仙剑奇缘 (琵琶版)", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"MC彪先生 - 一人我考驾照", // 同「我创建·改编/鬼畜/片段/DJ」
	"诗黎安 - 终是庄周梦了蝶", // 同「我创建·改编/鬼畜/片段/DJ」
	"北鹤 - 追想童年",
	"Pianoboy高至豪 - The Truth That You Leave (你离开的事实)", // 可能重复·C(可能同一首)
	"千屿 - 《屿声钢琴曲》卡农钢琴-Hi-Res臻享 (纯钢琴无损经典版)",
	"ZAYN、Sia - Dusk Till Dawn",
	"Feint、Laura Brehm - Words",
	"Vicetone、Kat Nestel - Nothing Stopping Me (Radio Edit)",
	"Patrick Moreno、Revealed Recordings、Sage - Show You Again",
	"英雄联盟 - Start It Up 群星启航",
	"闷涛 - Ride With Me (混音)",
	"Elephante、Matluck - Come Back For You",
	"Michael Schulte - Back to the Start",
	"Deep Chills、IVIE - Run Free (Original Mix)",
	"Alex Skrindo、Verdial - Emotions", // 同「我创建·。」
	"Cody Sorenson、Altimo - Oblivion (with Altimo)",
	"Far Out - Alibi (remix：Far Out)", // 可能重复·B(较可能同一首)
	"Far Out - Apex",
	"BH-坏叔叔. - Raising",
	"Crystal Yang - Passion Guys",
	"Desmond - Night Elves",
	"Crystal Yang - Swing your nerves",
	"Crystal Yang - Crazy Stone",
	"阿炳 - 二泉映月", // 可能重复·C(可能同一首)
	"阿炳 - 二泉映月 (二胡版)",
	"热夏 - Kiss Me Baby",
	"官云康 - 所以到哪里都像快乐被燃起", // 同「我创建·改编/鬼畜/片段/DJ」
	"DJ OKAWARI - Flower Dance", // 可能重复·B(较可能同一首)
	"未知歌手 - Flower Dance (花之舞)(钢琴版)",
	"纯音乐 - Flower Dance (花之舞)(钢琴版)",
	"尹飞 - 我在东北眺望北京 (DJ版)",
	"段兴华 - 我害怕鬼", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"许巍 - 故乡 (Live)", // 可能重复·C(可能同一首)
	"久石让 - Mother", // 同「我创建·默认收藏」
	"Idina Menzel - Let It Go (Soundtrack Version)",
	"Harry Lightfoot - Rebirth", // 可能重复·B(较可能同一首)
	"隔壁老樊_樊凯杰 - 四块五的妞 (DJ版)", // 可能重复·B(较可能同一首)
	"告五人 - 带我去找夜生活 (对爱的执念从不是海0.8x版)", // 可能重复·B(较可能同一首)
	"刀郎、云朵 - 十送红军", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"承利 - 我告诉你什么事最可悲 (Remix)",
	"Akon - Right Now (Na Na Na) (承利0.8x版)", // 可能重复·B(较可能同一首)
	"Aamir - Right Now (Na Na Na)",
	"ablikimwow - DeSpair", // 可能重复·B(较可能同一首)
	"坂本龍一 - Merry Christmas Mr.Lawrence (劳伦斯先生圣诞快乐)",
	"北诗 - Plain Jane",
	"Austin Mahone、Rich Homie Quan - Send It (feat. Rich Homie Quan)",
	"馒头 - 期末之歌 (Single Version)", // 同「我创建·改编/鬼畜/片段/DJ」
	"Hoaprox - Ngẫu Hứng (DJ虎太郎版)", // 可能重复·B(较可能同一首)
	"LeeAlive - Water (Original Mix)",
	"李俊佑、小潘潘（潘柚彤） - 宠坏 (可不可以你把我宠坏)",
	"Krutikov Music - Enemy (Arcane League of Legends) (Epic Version)",
	"康硕Kenny - 喜剧之王 Silent Open (电影喜剧之王原声)", // 同「我创建·电视剧」
	"侃侃 - 滴嗒",
	"Justin Bieber、Big Sean - As Long As You Love Me", // 同「我创建·。」
	"金典音乐 - 痴情冢", // 可能重复·B(较可能同一首)
	"TFBOYS - 样 (YOUNG)",
	"藤柒吖 - 冬眠", // 可能重复·C(可能同一首)
	"等什么君(邓寓君) - 冬眠 (片段)",
	"彤大王 - 下辈子还要和你成个家",
	"Shire Music - Dark Obsessions (Main Track｜Full Length)",
	"Justin Dai、MARVIN - SLANDER-Love is gone (Justin Dai ／ Marvin remix)",
	"邵帅 - 暖一杯茶", // 可能重复·B(较可能同一首)
	"矢野立美 - LOVE Theme from TIGA (M-2)",
	"孙露 - 光辉岁月", // 可能重复·B(较可能同一首)
	"BEYOND - 光辉岁月",
	"Roger Subirana - Between Worlds (世界之间)",
	"Rezz、Isabelle Rezazadeh - Edge",
	"曲婉婷 - 我的歌声里",
	"OCTOBER - Time To Love (相爱时间)",
	"欧阳朵、小小浩 - 落单恋人", // 可能重复·B(较可能同一首)
	"PØRPEL、Marcus & Martinus - Heartbeat (Nightcore) (PØRPEL Remix)",
	"新街口组合、Mona Lavi - 暗恋过 结局呢",
	"王贰浪 - 虚拟", // 可能重复·B(较可能同一首)
	"孟祥龙 - 虚拟 (片段)",
	"王菲 - 如愿", // 可能重复·C(可能同一首)
	"王绎龙 - 午夜DJ",
	"武言圣 - 失散的城市",
	"Valence - Infinite", // 可能重复·B(较可能同一首)
	"Valence - Infinite (无限)",
	"Tobu - Life", // 可能重复·B(较可能同一首)
	"Tobu - Life (生活)",
	"XING KONG、Timmy Trumpet、SAVAGE - Freaks (XING KONG When Mom Isn't Home Edit｜Bass Boosted)",
	"ＴＲＡ＄Ｈ - Memories", // 可能重复·B(较可能同一首)
	"转鹿 - Crazy Dave IN-GAME", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"转鹿 - Crazy Dave IN-GAME.wav",
	"烟(许佳豪) - 偏爱和例外",
	"杨亚茹Triste - 当爱在靠近 (Single Version)",
	"王雨桐 - 画皮 (23秒片段)",
	"武聆音雄 - 天龙八部间奏曲 (23秒片段)", // 同「我创建·电视剧」
	"网络歌手 - 我们喵星人就是这么拽 (16秒片段)",
	"网络歌手 - 生僻字 (15秒学生考试版片段)", // 同「我创建·改编/鬼畜/片段/DJ」
	"Toby Fox - Shop",
	"刀小刀 - Da Da Da (酒吧专用)(DJ刀小刀版)", // 可能重复·B(较可能同一首)
	"刀小刀 - Da Da Da (酒吧专用)",
	"十二月 - 白鸽", // 可能重复·B(较可能同一首)
	"般若 - 白鸽",
	"你的上好佳 - 白鸽",
	"馒头 - 123喝热水 (59秒Live片段)", // 同「我创建·改编/鬼畜/片段/DJ」
	"罗高丞 - 森林时光 (TV Verison)", // 同「我创建·熊出没」
	"就是南方凯 - 万拒 (31秒Live片段)",
	"Ameritz Indian Karaoke - Jhak Maar Ke (Karaoke Version)",
	"小猫多鱼 - May i See U Again (铛铛版)",
	"Richard Clayderman - A Comme Amour (秋日私语)",
	"祁隆、乐凡 - 等你等了那么久 (对唱版)", // 可能重复·C(可能同一首)
	"祁隆、乐凡 - 等你等了那么久",
	"Nana - Lonely (Extended Mix)",
	"赵今麦、郭俊辰、姜冠南、韩沛颖、ANU - 飞", // 同「我创建·two、改编/鬼畜/片段/DJ」
	"王亚鹏 - 身法大佬专用BGM", // 同「我创建·改编/鬼畜/片段/DJ」
	"沙雕少年可乐君、言和 - 沙雕之歌", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"纯音乐 - 沙雕之歌", // 同「我创建·改编/鬼畜/片段/DJ」
	"DJ Titon - 死机之歌", // 同「我创建·改编/鬼畜/片段/DJ」
	"ShalomTeck - Circus (Explicit)", // 同「我创建·改编/鬼畜/片段/DJ」
	"Gigi D'Agostino - The Riddle (混音)", // 同「我创建·改编/鬼畜/片段/DJ」
	"五条人 - 阿珍爱上了阿强", // 同「我创建·改编/鬼畜/片段/DJ」
	"Kevin MacLeod - Breaktime", // 同「我创建·改编/鬼畜/片段/DJ」
	"华语群星 - 我们是共产党主义接班人", // 同「我创建·儿歌」
	"Pyotr Ilyich Tchaikovsky - 四只小天鹅", // 同「我创建·熊出没」
	"网络歌手 - 亡灵序曲 (纯音乐)", // 可能重复·B(较可能同一首)
	"未知歌手 - 亡灵序曲 (纯音乐)",
	"未知歌手 - 亡灵序曲",
	"Kevin MacLeod - Monkeys Spinning Monkeys",
	"李宇春 - 和你一样", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"任素汐 - 胡广生", // 可能重复·B(较可能同一首)
	"Dec19 - 树里都是雾",
	"痛仰乐队 - 再见杰克",
	"陈墨一（吖毛） - 回不去的何止时间 (网友改编)", // 可能重复·B(较可能同一首)
	"Cannie - 遥远的歌",
	"吴泓君 - 娜奴娃情歌+高山青+拜访春天",
	"~老怪~ - 芙蓉姐夫",
	"史岩 - 神话 (陶笛纯音乐版)",
	"M.R.Y麦尔彦 - 水手点灯 (DJ版)",
	"王力宏、章子怡 - 爱一点",
	"王冕 - 勉为其难", // 可能重复·B(较可能同一首)
	"旺仔加真露 - 若把你", // 可能重复·B(较可能同一首)
	"Kirsty刘瑾睿 - 若把你 (Live)",
	"林俊杰 - 不潮不用花钱 (男明星0.8x版)", // 可能重复·B(较可能同一首)
	"纯音乐 - 繁星万千不及你 (29秒片段)",
	"腾金涛 - 卢本伟", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"卡门 - 杀死那个石家庄人", // 可能重复·B(较可能同一首)
	"爱吃巧乐兹 - 山海 (28秒合唱版片段)",
	"杨钰莹 - 轻轻的告诉你",
	"Felicia蔡菲凡 - 错位时空 (柔情版)",
	"吴忧吴虑 - Call of Silence (钢琴版)", // 可能重复·B(较可能同一首)
	"Yi Chou - Call of Silence (钢琴版)",
	"柯柯柯啊 - 姑娘别哭泣 (弹唱版)", // 可能重复·C(可能同一首)
	"张妙格 - 我期待的不是雪 (而是有你的冬天)",
	"中国国家交响乐团 - 黄河大合唱",
	"모모랜드 (MOMOLAND)、CHROMANCE - Wrap Me In Plastic", // 可能重复·B(较可能同一首)
	"Moon Cake - Billie Jean (Remix)", // 可能重复·C(可能同一首)
	"Michael Jackson - Billie Jean",
	"Vexento - Anesthesia (沉沦)",
	"马頔 - 南山南",
	"Lulleaux、Kid Princess - Empty Love", // 同「我创建·。」
	"dylanf - He's a Pirate (加勒比海盗)", // 可能重复·B(较可能同一首)
	"精彩威Sir - 如此生活三十年",
	"彝族歌手 - 指路经", // 可能重复·B(较可能同一首)
	"王洛宾、李毓敏 - 青春舞曲", // 可能重复·B(较可能同一首)
	"孙盛希 - 少一点天份", // 可能重复·B(较可能同一首)
	"龙梅子、老猫 - 走天涯", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"降央卓玛 - 走天涯 (DJHouse版)",
	"Zerky、Liu - Temple",
	"DAZI - 恭喜恭喜 (PHONK)",
	"EDM大魔王 - 老北京の小曲 (全损版)",
	"傲七爷(江偌绮) - 回到夏天",
	"Maggie_麦吉、盖盖Nyan - summertime (Arrange ver.)",
	"海边有风浪 - 查尔斯顿舞挑战曲", // 同「我创建·two」
	"Music4U - Hehaha Hehoho", // 同「我创建·two」
	"那英 - 默", // 可能重复·B(较可能同一首)
	"大叔很下饭 - 大田后生仔DJ",
	"孟庭苇 - 羞答答的玫瑰静悄悄地开", // 可能重复·B(较可能同一首)
	"陈之 - 羞答答的玫瑰静悄悄地开",
	"DJ Tons - Always Remember Us This Way",
	"AViVA - GRRRLS",
	/* 酷狗音乐歌单结束 */
]

// 获取一下当前网址，好从当前网址获取lrc文件    应用于getLrc()和songs[]的音乐列表
let urlIng = window.location.host;
let localhostTion = false;
// console.log(urlIng);
if (urlIng == 'buyaozaikongfushichizaocan.github.io') {
	urlIng = 'https://buyaozaikongfushichizaocan.github.io/qAiJi';
} else if (urlIng == 'qaiji.gitee.io') {
	urlIng = 'https://qaiji.gitee.io/';
} else if (urlIng.match('127.0.0.1') || urlIng.match('192.168.0.1') || urlIng.match('localhost')) {
	urlIng = window.location.origin;
	localhostTion = true;
} else if (window.location.href.startsWith("http")) {// 判断字符串开头
	// urlIng = urlIng.replace("http", "https");
	urlIng = window.location.origin;
} else {
	console.log('当前url非http,https网址，可能为为file:// 。 歌词加载受限。');
}

songs.push(
	"G.E.M.邓紫棋 - 倒数", // 可能重复·B(较可能同一首)
	"爱弹琴的涵妹 - 倒数 (Live片段)",
	"小婳 - 倒数",
	"G.E.M.邓紫棋 - 光年之外",
	"G.E.M.邓紫棋 - 画 (Live Piano Session Ⅱ)", // 同「我创建·two」
	"G.E.M.邓紫棋 - 句号", // 可能重复·B(较可能同一首)
	"G.E.M.邓紫棋 - 我的秘密",
	"多远都要在一起-G.E.M.邓紫棋", // 可能重复·A(高度相似)
	"G.E.M.邓紫棋 - 多远都要在一起",
	"烟嗓 - 把我删了吧",
	"24KGoldn、iann dior - Mood (Clean)",
	"Alan Walker - Alone", // 可能重复·B(较可能同一首)
	"ＴＲＡ＄Ｈ - Alone",
	"Alan Walker、Au／Ra、Tomine Harket - Darkside",
	"Alan Walker、Noah Cyrus、Digital Farm Animals、Juliander - All Falls Down", // 可能重复·B(较可能同一首)·同「我创建·two」
	"Alec Benjamin - Let Me Down Slowly", // 可能重复·B(较可能同一首)·同「我创建·和平精英音乐合集」
	"A-Lin - 天若有情", // 可能重复·B(较可能同一首)
	"A-Lin - 幸福了 然后呢",
	"云狗蛋 - 天若有情",
	"ALisa - 风吹过的那个夏天 (治愈版)",
	"ALisa - 鲸落",
	"ALisa - 木鲸 (治愈版)",
	"ALisa、五月的钢琴 - 海 で待っています(我在海边等你) (我在海边等你)(治愈版)",
	"AnDyWuMUSICLAND - Something Just Like This (Megamix)", // 同「我创建·默认收藏」
	"Anna Leyne、Spada - Catchfire (Sun Sun Sun) (DJ沈木版)",
	"Aove - 群星-2018 Serato Recording 2（Aove Remix）", // 可能重复·A(高度相似)
	"Asher Monroe - Here With You",
	"Ashes Remain - On My Own",
	"ATF - Reborn",
	"Ava Max - My Head & My Heart",
	"Axero - Unity (Extended Mix)",
	"Barcode Brothers - Flute (长笛)(Radio Edit)",
	"Bear McCreary - Anacreon",
	"BeatBrothers - Fight",
	"BEAUZ、Jessie Villa - Little Do You Know",
	"BOSS HAN - Miracle BattleTec (DJ版)",
	"Brand X Music - Helmet to Helmet (头盔挨着头盔)", // 可能重复·B(较可能同一首)
	"Brand X Music - Helmet to Helmet", // 同「我创建·默认收藏、和平精英音乐合集」
	"Calvin Harris、John Newman - Blame",
	"Chiu Chiu、KT杨君涛 - 7538 (Me U-Remix)",
	"Chris Rock、Danny Jacobs - Afro Circus ／ I Like To Move It", // 同「我创建·two」
	"Christophe Lebled - Alpha",
	"CHYL - Boom Boom",
	"CO1 - 末班车 (0.8x)",
	"CO1 - 我看过 (0.8x)",
	"CO1 - 一样的月光 (0.8x版)", // 可能重复·C(可能同一首)·同「我创建·默认收藏」
	"对爱的执念从不是海 - 一样的月光 (0.8x)",
	"Croatia Squad - Drop That Skirt (Radio Mix)",
	"Dan Farber - Don't Touch (不要触摸)(DJ Mix)",
	"Dave Rodgers - DEJA VU (Extended Version)",
	"Dave Rodgers - Déjà Vu", // 可能重复·B(较可能同一首)
	"Dirty Palm、Conor Ross、Chandler Blasé、Chandler Blasé - Flowers",
	"DJ Blyatman、Russian Village Boys - Cyka Blyat", // 可能重复·C(可能同一首)
	"DJ Blyatman、Russian Village Boys - Cyka Blyat (DJ版)",
	"DJ Titus - Epic",
	"DJ敏少 - 四块五的妞 (咚鼓版)",
	"DJ铁柱 - 我们的歌 (0.8x片段)",
	"Doctor Vox - Frontier",
	"DoubleC大宝西 - 2.14",
	"Elektronomia - Limitless",
	"Epic Score - Liberators (解放者)", // 可能重复·B(较可能同一首)
	"Epic Score - Liberators",
	"F.I.R.飞儿乐团 - 我们的爱", // 可能重复·C(可能同一首)
	"林俊杰 - 我们的爱 (Live)",
	"Feint - My Sunset (我的日落)(Original Mix)", // 同「我创建·默认收藏」
	"Florian Bur - Living",
	"FPX、Chrissy Costanza、Against The Current - PHOENIX",
	"FuGa pang - Lucky", // 可能重复·A(高度相似)
	"FuGa pang - Free lucky",
	"full tilt - Awake",
	"Geoff Zanelli - Beyond My Beloved Horizon",
	"GG - 洋葱", // 可能重复·C(可能同一首)
	"孔柏森 - 洋葱 (Live片段)",
	"ghfhgfyg - 王者荣耀 (李白版)",
	"Gifty - 戒烟", // 可能重复·B(较可能同一首)
	"Glimmer of Blooms - Can't Get You out Of My Head",
	"Globus - Serenata Immortale (最终幻想7)",
	"Hans Zimmer - End Credits",
	"Henry Jackman - First Class",
	"Instrumental Core - Galactic Dust", // 可能重复·B(较可能同一首)
	"Really Slow Motion、Instrumental Core - Galactic Dust",
	"Jacob Tillberg、DEAF KEV - Fade Away (渐行渐远)(Deaf Kev Remix)",
	"Jarico - Fiery Sky", // 可能重复·B(较可能同一首)
	"Jarico - Fiery Sky (Inst_)", // 同「我创建·。」
	"Jason Chen(陈以桐) - Love The Way You Lie", // 可能重复·B(较可能同一首)
	"Jason Chen - Love The Way You Lie",
	"Jawsh 685 - Laxed (DJ Mountain版)", // 可能重复·B(较可能同一首)
	"Mountain - Laxed (DJ Mountain版)",
	"Jaymes Young - Infinity", // 可能重复·B(较可能同一首)
	"Ahxello - Infinity", // 同「我创建·默认收藏」
	"John Dreamer - Becoming a Legend (成为一个传奇)", // 可能重复·B(较可能同一首)
	"John Dreamer - Becoming a Legend",
	"Jon Young - 2 Soon",
	"Jonasu - Black Magic", // 可能重复·B(较可能同一首)
	"Josh Vietti - A Thousand Miles (千山万水)", // 可能重复·B(较可能同一首)
	"Josh Vietti - A Thousand Miles",
	"July - Love Theme (爱情主题)",
	"July - My Soul (我的灵魂)", // 可能重复·B(较可能同一首)
	"July - My Soul",
	"Jundada.Music - 俊大大Music当我还在原地为你选择去等待次品无法代替",
	"Kaiz、Phúc Du、King Kudo - AKLGD (KAIZ Remix)", // 可能重复·C(可能同一首)
	"Kaiz、Phúc Du、King Kudo - AKLGD (remix：KAIZ)", // 同「我创建·two」
	"Katie Sky - Monsters (MushrooM Remix)", // 可能重复·B(较可能同一首)
	"Katie Sky、Timeflies - Monsters",
	"Katie Sky - Monsters",
	"Kevin Rater - I LOVE YOU", // 可能重复·B(较可能同一首)
	"Krutikov Music - Enemy (Arcane League of Legends) (宿敌)(Epic Version)",
	"LeeAlive - Water (水)(Original Mix)",
	"Maroon 5 - Animals", // 可能重复·B(较可能同一首)·同「我创建·。」
	"Martin Garrix、Clinton Kane、Alle Farben - Drown (Alle Farben Remix)",
	"MARUV、BOOSIN - Drunk Groove (Explicit)",
	"Max Brhon - The Future (未来)", // 可能重复·B(较可能同一首)
	"Max Brhon - The Future",
	"Michael Forster、Hans Zimmer、alex gibson、Anna Stevens、Ryan Rubin - Cornfield Chase (原野追逐)(Piano-Cello Version)",
	"MOMOLAND、CHROMANCE - Wrap Me In Plastic (降调版片段)",
	"Mountain、LINGDURemix - ltalia e  voi (Remix)", // 可能重复·A(高度相似)
	"Mr.Polska - Move Up (Lost Gravity)",
	"m-taku - Komorebi (叶隙间洒落的阳光)",
	"NextRO - Anatomy (解剖)(Original Mix)",
	"Nick.Y - Butterfly", // 可能重复·B(较可能同一首)
	"A1 TRIP、Nick.Y - Butterfly",
	"Nightcore - Heartbeat",
	"Nightwish - Last Of The Wilds (荒野遗孤)", // 可能重复·B(较可能同一首)
	"Nora En Pure - Lake Arrowhead (箭头湖)(Radio Mix)",
	"Oturans - 潮鸣り (潮鸣)(Remix)",
	"Pascal Letoublon、Leony - Friendships (Lost My Love)",
	"Peter Jeremias - Dusk (黄昏)", // 可能重复·B(较可能同一首)
	"Peter Jeremias - Dusk",
	"Peter Roe - Last Reunion (最后的重逢)", // 可能重复·B(较可能同一首)
	"Peter Roe - Last Reunion",
	"Phounius - 風の住む街 (风居住的街道)(钢琴版)", // 可能重复·C(可能同一首)
	"Pianomob（钢琴暴徒） - Flower Dance (钢琴版I)",
	"pluko、pronouncedyea、Egzod - Feel the Fire (Egzod Remix)", // 可能重复·C(可能同一首)
	"pluko、pronouncedyea、Egzod - Feel the Fire (remix：Egzod)",
	"Ramin Djawadi - Go Big Or Go Extinct", // 可能重复·B(较可能同一首)
	"Ramin Djawadi - Go Big Or Go Extinct (存亡之战)",
	"Raphaël Beau - Larrons En Foire", // 可能重复·A(高度相似)
	"Rauf & Faik - Can't Buy Me Loving ／ La La La",
	"Rauf & Faik - это ли счастье？ (难道这是幸福吗)", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"dirt party - это ли счастье (难道这是幸福吗)",
	"Robin Hustin、Jex、TobiMorrow - Light It Up",
	"Sara、刘佳 - 爱很美",
	"Seeb、Skylar Grey - Say You Love Me (Clean)", // 可能重复·B(较可能同一首)
	"Seeb、Skylar Grey - Say You Love Me",
	"SeVen.13 - Limitless (无限)", // 同「我创建·。」
	"Sevenn - Loco Papi", // 同「我创建·two」
	"Shake9. - 画心 (0.8) (片段)",
	"Shang、lil sophy - 断线",
	"shankar ehsaan loy - Bum Bum Bole",
	"Shire Music - For Glory",
	"Shire Music - From the Skies",
	"Shire Music、Various Artists - Dark Obsessions",
	"Skan、Krale、Drama B、M.I.M.E - No Glory", // 可能重复·B(较可能同一首)
	"Skan、Krale、M.I.M.E、Drama B - No Glory",
	"SLANDER、Dylan Matthew - Love is gone (Justin Dai & Marvin Bootleg) (Marvin Remix)",
	"Slow down. - 江南 (0.8x)", // 可能重复·B(较可能同一首)
	"SongLong - 告五人-爱人错过 (0.8x降调)(SongLong remix)",
	"Taylor Swift - Love Story", // 可能重复·B(较可能同一首)·同「我创建·QQ飞车音乐合集哈」
	"Taylor Swift - Love Story (DJ版)",
	"TFBOYS - 宠爱",
	"TFBOYS - 加油!AMIGO",
	"TFBOYS - 魔法城堡",
	"TFBOYS - 青春修炼手册 (Live)", // 可能重复·C(可能同一首)
	"The xx - Intro (前奏)", // 可能重复·B(较可能同一首)
	"Dreamtale - Intro", // 同「我创建·。」
	"The xx - Intro",
	"Thimlife、BibianeZ - Home (Blaze U Remix)", // 可能重复·A(高度相似)
	"Thomas Bergersen - Immortal (不朽)",
	"Tommo、MELISA - I'm Alone",
	"Tones And I - Dance Monkey", // 可能重复·B(较可能同一首)
	"Tungevaag、Raaban、Luana Kiara - Bad Boy",
	"Twins - 莫斯科没有眼泪",
	"Two Steps From Hell - For The Win (为了胜)", // 可能重复·B(较可能同一首)
	"Two Steps From Hell - For The Win",
	"Two Steps From Hell - Resistance Is Fatal", // 可能重复·B(较可能同一首)
	"Shire Music - Resistance Is Fatal",
	"Uu(刘梦妤) - 慢慢", // 可能重复·B(较可能同一首)
	"小乐哥（王唯乐） - 慢慢",
	"Uu(刘梦妤) - 我要的飞翔 (片段)",
	"Valentin - A Little Story (一个小故事)",
	"Varien - Future Funk",
	"Vicetone、Cozi Zuehlsdorff - Nevada",
	"Vicetone、Kat Nestel - Angels (Radio Edit)",
	"Vlado Hudec - Follow Your Dream", // 可能重复·B(较可能同一首)
	"Future World Music、Vlado Hudec - Follow Your Dream",
	"WF_Liang - 唯一 (0.8x)",
	"WongKarKwoo - 多幸运 (0.8x)", // 可能重复·B(较可能同一首)
	"小余a - 多幸运 (0.8x)",
	"X-Ray Dog - Hope Always", // 可能重复·B(较可能同一首)·同「我创建·two」
	"YangYang - 关机又关机", // 同「我创建·改编/鬼畜/片段/DJ」
	"Ykey、Namunong - 独行侠 (网友改编)",
	"Yoav Goren - Electric Romeo (电音罗密欧)",
	"Young 7 - 你的前男友",
	"Zealot周星星 - 流离 (片段)",
	"ZheShow - 王者荣耀", // 可能重复·B(较可能同一首)
	"Zoë Wees - Control", // 可能重复·B(较可能同一首)
	"Zoe Wees - Control",
	"Zyboy忠宇 - 妈妈的话", // 可能重复·B(较可能同一首)
	"ラムジ - PLANET",
	"เบลล์ นิภาดา、BOSS HAN - ให้เคอรีมาส่งได้บ่ 泰语童声 (Remix)",
	"阿杜 - 撕夜", // 可能重复·C(可能同一首)
	"唐小力 - 撕夜 (DJ版)",
	"阿吉太组合 - 阿衣莫", // 可能重复·B(较可能同一首)
	"阿龙正罡 - 从此我该怎么过",
	"阿妹啊 - 放开手 (片段)",
	"阿牛 - 桃花朵朵开 (CCTV音乐频道)",
	"阿悠悠 - 旧梦一场",
	"啊糗 - 无话可说",
	"艾希 - 致你 (女声版)",
	"爱吃巧乐兹 - 你那么爱她 (片段)",
	"爱吃巧乐兹 - 年轮 (Live片段)", // 可能重复·B(较可能同一首)
	"张碧晨 - 年轮",
	"汪苏泷 - 年轮",
	"安平 - 唐僧骑马咚那个咚", // 同「我创建·儿歌」
	"安苏羽 - 缺氧", // 可能重复·B(较可能同一首)
	"轩姨(相信光) - 缺氧",
	"奡雪 - 骨生花",
	"八三夭乐团 - 想见你想见你想见你", // 可能重复·C(可能同一首)
	"八三夭乐团 - 想见你想见你想见你 (Live)",
	"刘大壮 - 爱不得忘不舍 (片段)",
	"白小白 - 爱不得忘不舍",
	"白小白 - 爱不得忘不舍 (DJ版)",
	"白小白 - 爱一个人好难", // 可能重复·B(较可能同一首)
	"般禅梵唱妙音组 - 大悲咒",
	"搬运工 - Despair (风靡全球版)",
	"搬运工 - 每个人的身上都有毛毛", // 同「我创建·改编/鬼畜/片段/DJ」
	"坂本昌一郎 - 思い出をありがとう (谢谢你的回忆)",
	"坂部剛 - 前世の記憶",
	"办桌二人组 - 在心里从此永远有个你", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"半吨兄弟 - 爱就一个字",
	"王娅 - 爱情错觉",
	"半吨兄弟 - 爱情错觉",
	"北筱 - 好好生活 (Remix)",
	"比莉 - Dear John",
	"卞卞 - 够钟 (片段)",
	"伯爵Johnny、唐伯虎Annie - 伯虎说",
	"不靠谱组合 - 广寒谣", // 可能重复·B(较可能同一首)
	"伊格赛听、不靠谱组合 - 广寒谣",
	"不是花火呀 - 爱人错过 (片段)", // 可能重复·C(可能同一首)
	"告五人 - 爱人错过",
	"布仁巴雅尔、乌日娜、英格玛 - 吉祥三宝 (国语)", // 可能重复·B(较可能同一首)
	"布仁巴雅尔、乌日娜、英格玛 - 吉祥三宝",
	"蔡健雅 - Letting Go. (0.8变速版)", // 可能重复·B(较可能同一首)
	"蔡健雅 - Letting Go",
	"蔡文姬、澜 - Cheap Thrills (二胡版)", // 可能重复·B(较可能同一首)
	"蔡耀轩 - 去年夏天 (咚鼓版)",
	"曹泽勇 - 飞",
	"草蜢 - 宝贝，对不起",
	"岑溪阿祥 - 预谋 (阿祥 Remix)", // 可能重复·B(较可能同一首)
	"澈子 - 当你被塞班洗脑后 (片段)",
	"陈丙、林泽、伍便滋 - 吃鸡神曲98K (Remix)",
	"陈洁丽 - 猪猪侠", // 可能重复·B(较可能同一首)·同「我创建·动画片」
	"陈瑞 - 白狐",
	"陈少华 - 九九女儿红", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"陈少华 - 九月九的酒", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"陈文非 - 孤独颂歌", // 可能重复·B(较可能同一首)
	"陈旭 - 哥只是个传说",
	"陈泫孝(大泫) - 静悄悄", // 可能重复·B(较可能同一首)
	"杨胖雨 - 静悄悄 (片段)",
	"曲肖冰、前男友 - 静悄悄 (Remix)",
	"陈雪凝 - 假装", // 可能重复·C(可能同一首)
	"陈雪凝 - 淋雨一直走+说爱你+可不可以给我你的微信 (Live)",
	"陈雪凝 - 绿色",
	"陈雪凝 - 欧巴我不傻 (片段)",
	"陈雪凝 - 愚昧",
	"陈雅森 - 问天问地问自己",
	"陈奕迅 - 单车",
	"陈奕迅 - 好久不见",
	"陈玉建 - 偷偷的哭",
	"陈子晴 - 第二星空",
	"承利 - Right Now (降调0.8x)",
	"承利 - Time to Pretend (0.8x)",
	"承利 - 没有物质的爱情只是一盘沙 (Remix)",
	"承利 - 美人鱼 (0.8x)",
	"承利 - 我告诉你什么事最可悲1 (Remix)",
	"程佳佳 - 别错过", // 可能重复·B(较可能同一首)
	"程佳佳 - 好想抱住你",
	"程佳佳 - 太阳 (咚鼓版)(DJ木亦舟版)",
	"吃鸡王者荣耀小仔爷 - 吃鸡王者荣耀小仔爷原声 (片段)", // 可能重复·B(较可能同一首)
	"纯音乐 - Italia e voi (3D环绕版片段) (DJ版)",
	"纯音乐 - rags to rings", // 可能重复·B(较可能同一首)
	"Mark Petrie、Danny McCarthy - Rags To Rings (Main Track｜Full Length)",
	"纯音乐 - 故郷の原風景",
	"崔伟立 - 酒醉的蝴蝶",
	"崔子格 - 卜卦", // 可能重复·B(较可能同一首)
	"大宝软妹、w别丢下甜甜 - 时间的过客", // 可能重复·B(较可能同一首)
	"大欢 - 多年以后",
	"大眼睛萱萱 - Bandari-秋天的落叶",
	"大张伟 - 倍儿爽", // 可能重复·B(较可能同一首)·同「我创建·two」
	"大籽 - 白月光与朱砂痣",
	"大籽 - 行星", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"大籽、Lil E - 放空", // 可能重复·B(较可能同一首)
	"A1 TRIP、大籽、Lil E - 放空",
	"刀郎 - 2002年的第一场雪",
	"刀郎 - 敖包相会", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"刀郎 - 冲动的惩罚", // 可能重复·C(可能同一首)
	"刀郎 - 花儿为什么这样红",
	"刀郎 - 披着羊皮的狼", // 可能重复·B(较可能同一首)
	"谭咏麟 - 披着羊皮的狼",
	"刀郎 - 情人",
	"刀郎 - 西海情歌", // 可能重复·B(较可能同一首)
	"岛的电饭煲 - 角落 (片段)",
	"等什么君(邓寓君) - 赤伶", // 可能重复·B(较可能同一首)
	"孙鹏凯 - 赤伶 (弹唱版)",
	"等什么君(邓寓君) - 辞九门回忆", // 可能重复·B(较可能同一首)
	"邓寓君(等什么君) - 辞九门回忆",
	"等什么君(邓寓君) - 关山酒", // 可能重复·B(较可能同一首)
	"邓寓君(等什么君) - 关山酒",
	"等什么君(邓寓君) - 慕夏", // 可能重复·B(较可能同一首)
	"邓寓君(等什么君) - 慕夏",
	"邓丽君 - 高山青", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"邓丽君 - 何日君再来",
	"迪克牛仔 - 有多少爱可以重来",
	"丁当 - 猜不透", // 可能重复·C(可能同一首)
	"姜鹏Calm - 猜不透 (Live片段)",
	"动力火车 - 当 (Live)", // 可能重复·C(可能同一首)
	"对爱的执念从不是海 - 带我去找夜生活 (0.8x)",
	"对爱的执念从不是海 - 遗失的心跳 (x0.8)",
	"多谎话 - 蠢货 (0.8x)",
	"朵儿超甜鸭 - 老六", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"抢九 - 老六", // 同「我创建·改编/鬼畜/片段/DJ」
	"范倪Liu - 南半球与北海道",
	"方雅贤 - 遇到",
	"肥仔 - 买条街 (片段)",
	"锋锋 - 囍啊囍 (绿茶版)", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"冯靖凯 - 晴天 (片段)", // 可能重复·C(可能同一首)
	"周杰伦 - 晴天",
	"冯提莫 - 佛系少女",
	"冯晓泉 - 冰糖葫芦", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"凤凰传奇 - 等爱的玫瑰",
	"凤凰传奇 - 荷塘月色", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"凤凰传奇 - 郎的诱惑",
	"凤凰传奇 - 天蓝蓝", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"凤凰传奇 - 我从草原来", // 同「我创建·Yy」
	"凤凰传奇 - 我和草原有个约定", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"凤凰传奇 - 月亮之上", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"凤凰传奇 - 自由飞翔", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"高安、黑鸭子组合 - 红尘情歌", // 可能重复·B(较可能同一首)
	"高安、黑鸭子演唱组 - 红尘情歌", // 同「我创建·Yy」
	"高迪 - 黑暗萝莉",
	"高进 - 伤心的歌", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"高进、李玉刚 - 刚好遇见你 (Live)",
	"高进、小沈阳 - 我的好兄弟",
	"高胜美 - 风飞沙", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"高胜美 - 青青河边草",
	"高鱼 - 什么样的爱情 (片段)",
	"格格 - 火苗", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"葛雨晴 - 夜车", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"隔壁老樊 - 大眠 (片段)", // 可能重复·C(可能同一首)
	"王茗 - 大眠",
	"隔壁老樊 - 一个人想着一个人 (片段)",
	"耿磊、冷小妍 - 卑微的喜欢",
	"龚玥 - 爱情海",
	"顾峰 - 犯错", // 可能重复·B(较可能同一首)
	"关喆 - 想你的夜",
	"冠军 - 你要的全拿走 (0.7X)",
	"贵州小蓉儿 - 爱情一阵风",
	"郭聪明 - 你会遇见更好的人",
	"郭玲、冷漠 - 迷茫的爱", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"果味纯氧 - STAY (0.8速)",
	"海来阿木 - 阿果吉曲", // 可能重复·B(较可能同一首)
	"海来阿木 - 不过人间",
	"海来阿木 - 点歌的人",
	"海来阿木 - 孤单的人",
	"海来阿木 - 来跳舞 (国语版)", // 可能重复·B(较可能同一首)
	"海来阿木 - 来跳舞",
	"海来阿木 - 你的万水千山", // 可能重复·B(较可能同一首)
	"海来阿木 - 你的万水千山 (DJ沈念版)",
	"海来阿木、阿呷拉古、曲比阿且 - 别知己", // 可能重复·B(较可能同一首)
	"海伦 - 画离弦", // 可能重复·C(可能同一首)
	"柯柯柯啊 - 画离弦 (片段)",
	"韩安旭 - 不在",
	"韩安旭 - 多幸运",
	"韩涪睇的love - 下个，路口，见 (0.8%降调)",
	"韩红 - 天路 (传统版)", // 可能重复·B(较可能同一首)
	"韩红 - 天路",
	"韩磊 - 向天再借五百年", // 可能重复·B(较可能同一首)
	"豪大大、浪子康 - 这就是爱情 (DJ浪子康、DJ豪大大版)",
	"好多倩 - 熊出没 + 喜洋洋与灰太狼 + 大耳朵图图 + 猪猪侠 + 巴啦啦小魔仙 (片段)",
	"好想谈恋爱啊 - 戒烟 (0.8x)",
	"浩瀚 - 分手在那个秋天", // 可能重复·C(可能同一首)
	"张杰 - 浩瀚",
	"何文宇 - 不配念旧", // 可能重复·B(较可能同一首)
	"何泽远 - 一杯牛奶 (Live)",
	"很美味 - 东西", // 可能重复·B(较可能同一首)
	"林俊呈 - 东西",
	"胡66 - 空空如也", // 可能重复·B(较可能同一首)
	"胡66 - 浪人琵琶",
	"胡伟立 - 初识太极", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"胡伟立 - 市集", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"胡伟立 - 偷功",
	"胡伟立 - 勇往直前",
	"胡夏 - 给我的快乐",
	"花僮 - 浪子闲话", // 可能重复·B(较可能同一首)
	"花僮 - 浪子闲话 (DJ沈念版)",
	"花僮 - 最天使",
	"华语群星 - 悲伤已成曲",
	"华语群星 - 水星记 (片段)", // 可能重复·C(可能同一首)
	"化身复仇者 - 济公1985", // 同「我创建·电视剧」
	"欢子 - 得到你的人却得不到你的心",
	"欢子 - 伤心的时候可以听情歌",
	"欢子 - 为何你对我许下承诺",
	"欢子 - 于心何忍", // 可能重复·B(较可能同一首)
	"黄国俊 - 真爱你的云",
	"黄霑、罗大佑、徐克 - 沧海一声笑", // 可能重复·B(较可能同一首)
	"许冠杰 - 沧海一声笑",
	"火箭少女101 - 卡路里", // 同「我创建·two」
	"极端的杨 - 不要忘记我爱你 (0.8)",
	"纪一馨 - Shots (0.8x)", // 可能重复·B(较可能同一首)
	"昱 - Shots (0.8x)",
	"嘉琪先生、祁念 - 如果爱忘了", // 可能重复·B(较可能同一首)
	"未知歌手 - 如果爱忘了 (片段)",
	"戚薇 - 如果爱忘了",
	"江语晨 - 最后一页",
	"姜鹏Calm - 笑 (片段)",
	"姜筱虎、Selena Gomez、Marshmello - 红色高跟鞋+Wolves",
	"姜玉阳 - 丢了幸福的猪",
	"蒋蒋 - 残雪", // 可能重复·B(较可能同一首)
	"蒋蒋 - 退",
	"蒋雪儿、七叔(叶泽浩) - 莫问归期", // 可能重复·B(较可能同一首)
	"蒋雪儿Snow.J、七叔（叶泽浩） - 莫问归期",
	"叫宝宝 - 烟花易冷 (片段)", // 可能重复·C(可能同一首)
	"劫 - 心如止水 (x0.8)",
	"今儿真高兴(cover) - 今儿真高兴",
	"今晚打老虎 - 客官不可以 (Live 片段)", // 可能重复·C(可能同一首)
	"徐良、小凌 - 客官不可以",
	"金久哲 - 干就完了", // 可能重复·B(较可能同一首)
	"金久哲 - 干就完了 (DJ何鹏版)",
	"金伶 - 斯卡布罗集市 (英文版)",
	"金润吉 - Love Love",
	"金志文 - 远走高飞",
	"锦零 - 豆花之歌", // 可能重复·C(可能同一首)
	"锦零、凤九 - 文爱",
	"精彩高迪 - Asphyxi窒息 (治愈)", // 同「我创建·。」
	"精彩鹤轩 - 空蝉",
	"精彩康康 - 别再庸人自扰去关心她", // 同「我创建·默认收藏」
	"景甜 - 巧遇安徒生",
	"警长最帅哦 - 我太笨 (0.8x片段)",
	"久石譲 - Mother (母亲)",
	"玖儿 - 9420", // 可能重复·C(可能同一首)
	"麦小兜 - 9420",
	"旧时月色音乐、花千骨、苏清墨 - 书途同归", // 同「我创建·花千骨」
	"就是南方凯 - 万拒 (Live片段)",
	"就是南方凯 - 信仰 (片段)", // 可能重复·B(较可能同一首)
	"刘大壮 - 信仰",
	"筷子兄弟 - 小苹果 (2015央视非常星发布现场)", // 可能重复·B(较可能同一首)
	"筷子兄弟 - 小苹果",
	"来一碗老于 - 爱如潮水 + 即兴 (片段)",
	"来一碗老于 - 不败的英雄 (片段)", // 可能重复·C(可能同一首)
	"来一碗老于 - 那些你很冒险的梦 + 修炼爱情 (片段)",
	"来一碗老于 - 芊芊 (片段)",
	"赖仔Morris - 非酋", // 可能重复·B(较可能同一首)·同「我创建·two」
	"蓝心羽 - 寂寞烟火 (片段)",
	"蓝心羽 - 小宇 (片段)",
	"浪子金 - 拿着青春陪你赌", // 同「我创建·改编/鬼畜/片段/DJ」
	"冷漠 - 苦咖啡",
	"黎耀辉 - IF YOU (0.8X)",
	"黎允文 - 赵子龙", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"李哈哈 - 白色桔梗花", // 可能重复·B(较可能同一首)
	"诗人凉 - 白色桔梗花",
	"李哈哈 - 够我喜欢多年",
	"李慧珍 - 爱死了昨天",
	"李居居 - 7th Element (完整DJ原版)",
	"李里梨 - 南风向北",
	"小阿枫 - 爱江山更爱美人",
	"李丽芬 - 爱江山更爱美人",
	"李玲玉 - 粉红色的回忆", // 同「我创建·Yy」
	"李玲玉 - 妈妈的吻", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"李玲玉 - 情网", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"李玲玉 - 祝福", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"张学友 - 祝福",
	"李娜 - 女人是老虎",
	"李飘飘 - 爱丫爱丫 (男生版)",
	"李荣浩 - 爸爸妈妈",
	"李鑫ya - 青花瓷 (片段)", // 可能重复·C(可能同一首)
	"周杰伦 - 青花瓷",
	"李鑫ya - 这个年纪 (片段)", // 可能重复·B(较可能同一首)
	"刘大壮 - 这个年纪 (片段)",
	"李行亮 - 愿得一人心",
	"李奕铭、炮爷 - 潮汐", // 可能重复·C(可能同一首)
	"盗墓笔记 - 《潮汐》DJ版",
	"李宇春 - 下个，路口，见 (2014《One Night》公益演唱会)",
	"李袁杰 - 离人愁",
	"李宗盛 - 鬼迷心窍", // 可能重复·B(较可能同一首)
	"良久哦 - 烟 花 易 冷 (改调×0.7)",
	"梁静茹 - 分手快乐",
	"梁静茹 - 宁夏", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"梁咏琪 - 灰姑娘",
	"亮总 - 只是你太粗心大意忽略了我的感受 (Remix)",
	"林达浪 - 忘记拥抱 (片段)",
	"林俊杰 - 崇拜 (Live)",
	"林俊杰 - 我还想她",
	"林俊杰、蔡卓妍 - 小酒窝 (国语版)", // 可能重复·B(较可能同一首)
	"林啟得 - 醒着醉",
	"林先生 - 没有理由的",
	"林先生 - 伤感",
	"林小珂 - 尘埃",
	"林小珂 - 美人画卷", // 可能重复·B(较可能同一首)
	"闻人听書_ - 美人画卷",
	"林育群 - 蜕变",
	"灵g－你就像我在被子里的舒服 却又像风捉摸不住。 - y2002.m4a", // 可能重复·B(较可能同一首)
	"灵g－【摇滚女嗓】你就像我在被子里的舒服 却又像风捉摸不住。 - y2002.m4a",
	"灵空GTech - 皇家萌卫", // 同「我创建·two」
	"铃声 - 哦拉拉", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"零柒 - 九张机 (王者荣耀版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"刘彬濠 - 后来遇见他", // 可能重复·B(较可能同一首)
	"胡66 - 后来遇见他",
	"刘大壮 - 偏爱 (片段)", // 可能重复·C(可能同一首)
	"张芸京 - 偏爱",
	"刘大壮 - 珊瑚海 (片段)",
	"刘得柱 - 铿锵有力 (DJ版)",
	"刘德华 - 冰雨 (2011上海演唱会现场)",
	"刘德华 - 忘情水",
	"刘和刚 - 父亲", // 可能重复·B(较可能同一首)
	"筷子兄弟 - 父亲",
	"刘欢 - 少年壮志不言愁 2006欢歌上海演唱会",
	"刘欢、陈奕迅 - 菊花台 (Live)",
	"刘珂矣 - 半壶纱 (3D环绕版)", // 可能重复·B(较可能同一首)
	"刘珂矣 - 半壶纱",
	"刘美麟 - 因为是爱", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"刘若英 - 后来", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"刘若英 - 听说", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"刘若英 - 为爱痴狂",
	"刘思瑶nice - 化形的鱼",
	"刘亦心(可乐就是力量) - 牵丝戏＋虚拟 (片段)",
	"刘增瞳 - 不后悔遇到你",
	"刘至佳、韩瞳 - 时光背面的我", // 可能重复·B(较可能同一首)
	"鱼闪闪BLING - 时光背面的我",
	"六哲 - 爱情好无奈",
	"六哲 - 被伤过的心还可以爱谁",
	"六哲 - 如果没有他你还爱我吗",
	"六哲 - 相爱分开都是罪",
	"六哲、陈娟儿 - 错错错", // 可能重复·B(较可能同一首)
	"龙梅子、海彪 - 寂寞的人伤心的歌", // 可能重复·B(较可能同一首)
	"龙梅子、杨海彪 - 寂寞的人伤心的歌",
	"龙梅子、老猫 - 爱情专属权", // 可能重复·B(较可能同一首)
	"龙梅子、老猫 - 漂亮的姑娘就要嫁人啦", // 同「我创建·Yy」
	"龍猛寺寬度 - 武家坡 (网友改编)",
	"卢冠廷、莫文蔚 - 一生所爱", // 可能重复·B(较可能同一首)
	"鹿晗 - 勋章",
	"路飞仙贝 - 欧若拉", // 可能重复·B(较可能同一首)
	"张韶涵 - 欧若拉",
	"鸾音社 - 隔岸", // 可能重复·C(可能同一首)
	"沈7 - 隔岸 (DJ版)",
	"罗大佑 - 童年", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"罗一四 - 我该怎么说(Anything For U)",
	"洛天依 - 哪凉快到哪待着去", // 同「我创建·改编/鬼畜/片段/DJ」
	"洛天依、言和、③① - 秒速五厘米", // 同「我创建·默认收藏」
	"洛先生 - 孤城",
	"吕口口 - 该不该",
	"马懿霄 - 不再打扰你",
	"麦振鸿 - 非礼勿视 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 乐天派 (纯音乐)", // 同「我创建·花千骨」
	"麦振鸿 - 为她而活 (纯音乐)", // 同「我创建·花千骨」
	"馒头 - 123喝热水 (Live片段)",
	"馒头 - 大家好，给大家介绍一下", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 红昭愿 (知否版)", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 加薪歌", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 可不可以 (假日版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 妈妈再打我一次", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 你的酒馆为我烤了羊,我就当酒馆的老板娘 (DJ长音频)", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 你是我的平底锅", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 胖胖的白羊", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 胖胖之歌", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 我妈已经三天没有打我了",
	"馒头 - 我是不是你最疼爱的人，你为什么不打钱", // 同「我创建·改编/鬼畜/片段/DJ」
	"满舒克 - 慢热",
	"漫魚 - 恶作剧 (0.8x)",
	"漫魚 - 新地球 (0.8x)",
	"毛不易 - 不染",
	"没想到(Live)--许嵩",
	"萌萌哒天团 - 帝都",
	"萌小新、李哈哈 - 萝莉哭了", // 同「我创建·改编/鬼畜/片段/DJ」
	"梦然 - 没有你陪伴真的好孤单",
	"米津玄師 - Lemon",
	"蜜雪冰城 - 蜜雪冰城主题曲 (官方版)", // 可能重复·B(较可能同一首)
	"面具锋 - 霸王别姬", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"屠洪刚 - 霸王别姬",
	"蘑菇头 - 我的将军啊 (考试版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"莫叫弟弟 - 爱囚",
	"莫叫姐姐 - 不该用情 (女声版)",
	"莫叫姐姐 - 你能不能不要离开我 (莫叫语版)",
	"莫文蔚 - 爱",
	"沐泽 - 故事与她 (Remix)",
	"那英 - 一笑而过",
	"那英 - 征服",
	"男明星 - 不潮不用花钱 (0.8x)",
	"男明星 - 春娇与志明 (0.8x)",
	"男明星 - 可不可以 (0.8×)",
	"男明星 - 起风了 (0.8x)",
	"南辞、泽亦龙 - 总有一天我会变得特别特别优秀 (第三版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"柠檬心 - 那些年追剧的日子",
	"牛奶咖啡 - 明天,你好",
	"欧翠峰 - 西班牙斗牛士", // 同「我创建·two」
	"潘美辰 - 我想有个家",
	"潘玮柏、弦子 - 不得不爱",
	"潘玮柏、张韶涵 - 快乐崇拜",
	"攀娘、吴石九、扎哥 - 三天不打上房揭瓦 (片段)",
	"庞龙 - 兄弟抱一下",
	"彭丽丽 - 飞蛾扑火",
	"彭羚 - 囚鸟", // 可能重复·C(可能同一首)
	"朴永纯 - 一样的月光 (×0.8)",
	"七叔(叶泽浩) - 半生雪",
	"祁隆 - 爱的世界只有你",
	"祁闻冥轩 - 精神有道",
	"祁岩 - 别等我变了",
	"祺明 - 吃鸡手势舞 (DJ版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"秦晨阳、Lunhui轮回 - 毕业那天",
	"秦海清 - 不如", // 可能重复·B(较可能同一首)
	"青春美少女 - HAPPY Baby", // 可能重复·A(高度相似)
	"青鸟飞鱼 - 此生不换", // 可能重复·B(较可能同一首)
	"青蛙乐队 - 小跳蛙", // 可能重复·B(较可能同一首)·同「我创建·儿歌」
	"清明雨上--许嵩", // 可能重复·A(高度相似)
	"许嵩 - 清明雨上",
	"秋原依 - 错季 (DJ名龙版)",
	"球球、白小白 - 宠爱吖", // 可能重复·B(较可能同一首)
	"全球典藏音乐单 - Mariage d'amour (梦中的婚礼).wav", // 可能重复·B(较可能同一首)
	"全球典藏音乐单 - Mariage d'amour (梦中的婚礼)",
	"群星 - Joke+老司机带带我", // 同「我创建·串烧」
	"饶天亮 - 做你的爱人", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"任立佳、千百顺 - 两个我们2017",
	"任然 - 飞鸟和蝉", // 可能重复·B(较可能同一首)
	"任然 - 凉城", // 可能重复·B(较可能同一首)
	"任然 - 山外小楼夜听雨",
	"任贤齐 - 伤心太平洋", // 可能重复·B(较可能同一首)
	"任贤齐 - 心太软", // 可能重复·B(较可能同一首)
	"任贤齐、杨千嬅 - 花好月圆夜 (国语版)",
	"任宇翔 - 稳住别浪 (王者荣耀鬼畜版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"如果当时--许嵩", // 可能重复·A(高度相似)
	"许嵩 - 如果当时",
	"阮豆 - 小永远",
	"阮言Ruany - 琉璃 (片段)",
	"萨顶顶 - 左手指月 (Live)", // 可能重复·C(可能同一首)·同「我创建·Yy」
	"三叔说 - 海市蜃楼", // 可能重复·C(可能同一首)
	"一颗狼星 - 海市蜃楼 (女声版)",
	"三四ve、木槿(余健强) - 甜不辣",
	"纱琉璃Shelley - 我的一个道姑朋友", // 同「我创建·默认收藏」
	"山水组合 - 你莫走",
	"深七 - 死在江南烟雨中",
	"石仙、张龙、杜支村、谭琳 - 小粽子 (小苹果改编版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"是二智呀 - 疑心病 (片段)",
	"书怡 - 假面舞会 (女声版)",
	"水木年华 - 一生有你", // 可能重复·C(可能同一首)
	"水木年华 - 一生有你 (DJ版)",
	"私に闻いて风i - 季雨晴空", // 可能重复·B(较可能同一首)
	"听风Xyi - 季雨晴空",
	"宋孟君 - 彼岸花",
	"宋孟君 - 对方正在输入",
	"宋瑞、韩夜、虞姬、小可 - 给我一瓶可以忘记过去的酒",
	"宋小睿 - 我和你", // 可能重复·B(较可能同一首)·同「我创建·儿歌」
	"宋祖英 - 大地飞歌", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"宋祖英 - 好日子", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"宋祖英 - 长大后我就成了你",
	"苏贝贝 - 还无法忘记",
	"苏冬涛 - 你是我未曾拥有无法捕捉的亲昵 (DJ8先生版)", // 同「我创建·串烧」
	"苏芮 - 跟着感觉走",
	"苏三 - 很任性相爱过",
	"苏有朋 - 背包",
	"苏泽 - 脚艺人 (DJ版)", // 可能重复·B(较可能同一首)
	"苏泽 - 脚艺人", // 同「我创建·改编/鬼畜/片段/DJ」
	"素颜--许嵩&何曼婷", // 可能重复·A(高度相似)
	"许嵩、何曼婷 - 素颜", // 同「我创建·默认收藏」
	"孙悦 - 祝你平安",
	"孙子涵 - 回忆那么伤",
	"索朗扎西 - 姑娘我爱你", // 同「我创建·Yy」
	"索朗扎西 - 心爱的姑娘",
	"邰正宵 - 九百九十九朵玫瑰", // 可能重复·C(可能同一首)·同「我创建·Yy」
	"南北组合、赵允哲、DJ Wave - 九百九十九朵玫瑰 (DJ版)",
	"邰正宵 - 欲擒故纵",
	"太田美知彦 - 万里の長城", // 可能重复·B(较可能同一首)
	"太田美知彦 - 万里の長城 (万里长城)",
	"汤潮 - 狼爱上羊",
	"唐古 - 你牛什么牛",
	"唐千云 - 海底",
	"藤竹京 - 庸人自扰 (片段)", // 可能重复·C(可能同一首)
	"王理文 - 庸人自扰",
	"天籁天 - 你还是从前的你吗",
	"添儿呗 - 互相隐瞒 (片段)",
	"田馥甄 - 小幸运", // 可能重复·C(可能同一首)
	"甜甜、宋烨靓 - 过了很久终于我愿抬头看", // 可能重复·B(较可能同一首)
	"窪田美奈 - Cross The Rainbow (跨越彩虹)", // 可能重复·B(较可能同一首)
	"窪田美奈 - Cross The Rainbow",
	"娃娃 - 漂洋过海来看你",
	"丸子呦 - 广寒宫", // 可能重复·B(较可能同一首)
	"汪峰 - 春天里",
	"汪峰 - 飞得更高",
	"汪苏泷、朱元冰 - 选我选我",
	"王大毛 - 去年夏天",
	"王菲 - 但愿人长久",
	"王赫野 - 大风吹",
	"王靖雯 - 会吗",
	"王力宏、谭维维 - 缘分一道桥",
	"王琪 - 可可托海的牧羊人", // 可能重复·B(较可能同一首)
	"王琪 - 可可托海的牧羊人 (DJ沈念版)",
	"王琪 - 送亲", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"王莎莎 - 姐就是女王", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"王小帅 - 哭泣站台",
	"王小帅 - 你是我的玫瑰花", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"王晓东 - 合十 (DJ默涵版)",
	"王笑文 - 耿耿于怀",
	"王忻辰 - 落差",
	"王忻辰 - 迷失幻境",
	"王忻辰、苏星婕 - 落日与晚风", // 可能重复·B(较可能同一首)
	"IN-K、王忻辰、苏星婕 - 落日与晚风",
	"王新新 - 三年的等待 (DJ秦Sir版)",
	"王妤笑 - 寂寞才说爱", // 可能重复·B(较可能同一首)
	"刘可 - 寂寞才说爱",
	"王雨笙 - May I See U Again (DJ叮当版)",
	"王源、HENRY刘宪华 - 我想我是海 (Live)",
	"网络歌手 - 老公送我夏家三千金 老公", // 可能重复·B(较可能同一首)
	"未知歌手 - 老公送我夏家三千金 老公",
	"旺仔小乔 - 我还是 (片段)", // 可能重复·C(可能同一首)
	"未知歌手 - 38度6 (苏谭谭)", // 可能重复·B(较可能同一首)
	"网络歌手 - 38度6 (苏谭谭)", // 同「我创建·改编/鬼畜/片段/DJ」
	"未知歌手 - Hand Clap", // 可能重复·B(较可能同一首)
	"Fitz and The Tantrums - HandClap",
	"未知歌手 - Laxed (片段).wav",
	"未知歌手 - May I see U again+I love you 3000 times", // 可能重复·B(较可能同一首)
	"纯音乐 - May I see U again+I love you 3000 times",
	"未知歌手 - Salt (DJ版)", // 可能重复·B(较可能同一首)
	"Ava Max - Salt",
	"Ava Max - Salt (DJ版)",
	"未知歌手 - 爱的好累", // 可能重复·B(较可能同一首)
	"网络歌手 - 爱的好累",
	"未知歌手 - 碧波摇篮曲", // 可能重复·B(较可能同一首)
	"未知歌手 - 创作的原声 (片段)", // 可能重复·B(较可能同一首)
	"未知歌手 - 大城小爱 (小黄人版)",
	"未知歌手 - 孤雏 (0.8x片段)",
	"未知歌手 - 即兴", // 可能重复·B(较可能同一首)
	"小咪 - 即兴",
	"未知歌手 - 九张机 (Slowed 0.8X)",
	"未知歌手 - 兰亭序 (0.8版)",
	"未知歌手 - 浪漫血液 (0.8版片段)",
	"未知歌手 - 铃儿响叮当 (改编版片段)",
	"未知歌手 - 罗曼蒂克的爱情 (0.8)", // 可能重复·B(较可能同一首)
	"网络歌手 - 罗曼蒂克的爱情 (0.8)",
	"未知歌手 - 明天过后 (DJ莫小七版)",
	"未知歌手 - 起风了 (校园版)", // 可能重复·B(较可能同一首)
	"未知歌手 - 晴 (0.85x)",
	"未知歌手 - 少年英雄小哪吒 (纯音乐)", // 可能重复·B(较可能同一首)
	"杨采钰 - 少年英雄小哪吒", // 同「我创建·动画片」
	"未知歌手 - 生僻字 (学生考试版片段)",
	"未知歌手 - 四季予你 (0.8版片段)",
	"未知歌手 - 往后余生 (3D环绕版)",
	"未知歌手 - 往后余生+盛夏的果实 (DJ蓝雅)",
	"未知歌手 - 我的草原我的马 (DJ版片段)",
	"未知歌手 - 我们喵星人就是这么拽 (片段)",
	"未知歌手 - 我知道 (0.8版)",
	"未知歌手 - 喜之郎果冻 (鬼畜版片段)",
	"未知歌手 - 小妹不跟你 (快四版)", // 可能重复·B(较可能同一首)
	"未知歌手 - 小仙女你怎么了 (散王孤宸)",
	"未知歌手 - 绣荷包", // 可能重复·B(较可能同一首)
	"张也 - 绣荷包", // 同「我创建·Yy」
	"未知歌手 - 一次就好 (DJ版)", // 可能重复·B(较可能同一首)
	"杨宗纬 - 一次就好",
	"未知歌手 - 一次就好 (马丽、DJ Ayao)",
	"未知歌手 - 一格格 (0.8版片段)",
	"未知歌手 - 疑心病 (改调版0.7)", // 可能重复·B(较可能同一首)
	"网络歌手 - 疑心病 (改调版0.7)",
	"魏小然 - 几度梦回大唐",
	"魏新雨 - 百花香",
	"魏新雨 - 丹青古寨",
	"文 - 粉太郎-命运 (0.8x)",
	"文武贝 - 繁华的寂静", // 可能重复·B(较可能同一首)
	"稳弟 - 稳弟� 「热播咚鼓」我想你是爱我的 我猜你也舍不得", // 同「我创建·默认收藏」
	"我只有两只耳朵 - 你也没有错",
	"吴静 - 女儿情", // 可能重复·B(较可能同一首)·同「我创建·西游记音乐合集」
	"吴欣怡 - 布谷鸟", // 可能重复·B(较可能同一首)
	"五月天 - 你不是真正的快乐",
	"五月天 - 突然好想你", // 可能重复·B(较可能同一首)
	"锦悦JY - 突然好想你",
	"五月天、陈绮贞 - 私奔到月球", // 可能重复·B(较可能同一首)
	"陈绮贞、五月天 - 私奔到月球",
	"伍华 - 独白式分手",
	"伍华 - 伤已成曲",
	"伍思凯 - 特别的爱给特别的你",
	"武昌理工学院合唱 - 我的天空 (高考版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"武聆音雄 - 天龙八部间奏曲 (片段)",
	"兮沐 - 黄昏之时 (钢琴版)",
	"西海岸(ACT.1-ACT.7) - westcoast",
	"西游记 - 搞笑 (唐僧跑妞)", // 同「我创建·改编/鬼畜/片段/DJ」
	"吸引力合唱组 - 一个师傅仨徒弟", // 可能重复·B(较可能同一首)
	"囍哥 - 光 (片段)",
	"夏婉安 - 奈何桥",
	"香香 - 就算没有如果", // 可能重复·B(较可能同一首)·同「我创建·花千骨」
	"享儿 - 一万个舍不得", // 可能重复·B(较可能同一首)
	"庄心妍、祁隆 - 一万个舍不得",
	"庄心妍 - 一万个舍不得 (Remix)(DJ Candy版)",
	"庄心妍、祁隆 - 一万个舍不得 (DJ Candy版)",
	"庄心妍 - 一万个舍不得 (DJ京仔版)",
	"萧全 - 海草舞",
	"萧全 - 社会摇",
	"萧亚轩 - 最熟悉的陌生人",
	"小阿七 - 不谓侠", // 可能重复·B(较可能同一首)
	"小阿七 - 从前说",
	"小灰灰 - 明天,你好 (cover：牛奶咖啡)",
	"小可、周资恒、DJ YiXiu - 江归江山归山河归河川归川英雄难过美人 (片段)",
	"小蓝背心 - 目及皆是你", // 可能重复·B(较可能同一首)
	"小乐颜 - 天空之城 (说唱版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"小奶瓶 - 欧美旋律 (Remix版)",
	"小潘潘(潘柚彤) - 黄梅戏 (流行唱腔版)", // 可能重复·A(高度相似)
	"小倩 - 不配怀念",
	"小沈阳 - 八戒八戒",
	"小沈阳 - 大笑江湖", // 可能重复·B(较可能同一首)
	"小太妹 - 天空之城 (特别版)", // 可能重复·B(较可能同一首)
	"MC小太妹 - 天空之城 (特别版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"小团子吖 - 一起走到时间的尽头",
	"小蜗 - 红尘客栈 (片段)", // 可能重复·C(可能同一首)
	"周杰伦 - 红尘客栈",
	"小小浩、文博 - 学生时代2",
	"小鸭子老师 - Cứ Chill Thôi",
	"小眼睛阿旺 - 我们的纪念 (片段)", // 可能重复·C(可能同一首)
	"小洲 - 盗心贼", // 可能重复·B(较可能同一首)
	"小洲 - 海阔天空", // 可能重复·B(较可能同一首)
	"信乐团 - 海阔天空",
	"BEYOND - 海阔天空",
	"校长(张驰) - 带你去旅行 (Live)",
	"笑阿 - 让我做你的眼睛 (唱腔版)",
	"谢军 - 碎心石",
	"心软 - 九张机 (间奏降调0.8x)",
	"信乐团 - 死了都要爱",
	"星辰 - 后来的我们 (0.8X)",
	"徐秉龙、桃十五 - 青柠",
	"徐怀钰 - 分飞", // 可能重复·C(可能同一首)
	"徐怀钰 - 分飞 (Live)", // 同「我创建·Yy」
	"徐怀钰 - 我是女生", // 可能重复·B(较可能同一首)·同「我创建·儿歌」
	"徐良、小凌 - 坏女孩", // 可能重复·B(较可能同一首)
	"徐良、小凌 - 坏女孩 (Remix)",
	"徐薇 - 云烟成雨", // 可能重复·B(较可能同一首)
	"房东的猫 - 云烟成雨",
	"徐誉滕 - 等一分钟 (DJ刘汉成版)",
	"许冠杰 - 阿郎恋曲",
	"许镜清 - 逍遥自在的孙大圣", // 可能重复·B(较可能同一首)·同「我创建·西游记音乐合集」
	"许哲珮 - 气球",
	"薛之谦 - 丑八怪", // 可能重复·B(较可能同一首)
	"薛之谦 - 丑八怪+演员 (Live)",
	"薛之谦 - 独角戏 (Live)", // 可能重复·B(较可能同一首)
	"薛之谦 - 刚刚好",
	"薛之谦 - 你还要我怎样",
	"薛之谦 - 认真的雪",
	"薛之谦 - 演员", // 可能重复·B(较可能同一首)
	"雅俗共赏--许嵩", // 可能重复·A(高度相似)
	"许嵩 - 雅俗共赏",
	"杨建桥 - 看月亮爬上来",
	"杨坤 - 空城",
	"杨幂 - 爱的供养",
	"杨培安 - 爱上你是一个错",
	"半吨兄弟 - 爱上你是一个错",
	"付豪 - 爱上你是一个错",
	"付豪 - 爱上你是一个错 (DJ伟然版)",
	"杨培安 - 我相信",
	"杨千嬅 - 处处吻", // 可能重复·B(较可能同一首)
	"檀健次、王霏霏 - 处处吻 (Live)",
	"杨硕 - 天下起雨了心情什么颜色 失去你的我 快乐还是", // 可能重复·B(较可能同一首)
	"杨小壮 - 爱情堡垒",
	"杨小壮 - 孤芳自赏",
	"杨小壮 - 一个人挺好", // 可能重复·C(可能同一首)
	"金大帅 - 一个人挺好 (DJ版)",
	"杨亚茹Triste - 当爱在靠近", // 可能重复·B(较可能同一首)
	"半吨兄弟 - 当爱在靠近",
	"杨洋 - 微微一笑很倾城", // 可能重复·B(较可能同一首)
	"杨洋 - 微微一笑很倾城 (雨水滴在我的外套)",
	"杨雨柔 - Haru Haru",
	"药材 - 几度梦回大唐 (王者荣耀版)",
	"耀温顺 - La La La (说唱原版)",
	"叶丽仪 - 上海滩", // 可能重复·B(较可能同一首)
	"刘德华 - 上海滩",
	"叶启田 - 爱拼才会赢", // 可能重复·B(较可能同一首)
	"叶蒨文 - 潇洒走一回", // 可能重复·B(较可能同一首)·同「我创建·新白娘子传奇」
	"一杨 - 三生三世", // 可能重复·B(较可能同一首)
	"张杰 - 三生三世", // 同「我创建·花千骨」
	"易烊千玺 - 大城小爱 (Live)",
	"逸霄 - 察觉", // 可能重复·B(较可能同一首)
	"音格概念、逸霄 - 察觉",
	"音阙诗听 - 红昭愿",
	"音阙诗听、王梓钰 - 大雪", // 可能重复·B(较可能同一首)
	"王梓钰 - 大雪",
	"音阙诗听、赵方婧 - 芒种",
	"尹昔眠 - 奔赴星空", // 可能重复·B(较可能同一首)
	"贺敬轩 - 奔赴星空",
	"尹昔眠 - 西楼别序 (片段)", // 可能重复·C(可能同一首)
	"尹昔眠、小田音乐社 - 西楼别序",
	"应嘉俐 - 活着viva (女版)", // 可能重复·B(较可能同一首)
	"应嘉俐、嘭心 - 活着viva (女版)",
	"游鸿明 - 爱我的人和我爱的人",
	"小阿枫 - 爱我的人和我爱的人",
	"有点焦绿 - 我叫安琪拉", // 同「我创建·改编/鬼畜/片段/DJ」
	"余志坪 - 阿哥阿妹", // 可能重复·B(较可能同一首)
	"鱼闪闪BLING - 沉醉的青丝 (Live片段)", // 同「我创建·改编/鬼畜/片段/DJ」
	"虞姬、圈妹、苏可可 - Ealy ng Dea (DJ版)",
	"云朵、刀郎 - 爱是你我",
	"张碧晨 - 光的方向",
	"张冬玲 - 花开的时候你就来看我",
	"张栋梁 - 当你孤单你会想起谁", // 可能重复·B(较可能同一首)
	"美美jocie - 当你孤单你会想起谁",
	"张浩泽 - 爱就一个字 (片段)", // 可能重复·C(可能同一首)
	"张信哲 - 爱就一个字",
	"张家旺 - 给不了你未来",
	"张杰 - 剑心",
	"张杰 - 这,就是爱 (2011全球流行音乐金榜现场)",
	"张杰、胡迪、范如臣 - 我们都一样 (Live)",
	"张杰、杨颖、李晨、陈赫、王大陆 - 这就是爱", // 可能重复·C(可能同一首)
	"张杰、杨颖、李晨、陈赫、王大陆 - 这就是爱 (Live)",
	"张明敏 - 我的中国心",
	"张韶涵 - 淋雨一直走", // 可能重复·B(较可能同一首)
	"张韶涵 - 亲爱的，那不是爱情",
	"张韶涵 - 隐形的翅膀",
	"张信哲 - 爱如潮水",
	"张信哲 - 过火",
	"张燕 - 月亮女儿", // 可能重复·B(较可能同一首)·同「我创建·Yy」
	"张宇 - 给你们",
	"张宇 - 月亮惹的祸", // 可能重复·B(较可能同一首)
	"张宇 - 月亮惹的祸 (DJ版)",
	"张振宇 - 不要再来伤害我",
	"张紫豪 - 地铁等待",
	"章伟杰 - 我已经爱上你",
	"赵传 - 我是一只小小鸟",
	"赵季平 - 王进打高俅", // 可能重复·B(较可能同一首)·同「我创建·电视剧」
	"赵俊飞 - 抽烟只抽煊赫门", // 可能重复·C(可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"赵雷 - 成都", // 可能重复·B(较可能同一首)
	"赵乃吉 - 曾经你说",
	"赵炘屿、柒月 - 有点甜", // 可能重复·B(较可能同一首)
	"汪苏泷、BY2 - 有点甜",
	"汪苏泷、BY2 - 有点甜 (DJ伟然版)",
	"赵亦笙 - 你会快乐么", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"赵咏华 - 最浪漫的事", // 可能重复·B(较可能同一首)
	"赵照 - 当你老了 (2012版)",
	"浙音4811(一个大金意) - 拜拜",
	"郑伊健 - 虫儿飞 (聂风版)", // 同「我创建·儿歌」
	"郑源 - 爱过的人",
	"郑源 - 爱情码头",
	"郑源 - 当我孤独的时候还可以抱着你",
	"郑源 - 等",
	"郑源 - 一万个理由",
	"郑源 - 怎么会狠心伤害我",
	"郑智化 - 水手", // 可能重复·B(较可能同一首)
	"郑智化 - 星星点灯",
	"周传雄 - 关不上的窗",
	"周华健 - 花心",
	"周华健 - 让我欢喜让我忧",
	"周杰伦 - 发如雪",
	"周杰伦 - 告白气球",
	"周杰伦 - 花海",
	"周杰伦 - 简单爱",
	"周杰伦 - 双截棍",
	"周杰伦 - 说走就走",
	"周深 - 大鱼", // 可能重复·C(可能同一首)
	"赵海洋 - 大鱼 (钢琴版)",
	"周深 - 和光同尘",
	"周思涵 - 过客",
	"周迅 - 身未动,心已远",
	"周延英（英子-effie） - 回不去的从前", // 可能重复·B(较可能同一首)
	"周延英（英子-effie） - 那个人",
	"周琰 - 我始终相信每个人都有独特的美丽",
	"周艳鸿 - 嫁人就嫁灰太狼",
	"朱铭捷 - 曾经最美",
	"朱添泽 - 等", // 可能重复·B(较可能同一首)
	"庄园 - 嘴巴嘟嘟",
	"灼夭、戾格 - 刺客", // 可能重复·B(较可能同一首)
	"灼夭、国风新语、戾格、小田音乐社 - 刺客",
	"左宏元、张慧清 - 渡情", // 可能重复·B(较可能同一首)
)

// 我喜欢歌单·酷狗（共 2353 首：与上方列表重复 877 首已跳过、下载成功并入 498 首、以下 731 首暂无法下载）
songs.push(
	"邓寓君(等什么君) - 叹郁孤",
	"晓龙、苏妤 - 七滴相思泪",
	"Thomas Greenberg - The Right Path", // 可能重复·B(较可能同一首)
	"凯大大 - The Right Path",
	"陆树铭 - 一壶老酒", // 可能重复·B(较可能同一首)
	"誓言 - 求佛", // 可能重复·B(较可能同一首)
	"誓言 - 求佛 (DJ默涵版)",
	"汪峰 - 勇敢的心",
	"曾春年 - 最幸福的人",
	"S.H.E - 中国话",
	"张含韵 - 想唱就唱",
	"孙子涵、李潇潇 - 全世界宣布爱你",
	"兰雨 - 最后一次的温柔", // 可能重复·B(较可能同一首)
	"甜瓜儿不是呆瓜 - 最后一次的温柔",
	"花僮 - 笑纳",
	"徐泽（要不要买菜） - 下山",
	"程响 - 世界这么大还是遇见你",
	"杨胖雨 - 情深深雨濛濛",
	"庄心妍 - 再见只是陌生人", // 可能重复·C(可能同一首)
	"邓寓君(等什么君) - 笑看",
	"林俊杰 - 醉赤壁", // 可能重复·B(较可能同一首)
	"en (王翊恩) - 云水谣",
	"王媛渊 - 三妻四妾", // 可能重复·B(较可能同一首)
	"贺一航 - 我又想你了",
	"Acreix - Visions",
	"王雨笙 - Here we are again",
	"Peter Roe - One Love",
	"吴埈成 - Sad Run",
	"Era - The Mass (Surround Sound)", // 可能重复·B(较可能同一首)
	"Else - Paris (巴黎)", // 同「我创建·。」
	"悠悠琴韵 - Theme Of Exodus (出埃及记)(钢琴版)",
	"华莎 - 마리아 (María) (玛利亚)", // 同「我创建·two」
	"李荣浩 - 年少有为", // 可能重复·B(较可能同一首)
	"张靓颖 - 我的梦",
	"深海鱼子酱 - 千千万万",
	"凤飞飞 - 追梦人", // 可能重复·B(较可能同一首)
	"Martin Garrix、Troye Sivan - There For You", // 同「我创建·和平精英音乐合集」
	"尚士达 - 生而为人", // 可能重复·B(较可能同一首)
	"小星星Aurora - 坠落星空",
	"杨栋梁、夏婉安 - 我的心在海对面",
	"Superluckyqi - 直觉",
	"王贰浪 - 人间城",
	"王铮亮 - 时间都去哪儿了", // 同「我创建·默认收藏」
	"井迪 - 失控",
	"徐梓淳 - 嫌晚",
	"薛之谦 - 天外来物", // 可能重复·B(较可能同一首)
	"yihuik苡慧 - 银河与星斗",
	"不是花火呀 - 陨落", // 可能重复·C(可能同一首)
	"杨博然 - 所有",
	"陈子晴 - 陪你看星星",
	"姚六一 - 雾里", // 可能重复·C(可能同一首)
	"不是花火呀 - Ring Ring Ring",
	"Lost Frequencies、Janieck - Reality",
	"秋裤大叔 - 一晃就老了", // 可能重复·B(较可能同一首)
	"Cadmium、Harley Bird、Rival - Seasons",
	"国风新语、浮生梦、汐音社 - 探窗",
	"Burak Yeter、Danelle Sandoval - Tuesday (Original Mix)",
	"久石让 - The Rain",
	"井胧、井迪 - 骁",
	"程响 - 时光洪流",
	"羽肿 - Windy Hill (风之谷)",
	"阿南亮子 - Refrain",
	"Reynard Silva - The Way I Still Love You",
	"July Tun - 清新的小女孩(For Ma)",
	"刀郎 - 花儿为什么这样红 (2016音乐大师课第二季第6期现场)",
	"Dropgun、Kaleena Zanders - Nothing New (feat. Kaleena Zanders)(Explicit)",
	"JVLA - Such a Whore",
	"INNDRIVE - Oriente",
	"凯撒 - Sugar Crash (DJ Kaisa)", // 可能重复·C(可能同一首)
	"DJ凯撒 - Lone Ranger (DJ Kaisa)", // 同「我创建·two」
	"Sia - Unstoppable", // 可能重复·B(较可能同一首)
	"The Score - Unstoppable",
	"Mr FijiWiji、Laura Brehm、AgNo3 - Pure Sunlight", // 同「我创建·和平精英音乐合集」
	"Feint、Laura Brehm - We Won't Be Alone",
	"EXO - 지나갈 테니 (Been Through)",
	"DAISHI DANCE、Cécile Corbel - Take Me Hand", // 可能重复·B(较可能同一首)
	"DJ Project、Giulia - Nu (Original Mix)",
	"Bobby Capri - Rather Be (Pri Mix)",
	"Regard - Ride It",
	"蓝心羽 - 星辰不坠落",
	"丢火车乐队 - 晚安", // 可能重复·B(较可能同一首)
	"买辣椒也用券 - 起风了", // 可能重复·B(较可能同一首)
	"程响 - 千里共婵娟",
	"邰正宵 - 千纸鹤",
	"薛之谦 - 我害怕",
	"凤凰传奇 - 心驰神往",
	"白小白 - 最后我们没在一起 (DJ伟伟Mix)(DJ阳山伟伟版)",
	"鹿晗 - 致爱 Your Song",
	"王琪 - 站着等你三千年",
	"尚文婷 - 做你的猫",
	"鹿晗 - 时间停了 (The Moment)(Live)",
	"程响 - 新娘不是我",
	"王靖雯 - 爱，存在",
	"零一九零贰 - 忘川彼岸", // 可能重复·B(较可能同一首)
	"韩可可 - 迷失在梦中",
	"王雨桐 - 太阳", // 可能重复·B(较可能同一首)
	"TheMix多语种乐团 - Lemon (九种语言版)",
	"邓寓君(等什么君) - 同舟",
	"Hayley Westenra - Scarborough Fair",
	"乔艳艳 - 谁",
	"大张伟 - 我在诗里看到了你",
	"Germán Gastón Álvarez y La Chueca - We Will Rock You (EnVivo(Explicit))",
	"张杰 - 仰望星空",
	"GALA - 追梦赤子心",
	"July - Somewhere", // 同「我创建·。」
	"Hans Zimmer、Lisa Gerrard - Now We Are Free (Maximus Mix)",
	"李玉刚 - 万疆",
	"胡期皓 - 小时光",
	"杨千嬅 - 野孩子",
	"杨胖雨 - 这就是爱吗",
	"Cascada - Miracle (DJ BOSS HAN版)",
	"Escala - Requiem For A Tower",
	"凤凰传奇 - 奢香夫人", // 可能重复·B(较可能同一首)
	"阿语 - 奢香夫人 (DJ版)",
	"凤凰传奇 - 奢香夫人 (DJ版)",
	"葛顺 - 夜的钢琴曲五",
	"王富贵 - 情字最大 (DJheap九天版)",
	"宋孟君 - 失眠的夜 (DJ版)", // 可能重复·C(可能同一首)
	"宋孟君 - 失眠的夜",
	"王搏 - 穷叉叉",
	"鹏鹏音乐、付豪 - 夜夜夜漫长",
	"傅梦彤 - 星陨",
	"程响 - 四季予你",
	"海来阿木 - 烟雨人间", // 可能重复·B(较可能同一首)
	"海来阿木 - 烟雨人间 (DJ沈念版)",
	"高胜美 - 一帘幽梦",
	"庾澄庆 - 情非得已", // 可能重复·B(较可能同一首)
	"小蓝背心 - 我怕来者不是你",
	"张学友 - 吻别",
	"七叔（叶泽浩） - 燕无歇", // 可能重复·B(较可能同一首)
	"回小仙 - 醒不来的梦",
	"邓丽君 - 小城故事",
	"赵海洋 - 夜空的寂静 (钢琴曲)",
	"刘思涵 - 走在冷风中", // 可能重复·B(较可能同一首)
	"庄学忠 - 中华功夫", // 可能重复·B(较可能同一首)·同「我创建·two」
	"张韶涵 - 破茧", // 可能重复·B(较可能同一首)
	"庄心妍 - 为情所伤", // 可能重复·B(较可能同一首)
	"半吨兄弟 - 为情所伤",
	"半吨兄弟 - 为情所伤 (DJ沈念版)",
	"贺一航 - 请先说你好",
	"李玖哲 - 想太多",
	"七叔（叶泽浩） - 踏山河", // 可能重复·B(较可能同一首)
	"半阳 - 一曲相思",
	"李袁杰、李俊佑 - 醉千年",
	"逃跑计划 - 夜空中最亮的星",
	"邱永传 - 十二年",
	"邱永传 - 十一年",
	"Ice Paper - 心如止水",
	"姜鹏 - 赢在江湖", // 可能重复·C(可能同一首)
	"齐晨 - 咱们结婚吧",
	"陈慧娴 - 千千阕歌",
	"潘安邦 - 外婆的澎湖湾", // 可能重复·B(较可能同一首)
	"卓依婷 - 外婆的澎湖湾",
	"小志 - 当世界美好与你环环相扣",
	"周杰伦 - 夜曲",
	"阿米 - 一个深爱的女孩",
	"张靓颖 - 如果这就是爱情",
	"夹子道 - 死心塌地",
	"李晓杰 - 朋友的酒",
	"温岚 - 夏天的风", // 可能重复·B(较可能同一首)
	"Uu (刘梦妤) - 夏天的风",
	"Die - 月亮不睡你不睡", // 可能重复·C(可能同一首)
	"朴树 - 平凡之路",
	"半阳 - 我的将军啊", // 可能重复·B(较可能同一首)
	"岑宁儿 - 追光者", // 可能重复·C(可能同一首)
	"汪苏泷 - 追光者 (Live)",
	"周笔畅 - 最美的期待",
	"小阿枫 - 醉倾城", // 可能重复·B(较可能同一首)·同「我创建·two」
	"小阿枫 - 醉倾城 (DJ名龙版)",
	"阿YueYue - 云与海",
	"王忻辰、苏星婕 - 去年花开",
	"郑源 - 为爱停留",
	"张靓颖 - 天下无双",
	"许佳慧 - 预谋",
	"海来阿木 - 五十年以后", // 可能重复·B(较可能同一首)
	"海来阿木 - 五十年以后 (DJ沈念版)",
	"蒋雪儿Snow.J - 谁在意我流下的泪",
	"郑亦辰 - 相思成灾",
	"庄心妍 - 以后的以后", // 可能重复·B(较可能同一首)
	"黄龄、Tăng Duy Tân - 叹",
	"残雪 - 弃佛入魔", // 可能重复·B(较可能同一首)
	"闻人听書_ - 虞兮叹", // 可能重复·B(较可能同一首)
	"张小九 - 余香", // 可能重复·B(较可能同一首)
	"李哈哈 - 再也不会遇见第二个她",
	"Deep East Music - Sunny Jim",
	"李春波 - 小芳",
	"姜玉阳 - 痛彻心扉", // 可能重复·B(较可能同一首)
	"汪苏泷 - 一笑倾城",
	"李克勤 - 月半小夜曲", // 可能重复·B(较可能同一首)
	"王晴 - 月半小夜曲",
	"六哲、贺敬轩 - 让全世界知道我爱你",
	"黑Girl - 123木头人",
	"2Someone - Star Unkind (Lanfranchi & Farina Radio)(Radio Edit)",
	"房东的猫 - New Boy",
	"刘钧 - 听闻远方有你", // 可能重复·B(较可能同一首)
	"朴树 - 那些花儿",
	"齐秦 - 月亮代表我的心",
	"Danko - Pump It Up (Original Mix)",
	"V6 - Take Me Higher (带我飞得更高)(DJ Bonca金柱版)",
	"EDM - Yasuo(亚索)",
	"ALan - Octopus", // 同「我创建·two」
	"XYPO、M. Fischer - We Can Be Together",
	"RYLLZ - Nemesis",
	"Ramin Djawadi、Tom Morello - Pacific Rim (feat. Tom Morello)", // 同「我创建·和平精英音乐合集」
	"Vicetone、Meron Ryan - Walk Thru Fire",
	"Lambert凌杰、十七草 - Young boss 2.0", // 同「我创建·two」
	"Cedric Gervais、Digital Farm Animals、Dallas Austin - Touch The Sky (ANR151)", // 可能重复·B(较可能同一首)
	"Cedric Gervais、Digital Farm Animals、Dallas Austin - Touch The Sky",
	"邓寓君(等什么君) - 误红妆",
	"邓寓君(等什么君) - 怎叹",
	"Danny McCarthy - Silver Scrapes (银痕)",
	"Two Steps From Hell、Thomas Bergersen - Never Back Down",
	"魏琮霏 - 青石巷",
	"THT - 葬花",
	"ALisa - 为霜 (治愈版)",
	"ALisa、五月的钢琴 - 海 で待っています (我在海边等你)(治愈版)",
	"花姐 - 夜之光",
	"张学友 - 一千个伤心的理由",
	"周杰伦 - 七里香", // 可能重复·B(较可能同一首)
	"王不醒 - 月老掉线", // 可能重复·B(较可能同一首)
	"听风Xyi - 世间遗憾皆是温柔",
	"Maker、听风Xyi - 星雨夜空",
	"邓寓君(等什么君)、FOX胡天渝 - 踏雪",
	"Post Malone、Ty Dolla $ign - Psycho (Clean)",
	"威仔、格子兮 - 我知道你不爱我",
	"高胜美 - 我是不是你最疼爱的人", // 可能重复·B(较可能同一首)
	"半吨兄弟 - 我是不是你最疼爱的人",
	"The Harmonics - The Other Side of Paradise",
	"杜宣达 - 原来我从未忘记你",
	"Herb Ohta - いつも何度でも (与你同在)(「千と千尋の神隠し」より)",
	"代诗琪 - 揉碎夜的光",
	"大壮 - 上了年纪的男人",
	"莫叫姐姐 - 我们的爱输给了现实",
	"华子、小钢炮 - 谁的人生不孤独 (两个大叔)",
	"你们的好朋友大雨 - 情结",
	"杨小壮 - 最后的人", // 可能重复·B(较可能同一首)
	"杨小壮 - 最后的人 (DJ阿卓、DJ阿龙版)",
	"川井憲次 - 潇湘子",
	"崔伟立 - 情火", // 可能重复·B(较可能同一首)
	"孙艺琪 - 情火",
	"Alan Walker、JOP - OK",
	"张晓棠 - 新送情郎",
	"叶里 - 人间惊鸿客",
	"傅如乔 - 微微",
	"Alan Walker - The Spectre", // 可能重复·B(较可能同一首)
	"Ray-X - Dancin",
	"Ray-X - The Spectre",
	"邓岳章 - 情意结", // 可能重复·B(较可能同一首)
	"陈慧娴 - 情意结",
	"邓岳章 - 情意结 (DJ R7版)",
	"王优秀 - 想某人", // 可能重复·B(较可能同一首)
	"王优秀 - 想某人 (DJ舞曲版)",
	"黄静美 - 愿你",
	"贺一航 - 入了我的心丢了我的魂",
	"Lana Del Rey、Cedric Gervais - Summertime Sadness (remix：Cedric Gervais)",
	"白小白 - 最美情侣",
	"方大同 - 特别的人",
	"胡夏 - 那些年", // 可能重复·B(较可能同一首)
	"小洲 - 爱都爱了", // 可能重复·B(较可能同一首)
	"小洲 - 爱都爱了 (DJ德朋版)",
	"Hoàng Thùy Linh - See Tình (遇见挚爱)(Speed Up Version)", // 同「我创建·two」
	"李盈盈、小蓓蕾组合 - 人类呀爱我吧",
	"J Balvin、Willy William、Hugel - Mi Gente (remix：Hugel)",
	"阿悠悠 - 念旧",
	"宗次郎 - 故郷の原風景 (故乡的原风景)",
	"张晓棠 - 苏幕遮",
	"Zyboy忠宇 - 堕",
	"LBI利比（时柏尘） - 小城夏天",
	"pro - 等不来花开", // 可能重复·B(较可能同一首)
	"豆包 - 作酒",
	"88rising、Rich Brian - History (Explicit)",
	"ycccc - 满天星辰不及你",
	"梦然 - 是你", // 可能重复·C(可能同一首)
	"yihuik苡慧 - 麦浪",
	"SING女团 - 寄明月",
	"Nieem - Streets (7秒DJ版片段)",
	"王若熙 - 怎随天下 (DJ名龙版)",
	"娜美 - 醉仙美",
	"海伦 - 游京", // 可能重复·B(较可能同一首)
	"小猫多鱼 - Hello friend (电竞专用版)",
	"苏谭谭 - 醉过多少回",
	"Charlie Puth、Selena Gomez - We Don't Talk Anymore (feat. Selena Gomez)",
	"5媚娘 - 夜深了", // 可能重复·B(较可能同一首)
	"i先生 - 满心欢喜 (Remix)",
	"者思范 - 我爱你有始有终 (34秒片段)",
	"腾金涛 - 斯芬克斯",
	"周杰伦 - 龙卷风",
	"赵海洋 - 秋的思念 (钢琴曲)", // 同「我创建·。」
	"告五人 - 给你一瓶魔法药水",
	"Copy、BT07-PZ - 晚风", // 可能重复·C(可能同一首)
	"Copy、BT07-PZ - 晚风 (网友改编)",
	"梦歆冉 - 伤心的酒吧 (伤感女声DJ版)",
	"大星 - 你是我的人 (DJ版)",
	"程响 - 等你归来",
	"July - Beyond the Memory",
	"带泪的鱼(戴丽丽) - 爱逝枷锁",
	"Deep East Music - Old Threads",
	"Mission Impossible - Mission： Impossible Theme",
	"Deep East Music - High Brow Low Down",
	"Kevin MacLeod - Fluffing a Duck",
	"李豪、虞姬、小可 - despair (bootleg)",
	"阿YueYue、螃蟹 - 다시 너를 (再次见到你)", // 可能重复·B(较可能同一首)
	"芒果布丁 - NINEELIE (合奏版)",
	"TFBOYS - 大梦想家",
	"3LAU、Ninja - Game Time",
	"烟嗓 - 南墙",
	"唐云歌 - 降E大调夜曲  肖邦",
	"陈奕迅 - 爱情转移", // 可能重复·B(较可能同一首)
	"小金点点 - 回忆复习指南",
	"许嵩、孙涛 - 书香年华",
	"郭静 - 心墙", // 可能重复·B(较可能同一首)
	"林俊杰 - 心墙",
	"Reverb - Trepte (Explicit)",
	"柯柯柯啊 - 旧梦一场 (男生版)",
	"曾抖抖 - 平凡日子里的挣扎",
	"云汐 - 故事还长",
	"Shakira、Freshlyground - Waka Waka (Esto es Africa)",
	"MI.YAO - Light particle E",
	"袁树雄 - 早安隆回", // 可能重复·B(较可能同一首)
	"袁树雄 - 早安隆回 (DJ沈念版)",
	"袁树雄 - 早安隆回 (DJ京仔版)",
	"M爷、马帅帅、DJ潇洒先生 - The Minimal Beat (DJ版)", // 可能重复·C(可能同一首)
	"Strong R. - The Minimal Beat",
	"YANYSMUSIC - Snoop Catt",
	"D1ofAquavibe - The Party Troll",
	"梦柯 - 曾经的王", // 可能重复·B(较可能同一首)
	"神马乐团 - 爱河",
	"千百顺 - 很任性",
	"小瑞、斌Sir - 最强EA7 (DJ版)",
	"小瑞 - EA7最火硬曲 (DJ版)",
	"1个球 - 大雨还在下", // 可能重复·B(较可能同一首)
	"1个球 - 大雨还在下 (DJ阿卓、DJ阿龙版)",
	"Mediks - Come Back Down (Original Mix)",
	"JJD - Aeon",
	"Steerner、Martell - Sky (Radio Edit)", // 同「我创建·默认收藏、和平精英音乐合集」
	"Tungevaag - Wicked Wonderland", // 同「我创建·默认收藏」
	"RT - Umbrella (Remix)", // 可能重复·B(较可能同一首)
	"Savior - Umbrella (remix)",
	"5 Seconds of Summer - Teeth", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"Raven & Kreyn、RudeLies、Nino Lucarelli - This Far (RudeLies Remix)",
	"Lazer Boomerang - Time to Pretend",
	"古羽 - 她的眼睛会唱歌",
	"董昱昆 - 我想",
	"张碧晨 - 不要忘记我爱你",
	"闻人听書_ - 一笑江湖", // 可能重复·B(较可能同一首)
	"薄荷er - 想想念念",
	"Jori King - Fatal Love",
	"葛漂亮 - 烟雨唱扬州 (女版)",
	"枫叶 - 白了否冷",
	"李莹小熊 - 飞云之下 (女声版)",
	"陈雪凝 - 没有人心疼我",
	"季彦霖、箱子 - 你根本不懂",
	"承桓 - 我会等", // 可能重复·B(较可能同一首)
	"杉和、小青蛙组合 - 子莫格尼",
	"程响 - 人间烟火",
	"迟里乌布、Morerare - 簇拥烈日的花",
	"张杰 - 星星 (Live)",
	"李玉刚 - 清明上河图",
	"毛阿敏 - 天之大",
	"田馥甄 - 你就不要想起我",
	"袁小朵 - 那个夏天",
	"苏星婕 - 听悲伤的情歌",
	"梨笑笑 - 山茶花读不懂白玫瑰", // 可能重复·C(可能同一首)
	"梅朵 - 总以为来日方长",
	"半吨兄弟、王小草 - 想把我唱给你听", // 可能重复·B(较可能同一首)
	"Radion 6 - Lightning",
	"张小健 - 三两三",
	"中铁十四局隧道公司 - 篇章-2022届新学员", // 可能重复·B(较可能同一首)
	"Mae Stephens - If We Ever Broke Up",
	"Michael Jackson - Dangerous",
	"Dxrk ダーク - RAVE (锐舞)",
	"The Piano Guys - Rolling in the Deep",
	"半吨兄弟 - 最美的伤口", // 同「我创建·two」
	"甄秀儀 - 千里共嬋娟",
	"米雅 - 太多",
	"添儿呗 - 烟火人间",
	"海伦 - 游山恋",
	"金南玲 - 逆流成河 (典藏版)", // 可能重复·B(较可能同一首)
	"谢军 - 那一夜", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"莫叫姐姐 - 下辈子不一定还能遇见你 (吉他版)",
	"彭佳慧 - 相见恨晚",
	"BOSS HAN - You混搭 (DJ版)",
	"七音盒 - 炸山姑娘",
	"潇潇潇潇如 - 病变 (女生版)",
	"鹿晗、邓超、李晨 - 超级英雄 (Live in Shanghai)",
	"欧阳朵 - 失去才懂",
	"华莎 - 마리아 (14秒片段)",
	"F.I.R.飞儿乐团、彭佳慧 - 心之火", // 可能重复·C(可能同一首)·同「我创建·花千骨」
	"香香 - 猪之歌",
	"SPYAIR - Rage of Dust",
	"David Guetta、Afrojack、Bebe Rexha、Nicki Minaj - Hey Mama (feat. Nicki Minaj, Bebe Rexha & Afrojack)(DJ LBR Remix)",
	"Nora En Pure - Lake Arrowhead (箭头湖)(Original Mix)",
	"冷漠 - 伤心城市", // 可能重复·B(较可能同一首)
	"周杰伦 - 听妈妈的话",
	"T-Pain、Ne-Yo - Turn All the Lights On", // 同「我创建·默认收藏」
	"Thomas Bergersen - Victory (网友改编)",
	"大壮 - 我们不一样 (Radio Edit)(DJ小鱼儿版)",
	"任然 - 无人之岛", // 可能重复·B(较可能同一首)
	"邓岳章 - 无人之岛",
	"鸣小明 - 无人之岛",
	"欢子 - 心痛2009",
	"黄霄雲 - 星辰大海",
	"林俊杰 - 一千年以后",
	"张北北 - 拥抱你离去",
	"周冰倩 - 真的好想你",
	"Deepain - 身骑白马", // 可能重复·B(较可能同一首)
	"林忆莲 - 为你我受冷风吹", // 可能重复·B(较可能同一首)
	"大壮 - 为你我受冷风吹",
	"李翊君 - 风中的承诺",
	"张学友 - 我不在乎等多久",
	"童安格 - 灯",
	"杨沛宜 - 左手右手", // 可能重复·B(较可能同一首)·同「我创建·动画片」
	"Rompasso - Angetenar (Radio Edit)",
	"柯柯柯啊 - 画离弦 (柯柯版)",
	"코드 쿤스트、李遐怡 - O (Feat. 이하이)",
	"杨琦 - 想 (DJ女生版)",
	"Brandy - (Everything I Do) I Do It for You",
	"聂思诗 - 一起吹过晚风的街",
	"郑鱼 - 无归期",
	"关心 - 提笔忘情",
	"王忻辰 - 时间沦陷",
	"盖君炎 - 我想要",
	"王靖雯 - 忘了没有", // 可能重复·B(较可能同一首)
	"柯柯柯啊 - 樱花树下的约定", // 可能重复·B(较可能同一首)
	"邓寓君(等什么君) - 天下", // 可能重复·B(较可能同一首)
	"Raim & Artur、Adil、Artur、RaiM - Simpa", // 同「我创建·和平精英音乐合集」
	"Dan Farber - Don't Touch (DJMix)",
	"刘家纬、272 - Love Is Gone", // 可能重复·B(较可能同一首)
	"SLANDER、Dylan Matthew - Love Is Gone",
	"Spada、Anna Leyne - Catchfire (Sun Sun Sun) (EDX's Miami Sunset Remix)",
	"MayPiano - Illusionary Daytime (幻昼)(钢琴版)",
	"纯音乐 - 溯 (钢琴版)",
	"Avicii、Nicholas Furlong - The Nights",
	"Orchestra、Maksim、jeff wayne - Main Theme (出埃及记)(Arr. Bateman)",
	"Shawn Mendes - Stitches", // 可能重复·C(可能同一首)
	"马有才 - Stitches (DJ版)",
	"Kenny G - Jasmine Flower",
	"咖菲 - 风雨飘洒",
	"DiESi - 時代を越える想い (穿越时空的思念)(remix：DiESi)",
	"Lightscape - Collapsing World (崩溃的世界)(Original Mix)", // 同「我创建·和平精英音乐合集」
	"安卿尘 - 难以启齿的柔弱 (烟嗓版)",
	"The Kid LAROI、Justin Bieber - STAY (Clean)", // 可能重复·B(较可能同一首)·同「我创建·。」
	"The Kid LAROI、Justin Bieber - STAY (Explicit)",
	"Wiz Khalifa、Charlie Puth - See You Again",
	"闫永强 - The Spectre (幽魂)(唢呐演奏版)(Live)",
	"SHAUN、Conor Maynard、Sam Feldt - Way Back Home (Sam Feldt Edit)",
	"SHAUN - Way Back Home",
	"笑白Ermy、White Wolf Tracks - 战曲 Battle Epic Song", // 同「我创建·two」
	"久石让 - Summer (菊次郎的夏天)", // 可能重复·B(较可能同一首)
	"饭碗的彼岸 - 風の住む街 (风居住的街道)(Piano Ver.)",
	"徐佳莹 - 我一直都在这里", // 同「我创建·熊出没」
	"王建荣 - 公虾米", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"何鹏、金久哲 - 嗑儿 (DJ何鹏版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"猫有饼 - 38度6 (41秒吃鸡版片段)", // 同「我创建·改编/鬼畜/片段/DJ」
	"馒头 - 穷的响叮当", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"抽象带篮子 - 野心千万种 (Original Mix)", // 同「我创建·改编/鬼畜/片段/DJ」
	"杨钰莹 - 轻轻地告诉你", // 同「我创建·儿歌」
	"自信的阿呆 - Rumors", // 同「我创建·改编/鬼畜/片段/DJ」
	"宋瑞、竭容生 - 三条腿的蛤蟆找不着,两条腿的女人多的是", // 同「我创建·改编/鬼畜/片段/DJ」
	"精彩轩迪 - 山前山后各有哀愁", // 同「我创建·改编/鬼畜/片段/DJ」
	"杨硕哥哥 - 生僻字 (完整电晕版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"R7 - 桃花运 (DJR7版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"新地、卢克 - 我不是刘德华", // 同「我创建·改编/鬼畜/片段/DJ」
	"花儿乐队 - 嘻唰唰", // 可能重复·B(较可能同一首)·同「我创建·儿歌」
	"颜一 - 心酸", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ」
	"ALisa - 星茶会 (治愈版)",
	"许美静 - 阳光总在风雨后", // 同「我创建·儿歌」
	"Heaven J - 鱿鱼游戏 (123木头人)", // 同「我创建·改编/鬼畜/片段/DJ」
	"全球音乐吧 - 13年前的这首歌要是放到现在,依旧是不可超越的神曲,太洗脑!", // 同「我创建·改编/鬼畜/片段/DJ」
	"李文踹 - 38度6 (烧烤版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"豆包 - 太想念", // 可能重复·B(较可能同一首)
	"豆包 - 太想念 (DJ阿卓、DJ阿龙版)",
	"阿吉野马 - Зая",
	"锋锋 - 佛罗里达州最硬的男人", // 同「我创建·two、改编/鬼畜/片段/DJ」
	"桃沢樱 - DJDJ我要上头了",
	"The Score - Born For This",
	"my darkest days - Save Yourself (Album Version)",
	"FlicFlac、Beatrich - So High",
	"Capital Kings、Unknown、Hollyn - All Good",
	"Panic! At the Disco - High Hopes",
	"Valley Of Wolves - Lions Inside",
	"Tommee Profitt、Jung Youth - Only One King",
	"Oh The Larceny - Incredible",
	"Imagine Dragons - Demons",
	"Daughtry - Ghost Of Me",
	"Tyron Hapi、Bianca - Lost Control (feat. Bianca)", // 同「我创建·默认收藏」
	"Zayde Wølf - Cold-Blooded",
	"Simple Plan - Last One Standing", // 同「我创建·QQ飞车音乐合集哈」
	"Black Veil Brides - In the End", // 可能重复·B(较可能同一首)
	"Matilda - Illusion",
	"Gavin DeGraw - Fire", // 同「我创建·默认收藏」
	"Zayde Wølf - Hustler",
	"Fall Out Boy - Centuries",
	"Oh The Larceny - Man on a Mission",
	"Rachel Platten - Fight Song",
	"Kygo、Sasha Alex Sloan - I'll Wait",
	"Zayde Wølf - Strike a Match",
	"Within Temptation 诱惑本质 - Mercy Mirror",
	"Danny Avila - End Of The Night (Explicit)", // 同「我创建·默认收藏」
	"Mesto、Brielle Von Hugel - Chances (feat. Brielle Von Hugel)", // 同「我创建·默认收藏」
	"张禾禾 - 逃之夭夭 (DJheap九天版)",
	"郑源 - 难道爱一个人有错吗",
	"泽亦龙 - EDM (DJ打碟版)",
	"纯音乐 - 诡异恐怖音效", // 同「我创建·改编/鬼畜/片段/DJ」
	"平生青涯 - 醉里",
	"郑伊健 - 心如刀割",
	"小猫多鱼 - 祝你生日快乐", // 同「我创建·two、改编/鬼畜/片段/DJ」
	"金莎 - 爱的魔法",
	"安苏羽 - 人走茶凉",
	"Yes - Roundabout",
	"宝藏挖掘机 - 《梦见我们相遇》索菲亚：真的再见到你，再次拥抱你在怀里 (长音频)", // 同「我创建·改编/鬼畜/片段/DJ」
	"5媚娘 - 拥抱星河万里", // 同「我创建·改编/鬼畜/片段/DJ」
	"7宇 - 7宇版小毛驴一起摇", // 同「我创建·改编/鬼畜/片段/DJ」
	"仇远旭 - 一格格 (粤语女版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"周杰伦 - 我是如此相信",
	"小小奶黄包 - Samsara (0.8×)", // 同「我创建·改编/鬼畜/片段/DJ」
	"DJ花神经 - 世间万物 (DJ版)", // 同「我创建·。」
	"就是南方凯 - 问心",
	"季彦霖 - 选择失忆",
	"今晚打老虎 - 触电",
	"久石让 - Mad Summer",
	"Imagine Dragons、Lil Wayne - Believer", // 可能重复·B(较可能同一首)
	"Home Free - Sea Shanty Medley", // 同「我创建·two」
	"HINA - ID",
	"HENRY刘宪华、圭贤、泰民 - Trap (Korean Ver.)",
	"伯爵Johnny、唐伯虎Annie - 伯虎说 (feat.唐伯虎Annie)",
	"AGA - Wonderful U (Demo Version)",
	"馒头 - おどるポンポコリン", // 同「我创建·改编/鬼畜/片段/DJ」
	"牟凡 - 爱的哲学",
	"洛先生 - 影子说",
	"林子祥 - 成吉思汗",
	"林俊杰、金莎 - 期待爱",
	"林俊杰 - 裹着心的光",
	"李飘飘 - 寂寞烟火 (治愈版)",
	"李巍V仔 - 守护着我的光",
	"刘崇健 - 失忆 (什么才是真理)",
	"Phúc Du、King Kudo - Anh không làm gì đâu a thề (我发誓什么都不做)(DJ版)",
	"柯柯柯啊 - 姑娘在远方",
	"柯柯柯啊 - 大海 (柯柯吉他版)",
	"Jacob Tillberg、DEAF KEV - Fade Away (Deaf Kev Remix)",
	"鞠婧祎 - 叹云兮", // 可能重复·B(较可能同一首)
	"金渔 - 伪善者",
	"金婷婷 - 风吹麦浪", // 可能重复·B(较可能同一首)
	"The Tech Thieves - Fake",
	"苏天伦 - Sober",
	"胜屿 - 我们说好的", // 可能重复·B(较可能同一首)
	"矢野立美 - 远き呼び声の彼方へ (那来自远方的呼唤)(＜M-41,M-62A＞)",
	"Really Slow Motion - Deadwood Main (枯木)(纯音乐)",
	"Rauf & Faik - Колыбельная (摇篮曲)(Kolybel'naja)", // 可能重复·B(较可能同一首)
	"Ramin Djawadi - 存亡之战 (派崔克·史坦普混音)",
	"Rag'n'Bone Man - Skin",
	"杨千嬅、任贤齐 - 花好月圆夜",
	"秦晨阳 - 毕业那天", // 可能重复·B(较可能同一首)
	"彭小胖 - 缺憾", // 可能重复·B(较可能同一首)·同「我创建·。」
	"Oh The Larceny - This Is It",
	"Nora En Pure - Lake Arrowhead (Radio Mix)",
	"NextRO - Anatomy (Original Mix)",
	"Universal Idol、VodKe、HSHK、Pnan、贰皮 - Italia e voi (双枪说)", // 同「我创建·two」
	"Matteo - Panama (巴拿马)",
	"Martin Garrix、Clinton Kane、Alle Farben - Drown (feat. Clinton Kane)(Alle Farben Remix)",
	"XXXTentacion - NUMB", // 可能重复·C(可能同一首)
	"许嵩 - 千百度",
	"许嵩 - 江湖",
	"萧亚轩 - 遗失的心跳", // 可能重复·B(较可能同一首)
	"小皮皮爱习题 - Upupu",
	"兮沐 - 黄昏之时 (钢琴曲)",
	"Will Armex、Katy M - You and I (feat. Katy M)",
	"王靖雯 - 善变", // 可能重复·B(较可能同一首)
	"王恩信Est、二胖u - 飞",
	"王忻辰、苏星婕 - 清空",
	"王子健 - 循迹",
	"陈每文、熊健萍、陈帆等 - 雨花石 (电视连续剧《红红的雨花石》主题歌)",
	"我是小力气 - 一格格", // 可能重复·B(较可能同一首)
	"Slow_77 - 一格格 (Live)",
	"Valentin - A Little Story (小故事)",
	"Ugress - Undead Funeral March",
	"Tungevaag、Raaban、Luana Kiara - Bad Boy (feat. Luana Kiara)",
	"Two Steps From Hell、Thomas Bergersen、Merethe Soltvedt - El Dorado (Dubstep Remix)",
	"张泽熙 - 那个女孩", // 可能重复·B(较可能同一首)
	"周慧敏 - 最爱", // 可能重复·B(较可能同一首)
	"于梓贝 - 最爱",
	"阳山伟伟 - 她的微笑 (Original Mix)",
	"远方 - 她只是经过", // 可能重复·C(可能同一首)
	"郁可唯 - 远方",
	"烟(许佳豪) - 再见我的女孩",
	"坠. - 关键词 (Live)",
	"煜臣 - 王者荣耀 (一人我饮酒醉李白鬼畜)",
	"迪总 - 江归江山归山 (57秒DJ版｜片段)", // 同「我创建·改编/鬼畜/片段/DJ」
	"网络歌手 - Laxed (14秒片段)",
	"旺仔小乔 - 我还是 (20秒片段)", // 同「我创建·改编/鬼畜/片段/DJ」
	"刘大壮 - 我不是你的宋冬野 (30秒Live片段)",
	"霍宝库 - 谁不曾拥有梦想",
	"贺敬轩 - 毕业季",
	"灰澈 - 星茶会",
	"浩然H.R - 年少的你啊",
	"Geoff Zanelli - Beyond My Beloved Horizon (From ＂Pirates of the Caribbean： Dead Men Tell No Tales＂／Score)",
	"DJ铁柱 - 我们的歌 (18秒0.8x片段)",
	"24KGoldn、iann dior - Mood (Explicit)", // 同「我创建·。」
	"布袋寅泰 - BATTLE WITHOUT HONOR OR HUMANITY (无差别格斗)", // 同「我创建·two」
	"冰冰超人 - 八年的爱", // 可能重复·B(较可能同一首)
	"Alan Walker、Iselin Solheim - Sing Me to Sleep",
	"宋谦泽、明洋 - MELANCHOLY (Remix)", // 可能重复·B(较可能同一首)
	"付汶昊、蔡萝莉 - Middle Of The Night (DJ环绕版)",
	"雷军、Mr.Lemon - Are You OK", // 同「我创建·改编/鬼畜/片段/DJ」
	"Immediate Music - Electric Romeo", // 可能重复·B(较可能同一首)·同「我创建·默认收藏」
	"Hans Zimmer - Cornfield Chase (原野追逐)", // 同「我创建·默认收藏」
	"盗哥 - 耍猴专用BGM (唢呐版)",
	"王小帅 - 最近",
	"睡不醒的觉o - 白山茶 (温柔女生版)",
	"KOKIA - ありがとう… (谢谢…)",
	"林俊杰 - 爱不会绝迹", // 可能重复·B(较可能同一首)·同「我创建·动画片」
	"Jessie J - Flashlight (From ＂Pitch Perfect 2＂ Soundtrack)", // 同「我创建·动画片」
	"梅尼耶 - The Riddle (口哨版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"萍爷 - Как вы哦NO哦NO", // 同「我创建·改编/鬼畜/片段/DJ」
	"e中人 - 江南Style (我爸刚弄死他)", // 同「我创建·改编/鬼畜/片段/DJ」
	"6诗人 - 卡布奇诺", // 可能重复·B(较可能同一首)·同「我创建·改编/鬼畜/片段/DJ、。」
	"李少白 - 你男朋友很差", // 同「我创建·改编/鬼畜/片段/DJ」
	"小智慧 - 世俗总要男人无惧无畏 (Remix)", // 同「我创建·改编/鬼畜/片段/DJ」
	"张雪峰 - 一人我饮酒醉 (考研版)", // 同「我创建·改编/鬼畜/片段/DJ」
	"Richard Clayderman - La Cumparcita", // 同「我创建·熊出没」
	"熊出没. - Tricks And Traps", // 可能重复·C(可能同一首)·同「我创建·熊出没」
	"枯木逢春 - 这一生关于你的风景",
	"Vicetone、Kat Nestel - Angels (Extended Mix)",
	"刘增瞳 - 多想留在你身边",
	"懒大王 - 姑娘别哭泣 (懒羊羊版)",
	"VIVI - 开心往前飞", // 同「我创建·儿歌」
	"周杰伦 - 兰亭序", // 可能重复·B(较可能同一首)
	"王十三 - 兰亭序",
	"林迏浪、h333 - 还是会想你",
	"王心凌 - 梦的光点", // 可能重复·B(较可能同一首)·同「我创建·动画片」
	"张学友 - 你好毒",
	"罗家英 - Only You", // 可能重复·B(较可能同一首)
	"就是南方凯 - 离别开出花",
	"雨帆 - 荒 (我曾爱过一个人竹笛纯享版)",
	"Crx7 - 梦的边境",
	"杨秉音 - 大黑天",
	"橘子海 - 夏日漱石 (Summer Cozy Rock)",
	"纯音乐 - 倩女幽魂", // 可能重复·B(较可能同一首)·同「我创建·。」
	"刘惜君 - 倩女幽魂",
	"张国荣 - 倩女幽魂",
	"张连春 - 掀起你的盖头来",
	"海来阿木 - 西楼儿女", // 可能重复·B(较可能同一首)
	"容祖儿 - 抱抱",
	"吴泓君 - 采槟榔",
	"曾心梅 - 娜奴娃的探戈",
	"陈毅、精彩轩迪 - 够爱 (男嗓版)",
	"王乐蔚 - 孤独的船",
	"洛先生 - 只要有你", // 可能重复·B(较可能同一首)
	"小阿枫 - 只要有你",
	"抠抠 - 星光就在前方",
	"齐豫 - 橄榄树",
	"家家 - 命运", // 可能重复·B(较可能同一首)
	"魏佳艺 - 我来人间一趟", // 可能重复·B(较可能同一首)
	"魏佳艺 - 我来人间一趟 (DJ默涵版)",
	"于冬然 - 其实都没有", // 可能重复·B(较可能同一首)
	"于冬然 - 其实都没有 (DJ铁柱版)",
	"宝藏挖掘机 - 《囍》：没有这歌可怎么活啊",
	"张雨生 - 我的未来不是梦",
	"赵雷 - 我们的时光",
	"姜育恒 - 再回首",
	"王佳杨 - 遗憾",
	"王逗逗 - 小甜心",
	"张碧晨 - 笼", // 可能重复·B(较可能同一首)
	"DJ婷姐、小李吖、虞姬(12) - 说三两句晚安",
	"张叶蕾 - 还是分开",
	"张韶涵 - 有形的翅膀",
	"苏芮 - 酒矸倘卖无",
	"海生 - 情一动心就痛",
	"王以太、刘至佳 - 危险派对",
	"冷漠 - 一路向北",
	"良久哦 - 烟花易冷 (良久哦0.7X变速版)",
	"蒙面哥 - 一亿个伤心",
	"moumoon - Sunshine Girl",
	"周传雄 - 青花",
	"怪阿姨 - 放纵L", // 可能重复·B(较可能同一首)
	"Z.YAO中药 - 与我无关",
	"谢宇伦 - 夜半", // 可能重复·B(较可能同一首)
	"VINAI - Parade",
	"Pure Morning - L2",
	"小炎同学 - 天下的乌鸦一般黑",
	"郑钧 - 私奔",
	"梁博 - 出现又离开 (Live)",
	"曲婉婷 - Jar Of Love (Album Version)",
	"曲婉婷 - 最好的安排",
	"吸猫大师 - 《zhurek 中文翻唱》：有点好听~很难不喜欢",
	"ADAM - Zhurek",
	"Justin Bieber、Ludacris - Baby", // 同「我创建·QQ飞车音乐合集哈」
	"阿桑 - 一直很安静", // 可能重复·B(较可能同一首)
	"陈奕迅 - 富士山下", // 可能重复·B(较可能同一首)
	"潘成（皮卡潘） - 白鸽乌鸦相爱的戏码", // 可能重复·B(较可能同一首)
	"李荣浩 - 不将就", // 可能重复·B(较可能同一首)
	"蓝波 - 一起闯荡",
	"许慧欣 - 七月七日晴",
	"张杰 - 听",
	"林俊杰 - 不为谁而作的歌",
	"陈柏宇 - 你瞒我瞒",
	"孙丽丽 - 蛋黄的长裙蓬松的头发",
	"Nathan Evans - Wellerman (Sea Shanty ／ Karaoke Version)",
	"李文杰 - 杀死比尔", // 可能重复·B(较可能同一首)·同「我创建·two」
	"萨顶顶 - 自由行走的花",
	"毛不易 - 如果有一天我变得很有钱 (Live)",
	"八音盒 - Sacred Play Secret Place (DJ版)",
	"弹棉花的小花 - 再见青春 (释怀版)",
	"王樾安 - 会开花的云", // 可能重复·B(较可能同一首)
	"泡芙芙Scarlett - 芦苇飞",
	"唐伯虎Annie - 落 (花开花落日升日没)",
	"伍佰 & China Blue - 突然的自我 (Live)",
	"番番、韩圣 - 芦苇飞 (说唱版)", // 同「我创建·默认收藏」
	"费戚戚 - 风催雨 (节奏版)",
	"Vnriet - Let Me Put (Reset House)",
	"T-ara - DAY BY DAY",
	"Wonder Girls - Nobody (Korean Version)", // 同「我创建·QQ飞车音乐合集哈」
	"略略略 - 鸳鸯戏 (吉他版)", // 可能重复·C(可能同一首)
	"Zella Day - East of Eden",
	"洪真英 - 산다는 건 (Cheer Up)",
	"野菊花 - 걱정말아요 그대 (你不要担心)",
	"螃蟹真疼、DJ野马 - 兰多卡兰多摇 (DJ版)", // 同「我创建·two」
	"王富贵 - 生而平凡", // 可能重复·B(较可能同一首)
	"王富贵 - 生而平凡 (DJ京仔版)",
	"王富贵、R7 - 生而平凡 (DJ版)",
	"虎二 - 窗", // 可能重复·B(较可能同一首)
	"小阿枫 - 我要找到你", // 可能重复·B(较可能同一首)
	"怪阿姨 - 羡慕风羡慕雨",
	"冬日暖阳 - 寻常岁月诗", // 可能重复·B(较可能同一首)
	"张震岳、大渊(顽童MJ116) - 迷途羔羊",
	"方天雷 - 依兰爱情故事",
	"野音 - 海阔天空尾奏 (竹笛纯享版)",
	"四千金 - 打锣打鼓", // 可能重复·B(较可能同一首)
	"에일리 (AILEE) - HEAVEN (Original Version)",
)

// 我创建的歌单·酷狗：
// 默认收藏（921首）
songs.push(
	"陳hwing - 周旋",
	"Vexento - Lonely Dance",
	"小匆匆 - 忘情果 (女声版)",
	"Position Music - Man At Arms (重骑兵)",
	"Dash Berlin、Bo Bruce - Coming Home",
	"T-Pain、Ne-Yo - Turn All the Lights On",
	"Shane 54、Cubicore、Eric Lumiere - Out of Time (Sagan Remix)",
	"Avicii、Rita Ora - Lonely Together",
	"Brand X Music - Helmet to Helmet", // 可能重复·B(较可能同一首)·同「Brand X Music - Helmet to Helmet (头盔挨着头盔)」
	"Danny Olson - Tide",
	"Danny Olson - Sol",
	"Gothic Storm、久升音艺 Gothic Storm Music - Whisper of Hope",
	"BrunuhVille - Spirit of the Wild",
	"Ivan Torrent - Th3 Awak3n1ng",
	"纯音乐 - For An Epic Full",
	"London Music Works - Imagine the Fire",
	"Veigar Margeirsson - Revelations (Trailer Music)",
	"Really Slow Motion、Instrumental Core - Mankind",
	"Veigar Margeirsson - Rise Above",
	"Silver Screen - Remember Us (No Choir Mix)",
	"Liquid Cinema - Skyfire",
	"TheFatRat - Ascendancy",
	"Veigar Margeirsson - Road to Victory",
	"Immediate Music - Victorious",
	"BrunuhVille - Rebirth", // 可能重复·B(较可能同一首)·同「Harry Lightfoot - Rebirth」
	"Fringe Element - Legacy",
	"Jo Blankenburg - Illumielle",
	"Really Slow Motion - Hall of the Gods",
	"Really Slow Motion - Suns and Stars",
	"Future World Music - Passion of Victory",
	"Patryk Scelina - Return of the Heroes",
	"Ivan Torrent - Before I Leave This World",
	"Brian Tyler - Falling Into a Dream",
	"Tyler Bates、Joel J. Richard - Excomunicado",
	"Silver Screen - Water Of Life",
	"Revolt Production Music - Scream Breaker",
	"Aphexeuia - New Life",
	"Crysis - Crysis 3 (New York Memories)",
	"Liquid Cinema - Into The Sun",
	"久升音艺 Silver Screen - Bittersweet",
	"Various Artists - Human Genesis (Main Track｜Full Length)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"久升音艺 Gothic Storm Music - Story Of Life",
	"BrunuhVille - Luna",
	"Fringe Element - Vapor",
	"Danny Olson - Horizon",
	"Hi-Finesse - Andromeda",
	"Liquid Cinema - Eternity",
	"Zack Hemsey - Mind Heist",
	"Twelve Titans Music - From the Ashes Reborn",
	"Capo Productions - Fade Away",
	"Petri Alanko - A Writer's Dream",
	"Jo Blankenburg - Garador's Flight",
	"Tony Anderson、Salomon Ligthelm - Rise (feat. Salomon Ligthelm)",
	"Hi-Finesse - Odyssey",
	"Equilibrium - Mana",
	"Liquid Cinema - Soldier of Fortune",
	"Andreas Waldetoft - Stellaris Suite： Creation and Beyond",
	"Zack Hemsey - See What I've Become",
	"Thomas Bergersen - Remember Me",
	"Veigar Margeirsson - Mythical Hero",
	"Epic Score - You Were Born For This",
	"Jesper Kyd、Fired Earth Music - Empyrean",
	"Really Slow Motion - Legacy",
	"Richard Schrieber - Years and Years",
	"Twisted Jukebox - Angels Will Rise",
	"Nick Murray、Juliet Lyons - Between Oceans",
	"Hi-Finesse - Axis",
	"Various Artists、Corner Stone Cues、Simone Benyacar - Requiem for a Tower Mvt. III (feat. Simone Benyacar)",
	"Two Steps From Hell、Thomas Bergersen - Release Me",
	"Elephant Music - Miracle of Life",
	"Silver Screen、久升音艺 Silver Screen - The Horizon", // 可能重复·B(较可能同一首)·同「Silver Screen、久升音艺 Silver Screen - Beneath The Horizon」
	"川井憲次 - 七剑战歌",
	"Elephant Music - Dawn Of Time",
	"Benjamin Wallfisch、Sir Edward Elgar、Lorne Balfe、Hans Zimmer - End Titles (Dunkirk)",
	"E.S. Posthumus - Nara (Theme to  Cold Case)",
	"久升音艺 Gothic Storm Music - Earth Reborn",
	"川井憲次 - Log off",
	"Epica - Presto (Live in Miskolc)",
	"久升音艺 Gothic Storm Music - Stand And Fight",
	"isgaard - Fold Your Hands And Pray",
	"John Kenza - 300 Violin Orchestra",
	"Can Atilla - 1453 Fetih",
	"Two Steps From Hell、Thomas Bergersen - Clash of Empires (No Choir)",
	"Shire Music - Cello Romaance",
	"Mark Petrie - New Light",
	"Michael Giacchino - Nero Sighted",
	"Epic Score - Blaze of Glory",
	"Two Steps From Hell、Nick Phoenix - Neverdark",
	"Mark Petrie - Ultrasonic",
	"Silver Screen - Hope",
	"Brand X Music - Eventide",
	"SuB Pub Music - Face The World",
	"Marc Streitenfeld、Ben Foster、Metro Voices、Bach Choir、Apollo Voices - Life (From ＂Prometheus＂ Soundtrack)",
	"Immediate Music - One Man's Courage",
	"Really Slow Motion - Burning Rome",
	"Position Music - Satorius (No Choir)",
	"Gareth Coker、Aeralie Brighton - Light of Nibel",
	"Nick Phoenix、Two Steps From Hell - Fall of the Fountain World",
	"Mark Petrie - Kara Kul",
	"Ivan Torrent、Julie Elven - Icarus (feat. Julie Elven)",
	"Silver Screen - Salvation",
	"Ivan Torrent - Human Legacy",
	"Erik Ekholm - Night Hunter",
	"Two Steps From Hell - Winterspell",
	"Audiomachine - Equinox",
	"Sean Paul - Ya Not Ready",
	"Peter Roe、Uyanga Bold - Bushido",
	"Escala - Palladio",
	"Peter Jeremias - Into Greatness",
	"Mark Petrie - New Light No Choir",
	"Hans Zimmer、James Newton Howard - Antrozous",
	"Audiomachine - evolution",
	"Merethe Soltvedt、Two Steps From Hell - Impossible",
	"MythFox - Oriana",
	"BrunuhVille - The Wolf and the Moon",
	"Peter Roe - This Is My World",
	"Mark Petrie - Intimidation",
	"Derek Duke - 英雄集结",
	"Joachim Rygg - Qiu Mansion",
	"Mark Petrie - Adventurous Spirit",
	"Hans Zimmer - What Shall We Die For",
	"Brand X Music - Dogs of War",
	"John Dreamer - End of My Journey",
	"Iliya Zaki - Starlight",
	"Hans Zimmer - Rise", // 可能重复·A(高度相似)·同「John Dreamer - Rise (上升 - 史诗音乐)」
	"World Beyond - The Remnant",
	"Vangelis - Conquest of Paradise",
	"Twelve Titans Music - Dust and Light",
	"Really Slow Motion、Instrumental Core - Other Worlds",
	"Thomas Bergersen - Age of Gods",
	"Liquid Cinema - Aeterna",
	"SuB Pub Music - Warpipes",
	"Vangelis - Titans (From ＂Alexander＂ Soundtrack)",
	"Thomas Bergersen - Rada",
	"Future World Music - Dream Chasers",
	"Daniel Yount - Novera", // 可能重复·B(较可能同一首)·同「Daniel Yount - Novera (诺维拉)」
	"久升音艺 Silver Screen - The Final Battle",
	"Elitsa Alexandrova - Assassin's Creed Rogue Main Theme",
	"Ivan Torrent、Gaby Koss - The Power of Will (feat. Gaby Koss)",
	"Nightwish - Last Of The Wilds (荒野遗孤)(Instrumental)", // 可能重复·B(较可能同一首)·同「Nightwish - Last Of The Wilds (荒野遗孤)」
	"Epic Score - Strength to Believe (No Vocals)",
	"Dirk Leupolz - Illuminate",
	"Shire Music - Epiphany",
	"Daniel Lenz - Epiphany",
	"E.S. Posthumus - Vishnu",
	"Two Steps From Hell、Thomas Bergersen - After The Fall (No Voice)",
	"Jesper Kyd、Fired Earth Music - Aphelion",
	"E.S. Posthumus - Arise",
	"Immediate Music - Dark Side of Power",
	"Hans Zimmer、Lisa Gerrard - The Battle (From ＂Gladiator＂ Soundtrack)",
	"Lorne Balfe、Assassin's Creed - Fight Club",
	"Origen - Conquest of Paradise",
	"Ramin Djawadi - Main Title (From Game of Thrones： Season 4)",
	"Jesper Kyd、Fired Earth Music - Phantasm",
	"John Dreamer - Brotherhood",
	"Epic Soul Factory、Cesc Vilà、Fran Soto - Legendary",
	"Liquid Cinema - Forever",
	"Immediate、Jeffrey Fayman、Yoav Goren - Serenata Immortale",
	"Groove Addicts - Seafights",
	"Peter McIsaac Music - Epic Hollywood Trailer",
	"World Of Warcraft - Arthas, My Son (Cinematic Intro)",
	"Harry Lightfoot - A Hero Will Rise",
	"Epic Score - Our Flame Shall Endure",
	"Ramin Djawadi - Main Titles", // 可能重复·B(较可能同一首)·同「Charlie Clouser - Main Titles」
	"Nick glennie-smith、Harry Gregson-Williams、Hans Zimmer - Rock House Jail",
	"Really Slow Motion - Collapsing Universe",
	"Tom Salta - Final Flight",
	"Demented Sound Mafia - Between Space And Time",
	"DJ OKAWARI - Luv Letter (情书)", // 可能重复·A(高度相似)·同「DJ Okawari - Luv Letter (情书)」
	"Uzier - Independent",
	"乌兰托娅 - 梦高原 (广场舞)", // 可能重复·B(较可能同一首)·同「乌兰托娅 - 梦高原」
	"David Hicken - Ishtar",
	"Wayne Gratz - You'll Never Walk Alone",
	"Roberto Cacciapaglia - Wild Sea",
	"Wayne Gratz - Somewhere In Time",
	"李伟菘 - 我们说好的", // 可能重复·B(较可能同一首)·同「胜屿 - 我们说好的」
	"Fabrizio Paterlini - My Piano, The Clouds",
	"Brian Crain - At the Ivy Gate",
	"Ditrich Klein - New Love",
	"Dominik Andersen - Song for Emily",
	"Denean - Reflections of Life",
	"Yanni - One Man's Dream",
	"David Hicken - Faylinn",
	"Fabrizio Paterlini - Déjà vu", // 可能重复·B(较可能同一首)·同「Dave Rodgers - Déjà Vu」
	"David Nevue - Goodnight Moon",
	"Daydream - Tear",
	"Fiona Joy Hawkins - A Winter Morning",
	"昼夜 - 雨的印记 (钢琴版)",
	"Ludovico Einaudi - Una Mattina", // 可能重复·B(较可能同一首)·同「Ludovico Einaudi - Una Mattina」
	"Dennis Kuo - Winter Story",
	"重塑心灵心理训练中心 - 【睡前放松安眠助眠】Rain",
	"David Nevue - Down By The Sally Gardens",
	"Haneda Ryoko - Remember Me…",
	"Haneda Ryoko - Sad Dial",
	"Kirsten Hanne - Tea Tree",
	"Henry Smith - Perfect",
	"Norris Foster - Essence of Flowers (Part II)",
	"低调的奢华 - Reason (纯音乐版)",
	"Fiona Joy Hawkins - 2nd Movement 'Rain' (雨点 - 第二乐章 “雨”)",
	"Kevin Kern - Out of the Darkness into the Light",
	"Imperium Dekadenz - Waiting", // 可能重复·B(较可能同一首)·同「ＴＲＡ＄Ｈ - WAITING」
	"Capo Productions - Serenity",
	"Jim Brickman - Serenade",
	"全素妍 - 어느 맑은 날",
	"久石让 - Mother",
	"Kevin Kern - Through The Arbor (走过绿意)",
	"Judson Mancebo - You Are Not Alone",
	"Judson Mancebo - Someone Like You (爱人如你)",
	"Tekla Badarzewska - The Maiden's Prayer",
	"纯音乐 - Tears (眼泪)(钢琴)",
	"Richard Clayderman - Souvenirs d'enfance (爱的纪念)",
	"Johann Pachelbel、The Baroque Chamber Orchestra、A Stratta - Pachelbel ＂Canon＂",
	"Bandari - Childhood Memory (童年记忆)",
	"George Winston、纯音乐 - Variations On The Kanon By Pachelbel (帕卡贝尔的卡农变奏曲)",
	"中国国家交响乐团 - 土耳其进行曲",
	"王雨笙 - River Flows In You (钢琴)",
	"小坂明子 - 海の見える街 (看得见海的街道)",
	"磯村由紀子 - 風の住む街 (风居住的街道)", // 可能重复·C(可能同一首)·同「Phounius - 風の住む街 (风居住的街道)(钢琴版)」
	"Green Trail - 莎莉花园",
	"纯音乐 - 绿野仙踪 (钢琴)",
	"纯音乐 - 转场音乐",
	"纯音乐 - Kiss The Rain+初雪+梦中的婚礼",
	"BEYOND - 海阔天空 (钢琴版纯音乐)", // 可能重复·B(较可能同一首)·同「小洲 - 海阔天空」
	"DJ OKAWARI - Flower Dance (花之舞)", // 可能重复·B(较可能同一首)·同「DJ OKAWARI - Flower Dance」
	"胡伟立 - 嬉戏 (纯音乐)",
	"骆集益 - 御剑江湖",
	"Kenny G - Going Home (回家)(Live)",
	"Secret Garden - The Promise",
	"Bandari - Annie's Wonderland (安妮的仙境)",
	"Dexter Britain - Do What You Are Doing",
	"Otokaze - 夏恋",
	"Oturans - DJ Okawari - Flower Dance (钢琴原版)", // 可能重复·B(较可能同一首)·同「DJ OKAWARI - Flower Dance」
	"Richard Clayderman - Matrimonio De Amor (梦中的婚礼)",
	"纯音乐 - 卡农",
	"王雨笙 - 雨的印记 (钢琴)",
	"折戸伸治 - 潮鳴りⅡ",
	"折戸伸治 - 羽根 (鸟之诗)",
	"纯音乐 - Snowdreams (雪之梦)",
	"V.K克 - 琴之翼",
	"Maksim、Nikša Bratoš、Remi Kazinoti、Craig Pruess、Orchestra - Croatian Rhapsody (克罗地亚狂想曲)",
	"赵海洋 - 秋之恋 (钢琴曲)",
	"赵海洋 - 梦中的婚礼",
	"奥戸巴寿 - いつも何度でも (Always with Me)",
	"Yanni - With an Orchid (心兰相随)",
	"海鸣威、吴琼 - 老人与海", // 可能重复·C(可能同一首)·同「老人与海 - 海鸣威」
	"刘惜君 - 我很快乐",
	"李宇春 - 和你一样", // 可能重复·B(较可能同一首)·同「李宇春 - 和你一样」
	"郑秀文 - 眉飞色舞",
	"王力宏 - 改变自己",
	"郭顶 - 我们俩", // 可能重复·B(较可能同一首)·同「郭顶 - 我们俩」
	"后弦 - 娃娃脸",
	"F.I.R.飞儿乐团 - 月牙湾",
	"张敬轩 - 断点",
	"刘力扬 - 礼物",
	"温岚、吴宗宪 - 屋顶",
	"张翰 - 拾忆", // 可能重复·B(较可能同一首)·同「黄飞鸿 - 拾忆」
	"五月天 - 温柔",
	"梁静茹 - 宁夏", // 可能重复·B(较可能同一首)·同「梁静茹 - 宁夏」
	"林俊杰 - 江南", // 可能重复·A(高度相似)
	"动力火车 - 当", // 可能重复·C(可能同一首)·同「动力火车 - 当 (Live)」
	"范晓萱 - 好想谈恋爱",
	"温岚 - 眼泪知道",
	"金海心 - 那么骄傲",
	"S.H.E - Super Star",
	"S.H.E - 恋人未满",
	"Sweety - 樱花草", // 可能重复·B(较可能同一首)·同「黄诗佳 - 樱花草」
	"周笔畅 - 笔记 (Live)", // 可能重复·C(可能同一首)·同「锦江music - 周笔畅《笔记》」
	"张惠妹 - 听海",
	"BOBO - 光荣",
	"侃侃 - 滴答", // 可能重复·B(较可能同一首)·同「侃侃 - 滴答」
	"LVNDSCAPE、Kaptan - Walk Away (feat. Kaptan)",
	"Danny Avila - End Of The Night (Explicit)",
	"Feenixpawl、Jason Forté、Mary Jane Smith - Blue Sky",
	"WillChangeLives - ALONE", // 可能重复·B(较可能同一首)·同「Alan Walker - Alone」
	"Uzier - Trip",
	"Tungevaag - Wicked Wonderland",
	"Mesto、Brielle Von Hugel - Chances (feat. Brielle Von Hugel)",
	"ItaloBrothers - Summer Air",
	"Thimlife、Bibiane Z - Home (E-RoSS Remix Edit)",
	"Feint - My Sunset (我的日落)(Original Mix)",
	"SLANDER、Eric Leva - Superhuman",
	"Alan Walker - Faded", // 可能重复·B(较可能同一首)·同「Alan Walker - Faded」
	"J. Lisk - NYC",
	"Mike Perry、SHY Martin - The Ocean (Radio Edit)",
	"Rameses B、Anna Yvette - Neon Rainbow",
	"Deepside Deejays - Never Be Alone (DJ音浪版)",
	"TLV、MKJ - Time", // 可能重复·C(可能同一首)·同「Cat naps - time」
	"Lost Frequencies - Are You With Me",
	"DEAF KEV - Samurai", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"Sam F、Sophie Rose - Limitless (feat. Sophie Rose)",
	"Martin Jensen - Solo Dance",
	"Dirty Palm、Conor Ross、Andy Jarvis、Chandler Blasé、Chandler Blasé - Flowers (Andy Jarvis Remix)",
	"Deorro、Chris Brown - Five More Hours",
	"Anna Yvette、Jim Yosef - Linked",
	"Gavin DeGraw - Fire",
	"Shane 54、Eric Lumiere、Cubicore - Out of Time (Sagan Remix)",
	"Krewella - Come And Get It (Razihel Remix)",
	"Tyron Hapi、Bianca - Lost Control (feat. Bianca)",
	"Mylène Farmer - Appelle mon numéro (Greg B Remix)",
	"Brooks、GRX - Boomerang (回旋镖)", // 可能重复·B(较可能同一首)·同「Brooks、GRX - Boomerang (回旋镖)」
	"Deorro - Five Hours",
	"Basto - I Miss You", // 可能重复·B(较可能同一首)·同「罗百吉、宝贝 - I Miss You」
	"Stephen C - Outside (Radio Mix Edit)",
	"Thimlife、Bibiane Z - Home (Blaze U Remix Edit)", // 可能重复·A(高度相似)·同「Thimlife、BibianeZ - Home (Blaze U Remix)」
	"Immediate Music - Electric Romeo", // 可能重复·B(较可能同一首)·同「Immediate Music - Electric Romeo」
	"Gavin Henry - Electric Romeo", // 可能重复·B(较可能同一首)·同「Immediate Music - Electric Romeo」
	"Martin Garrix - Animals", // 可能重复·B(较可能同一首)·同「Maroon 5 - Animals」
	"Sam Hunt - Break Up In A Small Town",
	"Allie X、Vicetone - Shadow",
	"Joakim Lundell - Waiting For",
	"Jonas Blue、RAYE - By Your Side",
	"Avicii - Waiting for Love", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"5 Seconds of Summer - Teeth", // 可能重复·B(较可能同一首)·同「5 Seconds of Summer - Teeth」
	"BEAUZ、Michi - Never Over",
	"DJ Fill-In - Beautiful Smile (Original Mix)",
	"HOPE T、接个吻，开一枪 - 锦里",
	"The Score - Legend",
	"K-391 - Summertime (夏日时光)",
	"Loris Cimino、Alice Berg - Shape Of My Regret",
	"Paris Blohm、Nevlin、Romysa - Warriors",
	"Akon - Right Now (Na Na Na)", // 可能重复·B(较可能同一首)·同「Akon - Right Now (Na Na Na) (承利0.8x版)」
	"SLANDER、RIOT - You Don't Even Know Me",
	"Maroon 5 - Animals", // 可能重复·B(较可能同一首)·同「Maroon 5 - Animals」
	"DJ Manian - Odysee",
	"Two Steps From Hell、Thomas Bergersen - Star Sky",
	"Vicetone、Popeska、Luciana - The New Kings",
	"Riot Ten、Rico Act - Rail Breaker (Explicit)",
	"Elektronomia - Sky High",
	"Beatrich - Superstar",
	"Vicetone - PROJECT： Yi (Remix)",
	"Dirty Rush & Gregor Es - Brass (Original Mix)",
	"Loud Luxury - See It Again",
	"Axero - Waves (波浪)(Radio Edit)",
	"陈安排、在忠 - EA7所有人都得si",
	"MMZ-BOY - Yasuo (纯音乐版)", // 可能重复·C(可能同一首)·同「MMZ-BOY - Yasuo(亚索纯音乐版)面对疾风吧！ (亚索)」
	"Sia - Cheap Thrills", // 可能重复·B(较可能同一首)·同「蔡文姬、澜 - Cheap Thrills (二胡版)」
	"Janji - Shadows",
	"Tommee Profitt、Fleurie、Jung Youth - In The End", // 可能重复·B(较可能同一首)·同「Black Veil Brides - In the End」
	"Calvin Harris、Rihanna - This Is What You Came For", // 可能重复·B(较可能同一首)·同「伊清璇 - This Is What You Came For」
	"Zedd、Jon Bellion - Beautiful Now",
	"Mose N、MD DJ - Sweet Sensation",
	"高梨康治 - FAIRY TAIL メインテーマ (妖精的尾巴主题曲)",
	"Remady、Manu-L - L.I.F.E", // 可能重复·B(较可能同一首)·同「Tobu - Life」
	"Hoaprox - Ngẫu Hứng", // 可能重复·B(较可能同一首)·同「Hoaprox - Ngẫu Hứng (DJ虎太郎版)」
	"Zayde Wølf - Heroes",
	"William Joseph - Radioactive",
	"Meizong - Melood",
	"Ahxello - Infinity", // 可能重复·B(较可能同一首)·同「Jaymes Young - Infinity」
	"Ahxello - Frisbee (飞盘)",
	"Uzier - My Heart",
	"Timmy Trumpet、savage - Freaks",
	"小珈婕 - 47、游戏动漫战歌、开黑必备",
	"Fall Out Boy - The Phoenix",
	"Maksim - Croatian Rhapsody (克罗地亚狂想曲)",
	"Noisestorm - Heist",
	"Uzier - Explode",
	"Virtual Riot - Energy Drink", // 可能重复·B(较可能同一首)·同「Virtual Riot - Energy Drink (能量饮料)」
	"Steerner、Martell - Sky (Radio Edit)",
	"JJD、Alex Skrindo - Aurora",
	"布袋寅泰 - BATTLE WITHOUT HONOR OR HUMANITY (SAMURAI MIX)",
	"Dominik Hauser、Klaus Badelt - He's a Pirate (加勒比海盗)", // 可能重复·B(较可能同一首)·同「dylanf - He's a Pirate (加勒比海盗)」
	"Era - The Mass", // 可能重复·B(较可能同一首)·同「Era - The Mass (Surround Sound)」
	"Rihanna、Calvin Harris - We Found Love",
	"X-Ray Dog - Cyberworld", // 可能重复·B(较可能同一首)·同「X-Ray Dog - Hope Always」
	"晚安 - Universe (Remix)", // 可能重复·B(较可能同一首)·同「丢火车乐队 - 晚安」
	"苏打绿 - 小情歌", // 可能重复·B(较可能同一首)·同「苏打绿-我好想你」
	"李一楠 - 逆行的方向 (伴奏)",
	"于冬然 - 故事很短",
	"闭文思 - 我还是", // 可能重复·C(可能同一首)·同「旺仔小乔 - 我还是 (片段)」
	"小蓝背心、杨小頔 - 目及皆是你 (说唱版)",
	"Jimmy音乐经纪 - Because Of You",
	"小眼鑫 - 美丽的神话", // 可能重复·A(高度相似)·同「孙楠、韩红 - 美丽的神话」
	"林俊杰 - 爱不会绝迹", // 可能重复·B(较可能同一首)·同「林俊杰 - 爱不会绝迹」
	"许飞 - 父亲写的散文诗", // 可能重复·A(高度相似)·同「许飞-父亲写的散文诗」
	"宇西、王星贺 - 黄昏", // 可能重复·B(较可能同一首)·同「周传雄 - 黄昏 (Live)」
	"DJ小马丁 - Free Loop", // 可能重复·B(较可能同一首)·同「Free Loop-七元」
	"G-DRAGON - 삐딱하게 (Crooked)",
	"容祖儿 - 挥着翅膀的女孩", // 可能重复·A(高度相似)·同「容祖儿 - 挥着翅膀的女孩」
	"祁念 - 何为伴侣",
	"Estelle - Love Story (抖音热搜版)",
	"Nick Strand、Hoaprox、Mio - With You (Ngẫu Hứng)",
	"王者荣耀同人局 - 百战成诗 (王者荣耀·100英雄群像献礼歌)",
	"邓寓君(等什么君)、奇然、沈谧仁、小时姑娘、张承煜（小魂）、沈新程、棒三狗、Autumn绅、潇梦临、执素兮、糯米Nomi、KenZong、Tacke竹桑、圈同学、根小八、许多葵、Yakuri、申天奇、棕瞳、辰小弦 - 百战成诗2 (燃情版)(全英雄台词)",
	"宋孟君、格子兮 - 王者荣耀", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"老虎欧巴 - 一念神魔 (念白版)",
	"王者荣耀 - 刀山火海之王者荣耀 (DJ版)", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"周林枫 - 澜 (王者荣耀英雄同人曲)",
	"李常超（Lao乾妈）、董真、蔡翊昇、Smile_小千、墨雨晨、NL不分、小坠、谷江山、杜宣达、凑诗、沉鱼会吐泡泡、林清弄、海疼er、T-Tone_小T、裂天、白黎、温崇正、林牧遥、黄麒Eros、韩智愚 - 百战成诗 (5柔情版)(史诗剧情向)",
	"网络歌手 - 2020神曲合集",
	"梨兮 - 奔赴星空", // 可能重复·B(较可能同一首)·同「尹昔眠 - 奔赴星空」
	"唐小力 - 拿着青春陪你赌 (唐春宇歌)",
	"电音任瑶 - 苏喂苏喂take me hand (混音)",
	"袁哲 - 姑娘想嫁人",
	"Gaston庞加斯顿 - Ring Ring Ring (男版)",
	"孟小笛、祁隆 - 啦啦爱",
	"张老板阿 - 干饭人之歌",
	"陈仪桐ACHe - 单身狗之歌 (正常版)",
	"ilem、洛天依、言和、初音ミク、KAITO - 神经病之歌",
	"饭思思 - Swagger", // 可能重复·C(可能同一首)·同「Swagger - Señorita (片段)」
	"Mark Petrie - Go Time (Full Length)(Main Track)",
	"Two Steps From Hell - El Dorado (黄金国)",
	"X-Ray Dog - String Tek", // 可能重复·B(较可能同一首)·同「X-Ray Dog - Hope Always」
	"Audiomachine - Danuvius",
	"Danny McCarthy - silver scrapes (混音)",
	"张杰 - 最美的太阳 (Live)",
	"TFBOYS - 信仰之名",
	"鹿晗 - 超级冠军",
	"张杰 - 着魔",
	"MitiS - Endeavors",
	"Ranger - Don't Play Games (Radio Mix)",
	"Klingande - Pumped Up",
	"2016 Billboard Masters - HandClap - Tribute to Fitz and the Tantrums", // 可能重复·B(较可能同一首)·同「未知歌手 - Hand Clap」
	"Avicii、Martin Garrix、Simon Aldred - Waiting For Love (Live)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"Fort Minor、Styles of Beyond - Remember the Name (feat. Styles of Beyond)(Explicit)", // 可能重复·B(较可能同一首)·同「Fort Minor、Styles of Beyond - Remember The Name (Album Version)」
	"John The Whistler - Wild Wild Web",
	"Simon Viklund - Clean Getaway",
	"Apnea - Tongue",
	"Bon Jovi - It's My Life",
	"大坪直树 - Into the Battlefield",
	"Hans Zimmer - Cornfield Chase (原野追逐)",
	"Nick glennie-smith、Harry Gregson-Williams、Hans Zimmer - Hummell Gets The Rockets",
	"Steve Jablonsky - Arrival to Earth",
	"Various Artists - Champion Select", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"Daft Punk - The Grid (From ＂TRON： Legacy＂／Score)",
	"光宗信吉 - Battle of Rose",
	"澤野弘之、小林未郁 - βίος (生命)",
	"Borislav Slavov - SOS New York",
	"BUMP OF CHICKEN - Hello,world!",
	"南征北战NZBZ - 超越极限",
	"KELUN - CHU-BURA",
	"STEREO DIVE FOUNDATION - Genesis (TV Size)",
	"UNISON SQUARE GARDEN - シュガーソングとビターステップ (方糖歌曲&苦味舞步)",
	"Stereopony - ヒトヒラのハナビラ (一片花瓣)",
	"Aqua Timez - 千の夜をこえて (跨越千夜)",
	"SunSet Swish - マイペース (我行我素)",
	"Fall Out Boy - Immortals (From ＂Big Hero 6＂)", // 可能重复·B(较可能同一首)·同「Fall Out Boy - Immortals」
	"Silent Siren - secret base~君がくれたもの~ (secret base~你给我的所有~)",
	"雨宮天 - Skyreach",
	"WEAVER - くちづけDiamond (亲吻Diamond)",
	"GD X TAEYANG - GOOD BOY",
	"Aimer - Brave Shine",
	"周杰伦 - 三年二班",
	"RADWIMPS - Dream lantern (English ver.)",
	"RADWIMPS - スパークル (火花)(Movie ver.)",
	"RADWIMPS - なんでもないや (没什么大不了)(Movie ver.)",
	"RADWIMPS - 前前前世 (Movie ver.)",
	"RADWIMPS - なんでもないや (没什么大不了)(Movie edit.)",
	"DOMINO - U can do it !",
	"三无Marblue - 病名は愛だった (病名为爱)",
	"R3HAB、Ella Vos - You Don't Know About Me (R3hab Remix)",
	"Deepmaniak - Something Just Like This", // 可能重复·B(较可能同一首)·同「暖豪 - Something Just Like This (Live)」
	"ASIAN KUNG-FU GENERATION - ブラッドサーキュレーター (血压循环)",
	"Queen - We Will Rock You", // 可能重复·A(高度相似)·同「We Will Rock You」
	"Why Mona - Wannabe (Spice Girls Cover)",
	"Nickelback - Get 'Em Up",
	"Three Days Grace - Time of Dying",
	"Fall Out Boy - Alone Together",
	"2 Chainz、Wiz Khalifa - We Own It (Fast & Furious)",
	"Nickelback - When We Stand Together",
	"Muse - Supermassive Black Hole",
	"Sean Householder - The Warrior Song",
	"Bruno Mars - Runaway Baby",
	"Linkin Park - In The End", // 可能重复·B(较可能同一首)·同「Black Veil Brides - In the End」
	"Ed Sheeran - Don't",
	"Joan Jett & the Blackhearts - I Hate Myself for Loving You",
	"OneRepublic - Love Runs Out (Passion Pit Remix)",
	"Fall Out Boy - My Songs Know What You Did in the Dark（Light 'Em Up）",
	"Malcolm Kirby Jr. - Killbane and the Syndicate",
	"White Wall - Serenity Infliction",
	"Really Slow Motion - Adoramous",
	"Henry Jackman - Lemurian Star",
	"Really Slow Motion - Charged",
	"Audiomachine - Rise Of The Planets",
	"小林启树 - ZERO",
	"Adam Skorupa - Assassins Of Kings",
	"Michael McCann - Icarus (Main Theme)",
	"Harry Gregson-Williams - The Equalizer",
	"cliff lin - Pioneers Of The Apocalypse",
	"Two Steps From Hell - Heart of Courage",
	"Zack Hemsey - R.E.F. (Warrior's Lullabye)(纯音乐)",
	"Steve Jablonsky - Skorpinok",
	"战神游戏 - God Of War Iii Overture",
	"Jack Wall - Adrenaline",
	"星际争霸游戏 - Heaven's Devils",
	"Brian Tyler - Call Of Duty： MW3",
	"Ramin Djawadi - Main Title (主题)",
	"Klaus Badelt - He's a Pirate (他是海盗)",
	"P.W.W.画风风 - 迷人的笑脸热歌合集",
	"Scott Bradley - Touche', Pussy Cat!",
	"胡瓜 - 包青天",
	"Johnny Cash - Hurt",
	"花儿乐队 - 穷开心",
	"Really Slow Motion、Instrumental Core - Universe", // 可能重复·B(较可能同一首)·同「丢火车乐队 - 晚安」
	"毛华锋 - 奇迹再现", // 可能重复·B(较可能同一首)·同「毛华锋 - 奇迹再现 (DJ J.C.Zhou版)」
	"Estudio Miami Ritmo - We Will Rock You", // 可能重复·A(高度相似)·同「We Will Rock You」
	"夏一可 - 凉凉 (绝地求生版)",
	"李意卿 - 回首掏 (11秒片段)",
	"澈子 - 最近我被一首giao歌给洗脑了 (19秒片段)",
	"一条小团团ovo - Five hours (41秒live片段)",
	"网络歌手 - 巴啦啦小魔仙 (改编版)",
	"一条小团团ovo - 嘟嘟嘟嘟 (53秒Live片段)",
	"沙雕少年可乐君 - 沙雕之歌 (伴奏)", // 可能重复·B(较可能同一首)·同「沙雕少年可乐君、言和 - 沙雕之歌」
	"07 - 奥利给",
	"澈子 - 蹦沙卡拉卡 (特别版)",
	"六三四 - NARUTO Main Theme",
	"珊爷 - 来是come去是go",
	"梁剩镐 - Wannabe",
	"Brian Hyland - Sealed With A Kiss",
	"ZTAKS - 湛卢",
	"NIVIRO - The Ghost",
	"横山菁児 - ベカサス幻想 (天马座幻想)(インストルメンタル)",
	"dylanf - 遇见萤火",
	"鹰王 - It's Your Birthday (纯音乐)",
	"Yanwei Yang - Pisces (纯音乐)",
	"V.K克 - 蝶梦花雾雨",
	"CMA - You're Not Alone (Original Mix)",
	"Piano-Tiles2 - 落",
	"Otokaze - 彩月 (SaiGetsu -)",
	"Otokaze - 雨道",
	"dylanf - 四月樱花",
	"落落 - 晚安曲",
	"Yiruma - Rue's Lullaby (雨的印记)",
	"Kevin Kern - Sundial Dreams (日晷之梦)",
	"Secret Garden - songs from a secret garden (神秘园之歌)",
	"鲸鱼马戏团 - 冬日之梦",
	"岸炘 - 栀晚鸢乱",
	"张斯函 - 被祝福的精灵",
	"闫东炜 - 初夏与骤雨",
	"闫东炜 - 满夏与距离",
	"闫东炜 - 挽秋与追忆",
	"闫东炜 - 雪落与掌心",
	"闫东炜 - 倒映与星空",
	"闫东炜 - 烟火与告白",
	"闫东炜 - 初秋与七夕",
	"闫东炜 - 遇见与错过",
	"闫东炜 - 简单与初夏",
	"闫东炜 - 简单与秋夜",
	"沈梦逸 - 纯音乐治愈系",
	"Ayasa绚沙 - 告白の夜 (告白之夜)(LIVE!! Ayasa Theater episode 7)",
	"DJ OKAWARI - Perfect Blue",
	"DJ OKAWARI、Emily Styler - Engage Ring",
	"神津裕之 - Luv Letter",
	"陈悦、马克-知足常乐 - 乱红 (笛)",
	"三暮雨 - 烟花再美也不及你",
	"羽肿 - 花火が瞬く夜に (烟花闪烁的夜晚)",
	"落红不是无情物 - 江上清风游",
	"Snigellin - Silent Trace",
	"Iris - Letter (信)",
	"赵海洋 - 微风 (钢琴曲)",
	"曲贺 - 梦中婚礼",
	"VISUAL ARTS、Key Sounds Label - 星屑",
	"四季音色 - 夏夜",
	"Pianoboy高至豪 - Slience Afternoon",
	"张宇桦 - 风中的蒲公英",
	"Pianoboy高至豪 - The Truth That You Leave (你离开的事实)(钢琴版)", // 可能重复·C(可能同一首)·同「Pianoboy高至豪 - The Truth That You Leave (你离开的事实)」
	"羽肿 - 夏に花が散る (夏天花谢了)",
	"四季音色 - 轻风",
	"α波オルゴール - 夏を待つセイル(帆)のように",
	"郭立北 - 解忧曲 (纯音乐)", // 可能重复·C(可能同一首)·同「小班同学 - 解忧曲 (纯音乐版)」
	"Candy_Wind - 和煦的糖果风",
	"和田薫 - 時代を越える想い (穿越时空的思念)(Moscow Recording Ver.)",
	"磯村由紀子 - 草原の涙",
	"Bandari - Snowdreams (雪之梦)",
	"柿島伸次 - Nicol's Piano 涙のテーマ",
	"赵海洋 - A Comme Amour (秋日的私语)(钢琴版)", // 可能重复·C(可能同一首)·同「Richard Clayderman - A Comme Amour (秋日的私语)」
	"陈悦 - 绿野仙踪",
	"K.Williams - 忧伤还是快乐",
	"Yoohsic Roomz - Eutopia",
	"任路加 - 注定",
	"侃侃 - 二小放牛郎",
	"FORMOSA - 天也不懂情",
	"Pianoboy高至豪 - 小幸运 (钢琴版)", // 可能重复·C(可能同一首)·同「田馥甄 - 小幸运」
	"汪峰 - 花火",
	"高梨康治 - 失意",
	"纯音乐 - 哀と愁 (哀与愁)",
	"歌者小梦 - 父与母",
	"郭正正、Zeho傅子豪 - 你的眼睛像星星",
	"郑鱼 - 八小时时差",
	"赵乃吉 - 错都错了",
	"王玉萌 - 荒野",
	"盛婕 - 嘿李兰妈妈",
	"庄心妍 - 两个人的回忆一个人过",
	"经典老歌 - 毛委员和我们在一起",
	"黑鸭子演唱组 - 井冈山上太阳红",
	"张也 - 走进新时代",
	"宋祖英 - 映山红",
	"威仔、夏凌兮 - 触碰不到的痛",
	"华语群星 - 舞蹈：春海 (Live)",
	"萧易同 - 如果你还在",
	"蓝波 - 你到底有没有爱过我",
	"安静 - 红唇",
	"执素兮 - 辞阁去",
	"Frank Klepacki - Hell March 3",
	"金玟岐 - 思美人兮",
	"方晨 - 秘密",
	"华语群星 - 舞蹈：敦煌飞天 (Live)",
	"苏永康 - 爱一个人好难", // 可能重复·B(较可能同一首)·同「白小白 - 爱一个人好难」
	"张宇 - 一言难尽",
	"杨钰莹 - 我不想说",
	"周华健 - 鬼迷心窍", // 可能重复·B(较可能同一首)·同「李宗盛 - 鬼迷心窍」
	"韩磊 - 走四方",
	"欧阳菲菲 - 逝去的爱",
	"刘欢、韦唯 - 亚洲雄风",
	"了了 - 故乡的原风景 (轻音乐)",
	"Kishan - 鬼步舞 (DJ版)",
	"南京外国语学校高三六班 - 北京东路的日子", // 可能重复·B(较可能同一首)·同「华语群星 - 北京东路的日子」
	"任夏 - 谢谢你,曾用心骗过我",
	"Seredris - Daylight (日光)",
	"ALisa、五月的钢琴 - 流行的云 (治愈版)",
	"乐笑笑 - DD旋律 (BGM)",
	"王杰 - 不浪漫罪名",
	"SupreCh、冷志轩 - 平行不交叉",
	"任夏 - 疯了一样想你",
	"晨熙 - 有一种思念叫永远",
	"Uu (刘梦妤) - 那些年", // 可能重复·B(较可能同一首)·同「胡夏 - 那些年」
	"安东阳 - 星月情缘",
	"贺一航 - 一个人的寂寞两个人的错",
	"安儿陈 - 言而无信 (DJ默涵版)",
	"卓依婷 - 精选歌曲串烧",
	"谢军 - 那一夜", // 可能重复·B(较可能同一首)·同「谢军 - 那一夜」
	"队长 - NUNA",
	"Faye 詹雯婷 - 诀爱",
	"Li敖 - 对你说", // 可能重复·B(较可能同一首)·同「半吨兄弟 - 对你说」
	"胜屿 - 你的眼神 (粤语版)",
	"张国荣 - 当年情",
	"在忠 - 热播自嗨 (DJ版)",
	"自信的渐选 - 模仿操",
	"水冰月 - 处处吻 (DJ弹鼓版)(DJ水冰月版)",
	"苏玮 - 百年孤寂",
	"章芮晗 - 久醉风雨情 (DJ晓朋版)",
	"王爱华 - 怎么可以如此冷血 (DJ版)",
	"代刘超 - 泪蛋蛋掉在酒杯杯里",
	"孙艺琪 - 酒醉蝴蝶飞 (DJ伟然版)",
	"任妙音 - 天在下雨我在想你 (DJ何鹏版)",
	"莫斯满、老猫 - 野花香 (DJ何鹏版)",
	"笑天 - 伤心的雪花",
	"余晓清 - 苦了累了听听歌",
	"杭娇 - 留不住的人就别再留 (DJ沈念版)",
	"樊少华 - 爱悠悠情悠悠 (DJ默涵版)",
	"雨中百合 - 谁来渡我 (DJ版)",
	"囚鸟 - 妹妹的牵挂 (DJ晓朋版)", // 可能重复·C(可能同一首)·同「彭羚 - 囚鸟」
	"张健 - 何时拥你入怀中 (DJ何鹏版)",
	"东方红艳 - 梦江南",
	"丹尼·翁 - 舞女泪 (摇滚版)",
	"王菲 - 容易受伤的女人 (DJ梦菲版)",
	"卡卡 - 入了心的人 (DJ尼保版)",
	"哈布尔 - 马兰花",
	"White Cherry - Melancholy", // 可能重复·B(较可能同一首)·同「宋谦泽、明洋 - MELANCHOLY (Remix)」
	"宗次郎 - いつも何度でも (永远同在)",
	"Josh Vietti - Because of You (因你而起)",
	"平生不晚 - 难却", // 可能重复·B(较可能同一首)·同「祥嘞嘞 - 难却」
	"下一分钟 - Shape Of You", // 可能重复·B(较可能同一首)·同「Ed Sheeran - Shape of You」
	"阿辰【搞笑视频】 - 小苹果", // 可能重复·B(较可能同一首)·同「筷子兄弟 - 小苹果 (2015央视非常星发布现场)」
	"雷佳 - 人世间", // 可能重复·B(较可能同一首)·同「《人世间》主题曲」
	"纯音乐 - 铃儿响叮当 (钢琴曲)",
	"北海雄歌 - 友谊地久天长", // 可能重复·B(较可能同一首)·同「王源 - 友谊地久天长」
	"王茗 - 星空剪影",
	"Rauf & Faik - Can't Buy Me Loving (8秒片段)",
	"Rauf & Faik - Вечера (14秒片段)",
	"Rauf & Faik - это ли счастье？ (网友改编)",
	"Rauf & Faik - Вечера (17秒片段)",
	"Rauf & Faik、Dropgun、Kaleena Zanders - это ли счастье？ + Nothing New (27秒片段)",
	"Rauf & Faik - Wonderful (10秒片段)",
	"Rauf & Faik - колыбельная (28秒片段)", // 可能重复·B(较可能同一首)·同「Rauf & Faik - Колыбельная (摇篮曲)(Kolybel'naja)」
	"胡伟立、Rauf & Faik、Zealot周星星 - 嬉戏 + это ли счастье？ + 雨爱 (17秒片段)",
	"Rauf & Faik - это ли счастье？ (16秒片段)",
	"Rauf & Faik - колыбельная (片段)", // 可能重复·B(较可能同一首)·同「Rauf & Faik - Колыбельная (摇篮曲)(Kolybel'naja)」
	"Rauf & Faik - это ли счастье？ (14秒片段)",
	"KickSnareHat、Rauf & Faik - Childhood",
	"Rauf & Faik - время летит",
	"Rauf & Faik、Интакто - THIS GAME",
	"Rauf & Faik - Ошибка (错了)",
	"Rauf & Faik - Бутафория",
	"Rauf & Faik - Там, где мы с тобой (我和你在一起的地方)",
	"Rauf & Faik - она звонила мне",
	"Rauf & Faik - Горит Душа",
	"Rauf & Faik - Agr",
	"Rauf & Faik - Детство (吐语版)",
	"Rauf & Faik - ДРАКОН НА ВОЛЕ",
	"Rauf & Faik - Навсегда",
	"Rauf & Faik - первый поцелуй (初吻)",
	"Rauf & Faik - кусочек пиццы",
	"Rauf & Faik、Джарахов - 17 лет",
	"SAURABMuziK、Rauf & Faik - CAN'T BUY ME LOVING ／ LA LA LA (Slowed + Reverb)",
	"Rauf & Faik - Unesyonnye vetrami",
	"Rauf & Faik - dream about",
	"Rauf & Faik - DELETE",
	"Rauf & Faik - Sluchajnaya lyubov",
	"Rauf & Faik - Gde zhe ty' by'la (你究竟在哪里)",
	"Rauf & Faik - Karnaval",
	"Rauf & Faik - Votsap",
	"Rauf & Faik、Intakto - Samolyot (feat. intakto)",
	"Rauf & Faik - TEAKA",
	"Shami、Rauf & Faik - Запомни I love you",
	"Skander Werzli、Rauf & Faik - Детство (童年)(Perox Edit)",
	"Rauf & Faik - моя (我的)",
	"Rauf & Faik - метро (地铁)",
	"Rauf & Faik - prosto ljubov'",
	"Rauf & Faik、Интакто - Апрель (四月)(Single Version)",
	"Местами Экспонат、Rauf & Faik - Я люблю тебя (我爱你)(feat. Rauf Faik)",
	"Rauf & Faik - Goodbye",
	"Rauf & Faik - Lola",
	"Rauf & Faik、Lyolya - nesutsya chasy' schastlivy'e (feat. lyolya)",
	"SLVG、Rauf & Faik - Вечера ремикс (夜晚)",
	"Rauf & Faik - ugaday gde ja？",
	"Rauf & Faik - den'gi i schast'e",
	"Rauf & Faik - izvini menja",
	"Rauf & Faik - metro",
	"Rauf & Faik - моя звезда (我的星星)",
	"Rauf & Faik - ne tak krasiva",
	"Rauf & Faik - LUV",
	"Rauf & Faik - что такое любовь？ (什么是爱？)",
	"Rauf & Faik - Из-за тебя (因你而起)",
	"Rauf & Faik - Val's",
	"Rauf & Faik - gde solntsa net",
	"Jarico、Rauf & Faik - Детство (童年)(Jarico Remix)",
	"Rauf & Faik - Tam, gde my s toboj",
	"Rauf & Faik - MONEY MONEY",
	"Rauf & Faik - это ли счастье？ (难道这是幸福吗)", // 可能重复·B(较可能同一首)·同「Rauf & Faik - это ли счастье？ (难道这是幸福吗)」
	"Rauf & Faik - zakat i rassvet (晨昏)",
	"Rauf & Faik - Australia",
	"Rauf & Faik - Скандалы (流言)",
	"Rauf & Faik - My Pain My Pain",
	"Rauf & Faik - Rubicon",
	"Niletto、Rauf & Faik - Если тебе будет грустно (如果日后你感到忧伤)",
	"Rauf & Faik - wonderful",
	"MΣ$†ΛMN ΣKCПØNΛ†、Rauf & Faik - Я люблю тебя (我爱你)",
	"李铢衔James、Rauf & Faik - 断线风筝",
	"Rauf & Faik - shkola, berezka",
	"Rauf & Faik - ljubish' i ne ljubish'",
	"Rauf & Faik - колыбельная (摇篮曲)", // 可能重复·B(较可能同一首)·同「Rauf & Faik - Колыбельная (摇篮曲)(Kolybel'naja)」
	"Rauf & Faik - колыбельная", // 可能重复·B(较可能同一首)·同「Rauf & Faik - Колыбельная (摇篮曲)(Kolybel'naja)」
	"Rauf & Faik - Я люблю тебя (我爱你)",
	"任夏、何文宇 - 从陌生到陌生",
	"Carlie Hanson - WYA",
	"刘大壮 - 假装 (吉他版)", // 可能重复·C(可能同一首)·同「陈雪凝 - 假装」
	"ロクデナシ - ただ声一つ (只想说一声)",
	"占二曦 - 生死相随 (民谣版)",
	"半兵卫 - falling again (cover：op)",
	"于文华、尹相杰 - 天不下雨天不刮风天上有太阳",
	"安静纯音 - 土耳其进行曲(贝多芬)",
	"侯莉君 - 莺莺祥月",
	"阿鲲 - 片头音乐",
	"LERZY逸晨 - 栀子花的思念 (加速版 DJ)",
	"PBH、Jack Shizzle、Afishal - Funk You (Original Mix)",
	"13c° - 喜洋洋与灰太狼",
	"Kuricorder Quartet - Imperial March (Darth Vader's Theme)",
	"Crazy Frog - Axel F",
	"OMFG - Hello (你好)",
	"Redstone Records - Monster Crew",
	"今晚打老虎 - UUU (54秒片段)",
	"小抖 - Pajama Party (女声版)",
	"Thomas Greenberg - Curly Wurly",
	"D1ofAquavibe - Monkeybiz",
	"DJ达达达 - DNA正在苏醒 (DJ版) (Remix)",
	"Parov Stelar - Libella Swing",
	"高梨康治 - 旅立ちの序曲 ～OVERTURE：FAIRY TAIL メインテーマ～ (启程的序曲 ~OVERTURE：妖精的尾巴主题曲~)",
	"歌者风度 - 再见了 刺激战场",
	"GMR - FC - 玛丽医生 - BGM",
	"再见、宋瑞、李郝 - 这上头的压迫感",
	"DJ - Savage Love (DJ版片段)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"TAIGA - Middle Of The Night (Original Mix)",
	"鬼畜阿精 - 奥利给 (58秒DJ版片段)",
	"梅朵 - 如果最先遇到的人是我",
	"高进 - 伤心的歌", // 可能重复·B(较可能同一首)·同「高进 - 伤心的歌」
	"刘若英 - 听说", // 可能重复·B(较可能同一首)·同「刘若英 - 听说」
	"承桓 - 我会等 (DJ阿卓、DJ阿龙版)", // 可能重复·B(较可能同一首)·同「承桓 - 我会等」
	"励敏 - 奢望",
	"南征北战NZBZ - 蹦吧蹦吧",
	"张雪峰 - 牛13学校的牛13历史",
	"不想做超人 - 梦醒+爱如潮水Remix+说散就散+感谢你曾来过",
	"Aspyer、Kyle Reynolds、Carly Jay - Chance",
	"The Chainsmokers、Halsey - Closer",
	"我也不太了解她 - One Last Time+珊瑚海",
	"黛嫣 - STAY - The Kid LAROI&Justin Bieber", // 可能重复·B(较可能同一首)·同「The Kid LAROI、Justin Bieber - STAY (Clean)」
	"Daniel Powter - Free Loop", // 可能重复·B(较可能同一首)·同「Free Loop-七元」
	"Elena Johnson - Love Me Like You Do",
	"九幺 - Take a While",
	"李牌牌 - Eminem-Clean Bandit Rather Be Without Me Full Version",
	"kenzie - Breathe (唇釉变速版)",
	"HoaYee$弘一 - I don't wanna see u anymore",
	"孤矢、虞娱 - 月亮之矢",
	"Faded - Wake", // 可能重复·B(较可能同一首)·同「Alan Walker - Faded」
	"Jonasu - Black Magic (Tim Croft Remix)", // 可能重复·B(较可能同一首)·同「Jonasu - Black Magic」
	"翛然 - ITS OKAY NOW (feat. TheReal Lil Kush)(cover： TheReal FatBoi｜TheReal Lil Kush)",
	"suhmeduh - phone kisses",
	"AnDyWuMUSICLAND - Something Just Like This (Megamix)",
	"AD_丐 - Neon Tribe,Katelyn Tarver (Planez Slowed)",
	"Chord Overstreet - Hold On (等一等)",
	"TYSM - Normal No More (Explicit)",
	"暖風 - Drama Free (remix： Maria Lynn｜Steve Reece)(Remix)",
	"小鹿 - This Far (cover： Raven & Kreyn｜Nino Lucarelli｜RudeLies)",
	"Rachel Platten - Shivers",
	"Touliver、SlimV、1DEE - Em Ơi Cứ Vui (feat. 1DEE F & EVY)",
	"抖音樱木 - 大雾四起,遮住了我对你的爱意",
	"Mari Ferrari - U Are the One",
	"Professor Green - In The Shadow Of The Sun",
	"昭爻tsuki - 到此为止",
	"Maroon 5、Big Sean - Maps (Reflex Remix)",
	"Gotye、Kimbra - Somebody That I Used To Know",
	"N.G／Continent.梁英洲 - Stay The Night (remix： Just Kiddin｜Camden Cox)",
	"Rentz - Alone", // 可能重复·B(较可能同一首)·同「Alan Walker - Alone」
	"Justin Bieber - What Do You Mean？",
	"6诗人、酱子 - 每当我 (每当我看到花瓣脱离花蕊慢慢枯萎)",
	"Em Beihold - Numb Little Bug (Piano Version)",
	"ALisa - Take Me Hand", // 可能重复·B(较可能同一首)·同「DAISHI DANCE、Cécile Corbel - Take Me Hand」
	"宋雅璇 - In The Shadow Of The Sun (纯音乐版)",
	"叮咛吖 - Normal no more (Remix)",
	"Kastra - Fool For You",
	"No Hopes、Kinspin - Changes",
	"Don7 - Cure For Me (37秒片段)",
	"EvaDamage - Watch Me Work (remix： 喝酸奶吃盖盖)",
	"宝藏挖掘机 - 《Hands in the Fire》Shake9_：今日好歌已送达 (长音频)",
	"Kelly Clarkson - Catch My Breath", // 可能重复·C(可能同一首)·同「Suprafive、Kelly Clarkson - Catch My Breath (Remix)」
	"DjDell - 我们的歌 (Remix)",
	"夏雨不下鱼 - “别忘了我啊.....” (把回忆拼好给你)",
	"陆左左 - 请你留在我身边",
	"Neja - Jar Of Love 2k20 (Remix)",
	"TFBOYS - 青春修炼手册", // 可能重复·C(可能同一首)·同「TFBOYS - 青春修炼手册 (Live)」
	"精彩康康 - 别再庸人自扰去关心她",
	"音乐神曲 - 本期关键词： 缘分是一道桥 遇南风 梦中月 醉赤壁",
	"爱音乐的涵涵酱 - 全是爱-要不要买菜 (Live)", // 可能重复·A(高度相似)·同「要不要买菜 - 全是爱 (片段)」
	"花千骨__ - 故事分享：谢谢你的出现，让我少等了好多年", // 可能重复·B(较可能同一首)·同「任妙音 - 花千骨」
	"佐助 - 过了很久终于我愿抬头看", // 可能重复·B(较可能同一首)·同「甜甜、宋烨靓 - 过了很久终于我愿抬头看」
	"孟祥龙 - 好心分手 (31秒片段) (Demo)",
	"大籽 - 行星", // 可能重复·B(较可能同一首)·同「大籽 - 行星」
	"王莎莎 - 姐就是女王", // 可能重复·B(较可能同一首)·同「王莎莎 - 姐就是女王」
	"洛天依、言和、③① - 秒速五厘米",
	"赵亦笙 - 你会快乐么", // 可能重复·B(较可能同一首)·同「赵亦笙 - 你会快乐么」
	"凯晓乐 - 你呀你冻我心房 (Perfect Mix)",
	"吴泓君 - 酒醉的探戈",
	"杨坤 - 路灯下的小姑娘",
	"希林娜依高、周九良、姚琛、陈瑶、谭泉、冬冬和37、派小轩、单禹豪 - 365个祝福 (2024中央广播电视总台网络春晚现场)",
	"巴扎黑 - 春风何时来", // 可能重复·A(高度相似)·同「春风何时来」
	"任夏 - 想你的时候",
	"小越女 - 我想牵你手",
	"BGM供货商 - 通往胜利 (钢琴版)",
	"王玖 - 我熬夜在凌晨三点",
	"纱琉璃Shelley - 我的一个道姑朋友",
	"麻园诗人 - 晚安", // 可能重复·B(较可能同一首)·同「丢火车乐队 - 晚安」
	"Uu (刘梦妤) - 小城小爱",
	"喜笑小宝 - 小宝：我的舞姿可以征服你么？ #搞笑 #宋小宝 #原创剪辑 小助手",
	"MC颖三儿、蔚蓝 - 百家姓",
	"黄飞鸿 - 拾忆", // 可能重复·B(较可能同一首)·同「黄飞鸿 - 拾忆」
	"江涛 - 生日礼物",
	"慕寒、糖瓷 - 述岚记", // 可能重复·B(较可能同一首)·同「慕寒、糖瓷 - 述岚记」
	"万茜、音频怪物 - 为你成全",
	"孙楠 - 为江山", // 可能重复·B(较可能同一首)·同「孙楠 - 为江山」
	"赵雷 - 我们的时光 (2018 2495巡回演唱会成都站)",
	"樱花祭 - 想想念念 (超甜版)",
	"姜鹏Calm - 笑 (长音频)",
	"韩可可 - 一想到你就会哭",
	"秋裤大叔 - 一晃就老了 (DJ何鹏版)", // 可能重复·B(较可能同一首)·同「秋裤大叔 - 一晃就老了」
	"CO1 - 一样的月光 (0.8x版)", // 可能重复·C(可能同一首)·同「CO1 - 一样的月光 (0.8x版)」
	"奈禾乔 - 伊格赛听-谪仙 (DJR7版)", // 可能重复·B(较可能同一首)·同「GTRS - 伊格赛听-谪仙 (DJR7版)」
	"刘美麟 - 因为是爱", // 可能重复·B(较可能同一首)·同「刘美麟 - 因为是爱」
	"葛雨晴 - 夜车", // 可能重复·B(较可能同一首)·同「葛雨晴 - 夜车」
	"小徐酱 - 自我感动都是病态",
	"dirt party - 337am",
	"稳弟 - 稳弟� 「热播咚鼓」我想你是爱我的 我猜你也舍不得",
	"刘臣铭 - 比起以前我更喜欢现在的自己",
	"龚玥 - 花好月圆",
	"陈星、松青 - 该是回家的时候",
	"陆树铭 - 一壶老酒2019", // 可能重复·B(较可能同一首)·同「陆树铭 - 一壶老酒」
	"韩磊 - 好男儿",
	"蒋大为 - 十五的月亮",
	"陈星 - 父亲", // 可能重复·B(较可能同一首)·同「刘和刚 - 父亲」
	"容中尔甲 - 美丽的姑娘",
	"屠洪刚 - 凡人歌 (Live)",
	"王红涛 - 妈妈的吻", // 可能重复·B(较可能同一首)·同「李玲玉 - 妈妈的吻」
	"高胜美 - 车站",
	"凤飞飞 - 月朦胧鸟朦胧",
	"乌兰图雅 - 青春舞曲", // 可能重复·B(较可能同一首)·同「王洛宾、李毓敏 - 青春舞曲」
	"费玉清 - 涛声依旧",
	"孙晓磊 - 最贵是健康",
	"李谷一 - 知音",
	"郑智化 - 小草", // 可能重复·B(较可能同一首)·同「杨烁 - 小草」
	"罗大佑 - 之乎者也",
	"谢东 - 中华民谣",
	"刘欢 - 糊涂的爱",
	"毛阿敏 - 奉献", // 可能重复·B(较可能同一首)·同「苏芮 - 奉献」
	"迟志强 - 愁啊愁",
	"迟志强 - 钞票",
	"曾熙杰 - 可是啊总有那风吹不散的认真",
	"梁静茹 - 勇气", // 可能重复·B(较可能同一首)·同「梁静茹 - 勇气」
	"唐磊 - 丁香花", // 可能重复·B(较可能同一首)·同「唐磊 - 丁香花」
	"张杰 - 他不懂", // 可能重复·A(高度相似)·同「张杰-他不懂」
	"张学友 - 烦恼歌",
	"轩东 - 碎银几两",
	"王睿卓、Damn5z - 重生之我在异乡为异客",
	"姜姜 - 一笑江湖", // 可能重复·B(较可能同一首)·同「闻人听書_ - 一笑江湖」
	"蔡健雅 - 越来越不懂", // 可能重复·A(高度相似)·同「越来越不懂-蔡健雅」
	"吴静 - 女儿情", // 可能重复·B(较可能同一首)·同「吴静 - 女儿情」
	"许嵩、何曼婷 - 素颜", // 可能重复·A(高度相似)·同「素颜--许嵩&何曼婷」
	"克里、南乔 - 穿越之小小的一片云",
	"邵帅 - 你是人间四月天", // 可能重复·B(较可能同一首)·同「小沈阳、邵帅 - 你是人间四月天 (Live)」
	"邓丽君 - 我只在乎你", // 可能重复·B(较可能同一首)·同「小阿枫 - 我只在乎你」
	"罗大佑 - 童年", // 可能重复·B(较可能同一首)·同「罗大佑 - 童年」
	"鞠文娴 - BINGBIAN病变 (女声版)",
	"窝窝 - 远山少年", // 可能重复·A(高度相似)·同「远山少年」
	"老狼 - 同桌的你", // 可能重复·B(较可能同一首)·同「老狼 - 同桌的你」
	"筷子兄弟 - 老男孩", // 可能重复·A(高度相似)·同「筷子兄弟 - 老男孩 (Live)」
	"全幺九 - 这一别山高路长",
	"王强 - 秋天不回来", // 可能重复·B(较可能同一首)·同「王强 - 秋天不回来」
	"刘若英 - 后来", // 可能重复·B(较可能同一首)·同「刘若英 - 后来」
	"刘刚（旭日阳刚） - 怀念青春", // 可能重复·B(较可能同一首)·同「小洲 - 怀念青春」
	"许嵩 - 玫瑰花的葬礼",
	"任素汐 - 胡广生 (我欠你啥子嘛)", // 可能重复·B(较可能同一首)·同「任素汐 - 胡广生」
	"孙燕姿 - 遇见", // 可能重复·B(较可能同一首)·同「孙燕姿 - 遇见 (DJ版)」
	"王铮亮 - 时间都去哪儿了",
	"成龙、金喜善 - 美丽的神话", // 可能重复·A(高度相似)·同「孙楠、韩红 - 美丽的神话」
	"Diary - 相许 (纯享)",
	"黄凯芹 - 焚情", // 可能重复·A(高度相似)·同「焚情-黄凯芹」
	"米特 - 星空下的我们",
	"羊羊 - 用情", // 可能重复·A(高度相似)·同「用情」
	"七元 - 你走", // 可能重复·B(较可能同一首)·同「松紧先生 李宗锦 - 你走」
	"陈墨一（吖毛） - 回不去的何止时间", // 可能重复·B(较可能同一首)·同「陈墨一（吖毛） - 回不去的何止时间 (网友改编)」
	"王睿卓 - 重生之我在异乡为异客 (纯享版)",
	"番番、韩圣 - 芦苇飞 (说唱版)",
	"姜姜 - 风催雨",
	"窝窝 - 月亮照山川",
)

// 王者荣耀音乐合集（220首）
songs.push(
	"王者荣耀 - 见影", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 铸镜", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"G.E.M.邓紫棋 - 无双的王者",
	"Matthew Carl Earl - 梦奇 Monki! (配乐完整版)",
	"刘冬、赵聪 - 赤焰之缨",
	"王者荣耀、无限王者团 - 千灯之约",
	"王者荣耀 - 王者冰刃", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"纯音乐 - 王者归歌", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"无限王者团、王者荣耀 - 与梦同行",
	"Thomas Parisch、Miles Hankins - 王者战歌", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Neal Acree - 王者出征",
	"华语群星、王者荣耀 - 永远的长安城",
	"王者荣耀 - 王者雪魄", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Hans Zimmer - Let's Play Again",
	"Hans Zimmer - Main Theme",
	"王者小宝茶 - 阿离跳惊鸿舞完整版 #小宝茶 #王者荣耀 小助手",
	"王者荣耀 - 赵云·奚琴神-五虎上将", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 关羽·尺八神-五虎上将", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 黄忠·芦笙神-五虎上将", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 梦奇 Monki!", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"无限王者团、王者荣耀 - 长相思",
	"Hans Zimmer - 荣耀主题",
	"王者荣耀 - 马超·琵琶神-五虎上将", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 张飞·筚篥神-五虎上将", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 繁星追梦 (王者荣耀梦想主题曲15秒预热版)", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 风沙铸铁血，霸道即行路", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 桃枝誓义盟，侠气济河山", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 云雾散尽日，长帆济海时", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 匹配成功Oh Yeah!", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 匹配成功DengDeng!", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 匹配成功Summer", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 山林之子", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 铁戈练兵", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 河山长寂", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 为你而战 (抒情版)", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 生万物", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"曾怡 - 启三垣",
	"曾怡 - 伫千岭",
	"曾怡 - 御百川",
	"王者荣耀 - 荣耀之忆", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 珠玑", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 正确战术歌", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 魔道学-幻境重重", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 机关术-那个男人的实验室", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 武道学-第一名天才学子终于开窍", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 梦演序曲", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Jason Walsh - 五五狂欢2019",
	"Bradan Dotson、Matthew Carl Earl - 未失之明",
	"Michael Bross - Strolling in a Dream",
	"Michael Bross - 骇客与战警",
	"Marcin Przybylowicz - 楚汉之地",
	"Matthew Carl Earl - 战车意志",
	"Matthew Carl Earl - 寂灭之心",
	"Edwin Wendler - 荣耀之路",
	"Jeff Broadbent - 失败",
	"Neal Acree - 破魔箭",
	"Jeff Broadbent - 胜利",
	"Zhao hongfei - 远方的丛林",
	"Matthew Carl Earl - 激战边境",
	"陈牧耶 - 有你才有团",
	"Matthew Carl Earl - 云中漠地",
	"Thomas Parisch - 战斗永不停歇",
	"王者荣耀、Matthew Carl Earl - 五五狂欢 (无贝斯 伴奏)",
	"华语群星、王者荣耀 - 大漠黄沙",
	"华语群星、王者荣耀 - 备战",
	"Matthew Carl Earl - 海之都",
	"华语群星、王者荣耀 - 筑城者",
	"华语群星、王者荣耀 - 五五狂欢",
	"华语群星、王者荣耀 - I am two years old",
	"卿语忱、九亨 - 妖焱",
	"张璟 - 鲨刃",
	"王者荣耀 - 热夏Summer登录背景音效", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 牧山者说", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 如梦令", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"无限王者团、王者荣耀 - No Matter What (纯音乐)",
	"无限王者团、王者荣耀 - 王者意志 (纯音乐)",
	"王者荣耀 - 沉鱼之美", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Michael Bross - 荣耀召唤",
	"Matthew Carl Earl - 王者登陆",
	"Brian D'oliveira - 惊鸿之笔",
	"Michael Bross - 梦境游乐园",
	"Michael Bross - 筑城者",
	"Hans Zimmer - 鏖战",
	"Matthew Carl Earl - 五五狂欢",
	"Michael Bross - 我两岁了！",
	"原田萌喜(Moeki Harada)、Moeki Harada - 无间傀儡",
	"Matthew Carl Earl - 天元之弈", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"华语群星、王者荣耀 - 长城群像",
	"华语群星、王者荣耀 - 一触即发",
	"陈牧耶 - 王者同行 (流行版)",
	"王者荣耀 - 圣诞之战-Christmas Battle", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"田汨 - 风驰",
	"王者荣耀 - 雨润", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 破晓之影", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"刘冬 - 山林奇缘",
	"刘冬 - 浑天",
	"刘冬 - 炽烈之击",
	"王者荣耀 - 萧索孤枪", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 冷晖上将", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 集合,准备团战 Assemble", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 制霸峡谷 Command The Valley", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Joshua R. Mosley - 非谎之话",
	"Matthew Carl Earl - 祥瑞录",
	"Neal Acree - 王者备战",
	"原田萌喜(Moeki Harada) - 谋世之战",
	"Hans Zimmer - 巨型生物",
	"Michael Bross - 造物主", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Neal Acree - 长城群像",
	"华语群星、王者荣耀 - 战车意志",
	"王者荣耀 - 天元之弈", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 归隐", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"赵鸿飞 - Relic",
	"赵鸿飞 - Forest",
	"Duncan Watt - Volcano",
	"王者荣耀 - 峡谷探秘", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 万甲赴征", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"无限王者团、王者荣耀 - Thank U For (纯音乐)",
	"王者荣耀 - 碧翎之影", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Matthew Carl Earl - 荣耀召唤 (Remix)",
	"Joshua R. Mosley - 目光中的神",
	"水谷広実 - 峡谷重逢",
	"Thomas Parisch - 王者雪魄", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Marcin Przybylowicz - 长城守卫军",
	"Jeff Broadbent - 喜迎新春",
	"华语群星、王者荣耀 - 浪一夏",
	"陈牧耶 - 王者同行 (动漫版)",
	"Duncan Watt - Desert",
	"Jeff Broadbent - The Back Ground Story",
	"lbg - 燔八荒",
	"无限王者团、王者荣耀 - 迎难而上 (纯音乐)",
	"王者荣耀 - 沉鱼", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 云霓雀翎 Peacock Open", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 大战在即 Prepare to Battle", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Studio DOMA - 新十面埋伏 斗龙",
	"水谷広実 - 有团有聚",
	"Neal Acree - 王者诸将",
	"Jason Walsh - 圣诞之战", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Jeff Broadbent - 英雄归来",
	"Thomas Parisch、Miles Hankins、Midget Mane - 王者战歌", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Jason Walsh - 冠军杯",
	"Dan Martinez - 夏日狂欢",
	"王者荣耀 - 造物主", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Jeff Broadbent - Our Hero Is Back",
	"刘冬 - 启蛰",
	"曾怡 - 神鹿谣",
	"无限王者团、王者荣耀 - Wake Me Up (纯音乐)",
	"高橋哲也 - 志竞巅峰",
	"Matthew Carl Earl - 六合虎拳", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Jeff Broadbent - Summoner",
	"张璟 - 新生",
	"水谷広実 - 该我上场",
	"Howard Shore - 永远的长安城",
	"Jason Walsh - 入世",
	"Hans Zimmer - Big Creature",
	"王者荣耀 - 原初之息", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 强者振国", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Hans Zimmer - 再战",
	"华语群星、王者荣耀 - 无间傀儡",
	"华语群星、王者荣耀 - 心灵骇客",
	"张璟 - 幻梦之森",
	"刘冬 - 思年",
	"Jeff Broadbent - 主宰战场",
	"华语群星、王者荣耀 - 入世",
	"Hans Zimmer - First War",
	"刘冬、LEI - 天鹅之梦",
	"王者荣耀 - 雷动", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 记忆碎片", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"刘冬 - 雷霆",
	"Hans Zimmer - Second War",
	"lbg - 雪归",
	"阿云嘎、王者荣耀 - 桃源",
	"李宇春、王者荣耀 - 木兰",
	"刘冬 - 守春",
	"王者荣耀 - Time Reflection", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 王者无惧Beyond Higher", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 总决赛主题音乐 新十面埋伏 斗龙", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"张璟 - 入梦之灵",
	"胡彦斌、王者荣耀 - 争霸",
	"华语群星、王者荣耀 - 霓裳风华",
	"王者荣耀 - 热夏Summer", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"N2V - 天狼绘梦者",
	"韩红、王者荣耀 - 遇见飞天",
	"王者荣耀 - 不夜长安", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"无限王者团、王者荣耀 - Thank U For",
	"王者荣耀 - 盛世华章", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀 - 电玩小子", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"Thomas Parisch、Miles Hankins - 王者归歌", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"无限王者团、王者荣耀 - 王者意志",
	"无限王者团、王者荣耀 - No Matter What",
	"无限王者团、王者荣耀 - 千灯之约 (欢聚版)",
	"无限王者团、王者荣耀 - Forever",
	"汪苏泷、王者荣耀 - 圣殿骑士",
	"五月天、王者荣耀 - I Will Carry You",
	"王者荣耀 - 王者归歌", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"无限王者团、王者荣耀 - 迎难而上",
	"无限王者团、王者荣耀 - I WON'T STOP",
	"Thomas Parisch - 王者冰刃", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀、余佳运、张钰琪 - 致命危险",
	"张靓颖、王者荣耀 - 幻纱之灵",
	"双笙 (陈元汐) - 月桂之舞",
	"无限王者团、王者荣耀 - 跨越时空走向你 (Walking To U)",
	"无限王者团、王者荣耀 - Wake Me Up",
	"王者荣耀 - 新的回忆·蝶恋", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"宋茜、无限王者团、王者荣耀 - 镜城",
	"陈雪凝、王者荣耀 - 王昭君",
	"周深、王者荣耀 - 微光海洋",
	"张杰、王者荣耀 - 为你而战",
	"王者荣耀 - 王者战歌", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王者荣耀同人局 - 百战成诗 (2020王者共创·荣耀盛典102古风唱将献礼)(现场版)",
	"蔡鹤峰、张千羽 - 音你心动",
	"王者荣耀、毛不易 - 项羽虞姬",
	"王者荣耀、KI：Theory - Evolve (淬炼)",
	"王英涛 - 东方曜完整版台词",
	"周森 - 五虎上将赵云超燃语录",
	"李少白 - 王者荣耀骚白",
	"任宇翔 - 王者荣耀稳住别浪 (鬼畜版)",
	"Various Artists - Samurai", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"枫总、在忠 - 超燃王者 (DJ版)",
	"王者荣耀 - 六合虎拳", // 可能重复·B(较可能同一首)·同「ZheShow - 王者荣耀」
	"王铭基、刘晔 - 孤海", // 可能重复·B(较可能同一首)·同「王铭基、刘晔 - 孤海」
)

// 和平精英音乐合集（242首）
songs.push(
	"Zac Zinger、和平精英 - 轻松上场",
	"和平精英 - 和平使命",
	"和平精英 - 只为胜利",
	"和平精英 - 勇夺冠军",
	"和平精英 - 完美开局",
	"和平精英 - 初火先锋 (初火艺术家联盟概念曲)",
	"和平精英 - 浮空祈愿",
	"和平精英 - War is On(大战在即)",
	"和平精英 - Battle for Peace(精英之战)",
	"和平精英 - 赛博纪元",
	"和平精英 - 神经漫游",
	"和平精英 - 万桨破浪 (端午节龙舟活动音乐)",
	"和平精英 - 固若金汤",
	"和平精英 - 星之信仰",
	"和平精英、Austin Wintory - Fearless (燃情一战)",
	"和平精英 - 废墟之星",
	"和平精英 - 野境幽灵",
	"和平精英 - 你好，杰克",
	"和平精英 - 千帆竞渡 (端午节龙舟活动音乐)",
	"和平精英 - 沙漠绿洲",
	"和平精英 - 电音嘉年华 (717空投节大厅音乐)",
	"和平精英 - 军备团竞",
	"和平精英 - 百舸争流 (端午节龙舟活动音乐)",
	"和平精英 - 无畏险境 (海岛2.0大厅音乐)",
	"和平精英 - 烈焰攻防",
	"和平精英 - 极限追猎",
	"和平精英 - 唯愿和平",
	"和平精英 - 雀跃的心",
	"周峻辉、和平精英 - 再战征程",
	"Brian Tyler、和平精英 - Battle for Peace",
	"Beatrich - Flashback",
	"张艺兴、声在中国 - 不屈的信仰",
	"张紫宁、和平精英 - Fight For Love",
	"MiMi李紫婷、和平精英 - 还是遇到你",
	"乃万NINEONE - 绝对零度",
	"逃跑计划、和平精英 - 过去中寻找未来",
	"袁娅维TIA RAY - 勇气", // 可能重复·B(较可能同一首)·同「梁静茹 - 勇气」
	"Alan Walker、Sabrina Carpenter、Farruko - On My Way (Explicit)",
	"火箭少女101、和平精英 - On Fire",
	"硬糖少女303、和平精英 - 集合时刻",
	"艾福杰尼、和平精英 - Winner Ready",
	"吴宣仪、和平精英 - Let's Party",
	"Alan Walker、A$AP Rocky、Kameron - Live Fast (PUBGM)",
	"华晨宇、和平精英 - 飞行指挥家",
	"山岡晃、和平精英 - 和平精英Mini14枪语 (枪声版)",
	"山岡晃、和平精英 - 和平精英M416枪语 (枪声版)",
	"山岡晃、和平精英 - 和平精英S686枪语 (枪声版)",
	"山岡晃、和平精英 - 和平精英Pan枪语 (枪声版)",
	"山岡晃、和平精英 - 和平精英Micro UZI枪语 (枪声版)",
	"山岡晃、和平精英 - 和平精英Kar98K枪语 (枪声版)",
	"山岡晃、和平精英 - 和平精英AKM枪语 (枪声版)",
	"山岡晃、和平精英 - 和平精英Mini14枪语 (演奏版)",
	"山岡晃、和平精英 - 和平精英M416枪语 (演奏版)",
	"山岡晃、和平精英 - 和平精英S686枪语 (演奏版)",
	"山岡晃、和平精英 - 和平精英Pan枪语 (演奏版)",
	"山岡晃、和平精英 - 和平精英Micro UZI枪语 (演奏版)",
	"山岡晃、和平精英 - 和平精英Kar98K枪语 (演奏版)",
	"山岡晃、和平精英 - 和平精英AKM枪语 (演奏版)",
	"声在中国、张帅、和平精英 - 不屈的信仰 (纯音乐)",
	"和平精英 - 集合!一周年",
	"和平精英 - 蛋糕庆生",
	"和平精英 - 蝶舞迷情",
	"陈雨佳、祈雨 - 甜蜜信号",
	"和平精英 - 浪漫气球",
	"和平精英 - 元宵大作战",
	"和平精英 - 团圆佳节",
	"和平精英 - 愿望常青",
	"和平精英 - 烟花绽放",
	"和平精英 - 阖家欢聚",
	"和平精英 - 新春集结",
	"和平精英 - 海岛迎春",
	"和平精英 - 烟火盛宴",
	"和平精英 - 化装舞会",
	"和平精英 - 魔鬼纵队",
	"和平精英 - 午夜游乐场",
	"和平精英 - 海岛花月夜",
	"和平精英 - 暗夜危机",
	"和平精英 - 战后小憩",
	"和平精英 - 黎明出征",
	"和平精英 - 轻松上场",
	"和平精英 - 缠斗不休",
	"和平精英 - 再战征程",
	"Pitbull、IAmChino、Papayo - Se La Vi",
	"Beatrich - Priceless",
	"Pitbull、Yomil y El Dany - Winning",
	"TheFatRat - Time Lapse",
	"Thimlife、Bibiane Z - Home (Radio Edit)",
	"七音盒 - 和平精英",
	"潮音老李 - 和平精英98k",
	"嗓音男王 - 刺激战场迎来和平精英",
	"声在中国、张帅、和平精英 - 不屈的信仰",
	"Alan Walker、A$AP Rocky、Kameron - Live Fast (Remix)",
	"张伟林、和平精英 - 和平使命",
	"盘尼西林乐队 - 夏日之星",
	"Obadiah Brown-Beach、和平精英 - 完美开局",
	"Joel Adams - Please Don't Go",
	"Bon Jovi - Last Man Standing",
	"Lady Gaga - Poker Face", // 可能重复·B(较可能同一首)·同「Lady Gaga - Poker Face (Makkur Remix)」
	"Mark Petrie - Go Time (Full Length)(Main Track)",
	"王朝 - 神之将至",
	"曹蜀 - 神河传奇",
	"纯音乐 - 雄兵连2",
	"Two Steps From Hell、Thomas Bergersen - Star Sky",
	"Agent 51、Simon Dine、Paul John Weller - Aim High (Explicit)",
	"Alessia Cara - Scars To Your Beautiful",
	"Inon Zur、和平精英 - 你好,杰克",
	"Matthew Carl Earl、和平精英 - 魔鬼纵队",
	"Thomas Parisch、和平精英 - 战后小憩",
	"Inon Zur、和平精英 - 午夜游乐场",
	"Inon Zur、和平精英 - 黎明出征",
	"Laurent Ziliani、和平精英 - 雀跃的心",
	"MitiS - Give My Regards",
	"周峻辉、和平精英 - 只为胜利",
	"Max Philipson、和平精英 - 化装舞会",
	"Matthew Carl Earl、和平精英 - 废墟之星",
	"Obadiah Brown-Beach、和平精英 - 缠斗不休",
	"腾讯光子工作室群 - 绝地求生：刺激战场宣传片音乐",
	"Zac Zinger、和平精英 - 海岛花月夜",
	"Laurent Ziliani、和平精英 - 唯愿和平",
	"Laurent Ziliani、和平精英 - 野境幽灵",
	"NaOH - 和平精英",
	"Mark.kevin - Playerunknown's battlegrounds",
	"MARUV、BOOSIN - Drunk Groove (Edit｜Explicit)",
	"攀娘、扎哥 - DJ英文极品电音舞曲",
	"White Cherry - Melancholy (忧郁)", // 可能重复·B(较可能同一首)·同「宋谦泽、明洋 - MELANCHOLY (Remix)」
	"和平精英枪响 - Monsters (10秒片段)",
	"Rameses B、Anna Yvette - Neon Rainbow",
	"Jin - Jin (Edit)",
	"Lightscape - Collapsing World (崩溃的世界)(Original Mix)",
	"Hillsong Young & Free - Wake (2013 We Are Young & Free现场)",
	"盱眙后生、秋御辰、电音老明 - Leaving", // 可能重复·C(可能同一首)·同「Muzikfabrik、Anatoliy Frolov - Leaving (DJ版片段)」
	"Ava Max - Salt (Remix)", // 可能重复·B(较可能同一首)·同「未知歌手 - Salt (DJ版)」
	"网络歌手 - Love is Gone", // 可能重复·B(较可能同一首)·同「刘家纬、272 - Love Is Gone」
	"祁念 - 春娇与志明 (钢琴版)", // 可能重复·B(较可能同一首)·同「欧阳耀莹、街道办GDC - 春娇与志明 (DJ版)」
	"陈一彤 - My Cookie Can (甜版)",
	"白鲨JAWS - Dive Back In Time",
	"周深 - 起风了", // 可能重复·B(较可能同一首)·同「买辣椒也用券 - 起风了」
	"纯音乐 - YOU (枪声版)", // 可能重复·B(较可能同一首)·同「Approaching Nirvana - You」
	"苏思雨 - Walk Thru Fire (枪声版)",
	"很美味 - lemon tree (片段)", // 可能重复·A(高度相似)·同「Lemon Tree - Fool's Garden」
	"不是花火呀 - 花海 (26秒片段)",
	"刘云喆 - Nevada (DJ枪声版)",
	"Approaching Nirvana - You (DJ版)", // 可能重复·B(较可能同一首)·同「Approaching Nirvana - You」
	"Dance Music Decade - All Falls Down", // 可能重复·B(较可能同一首)·同「Alan Walker、Noah Cyrus、Digital Farm Animals、Juliander - All Falls Down」
	"Alec Benjamin、Alessia Cara - Let Me Down Slowly", // 可能重复·B(较可能同一首)·同「Alec Benjamin - Let Me Down Slowly」
	"蒋先生、蔺君言 - 背对背拥抱 (Remix)", // 可能重复·A(高度相似)
	"火羊瞌睡了 - Love story (Live)", // 可能重复·B(较可能同一首)·同「Taylor Swift - Love Story」
	"郑鱼 - 怎叹 (DJ沈念版)",
	"Alec Benjamin - Let Me Down Slowly", // 可能重复·B(较可能同一首)·同「Alec Benjamin - Let Me Down Slowly」
	"刘诺然 - 陪你看星星 (青春版)",
	"AZNE - Fractures (AZNE Remix)",
	"Madnap、Pauline Herr - Slow Down", // 可能重复·B(较可能同一首)·同「Slow down. - 江南 (0.8x)」
	"陆逸杰 - 你的降临",
	"Various Artists - Rompasso-Angetenar (Club Mix｜Uzller remix)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"Noisestorm - Heist",
	"Raim & Artur、Adil、Artur、RaiM - Simpa",
	"Where It's ATT、Isaac Attard、Daniel Attard - Midnight (Radio Edit｜Explicit)",
	"徐梦圆 - ninelie (Easylistening)",
	"Adieu - Holy Grail (Adieu Remix)",
	"苏白睡醒啦 - Lil Mama (23秒Live片段)",
	"MC七羽 - 口哨战歌,摇头必备 (原创)",
	"The Script、will.i.am - Hall of Fame",
	"Maga - Notorious",
	"еяхат музыка - Twisted (Original Mix)", // 可能重复·B(较可能同一首)·同「艺宝音乐、子芮吖、浩浩 - Twisted (DJ版)」
	"搬运工 - EA7上头了么 (DJ完整版)",
	"乐笑笑 - You (枪声版)", // 可能重复·B(较可能同一首)·同「Approaching Nirvana - You」
	"Jeffrey董又霖、和平精英 - 无限惊喜",
	"和平精英 - 精英荣誉 (联赛殿堂背景音乐)",
	"和平精英 - 庆生巡游 (二周年庆生巴士背景音乐)",
	"和平精英、Obadiah Brown-Beach - 初火先锋 (初火艺术家联盟概念曲)",
	"和平精英、武震 - 青龙腾跃 (青龙祭坛背景音乐)",
	"和平精英、Mason Lieberman - 玄武出海 (玄武祭坛背景音乐)",
	"和平精英、Mason Lieberman - 斗趣乐园 (特训岛大乱斗背景音乐)",
	"和平精英、Mason Lieberman - 极限狂奔 (特训岛赛车背景音乐)",
	"和平精英、Kevin Penkin - 朱雀啸鸣 (朱雀祭坛背景音乐)",
	"和平精英、西木康智 - 白虎咆哮 (白虎祭坛背景音乐)",
	"和平精英、Brian Tyler、Gordy Haab、Matt Hutchinson、Austin Wintory、张伟林 - 第二乐章：激战未来",
	"和平精英、Brian Tyler、Gordy Haab、Matt Hutchinson、Austin Wintory、张伟林 - 第三乐章：和平之旅",
	"Edwin Wendler - 起飞！特种兵（二周年飞艇派对大厅音乐）",
	"和平精英 - 萌萌物资",
	"张伟林 - 和平使命 (12秒片段)",
	"和平精英 - 怪兽来袭 (哥斯拉玩法背景音乐)",
	"和平精英 - 梦想起飞 (二周年庆生火箭背景音乐)",
	"和平精英、Brian Tyler、Gordy Haab、Matt Hutchinson、Austin Wintory、张伟林 - 第一乐章：使命征程",
	"和平精英 - 飞天雪橇",
	"和平精英 - 四圣闹新春",
	"和平精英 - 平安夜颂曲",
	"和平精英 - Battle for Peace(精英之战) (钢琴变奏版)",
	"和平精英 - 秋夕祭月",
	"和平精英 - 起飞吧小马!(木马活动音乐)",
	"和平精英 - 界外时尚概念音乐 (二周年飞艇告别曲)",
	"和平精英、Brian Tyler、Gordy Haab、Matt Hutchinson、Austin Wintory、张伟林 - 和平之旅组曲",
	"和平精英 - 吉祥如意(春节活动背景音乐)",
	"和平精英 - 秋日余晖",
	"和平精英 - 欢庆春节(2021春节大厅音乐)",
	"和平精英、Austin Wintory - War is On(大战在即)",
	"和平精英、Mason Lieberman - 相约特训岛 (特训岛广场背景音乐)",
	"贾杰、和平精英 - Ambitious(和平精英伏魔团主题曲)",
	"和平精英 - 谁是内鬼 (特训岛内鬼玩法背景音乐)",
	"和平精英、Edwin Wendler - 四圣降临 (四圣觉醒大厅音乐)",
	"和平精英 - 突变来袭",
	"和平精英 - 起飞!特种兵 (二周年飞艇派对大厅音乐)",
	"TizzyT、Jony J - Winner Winner (和平精英2020PEC年度盛典主题曲)",
	"HENRY刘宪华 - Born A Winner",
	"和平精英、Brian Tyler、Gordy Haab、Matt Hutchinson、Austin Wintory、张伟林 - 大厅版：黑刃风暴",
	"王一博、和平精英 - 空投计划",
	"G-DRAGON - 소년이여 (少年呀)(Choice37 Remix版)",
	"EYAir、Billie Eilish、Khalid、W1nko - lovely (remix)",
	"Mr FijiWiji、Laura Brehm、AgNo3 - Pure Sunlight",
	"Burak Cilt、DJ AVENSO - Sweet But Psycho (DJ AVENSO Remix)",
	"周杰伦 - 给我一首歌的时间 (DJ版)", // 可能重复·C(可能同一首)·同「田一名 - 给我一首歌的时间」
	"Swang多雷 - 泡沫 (remix：Swang)",
	"川井憲次 - 七剑战歌",
	"Jiaye - Fade Again",
	"LookedatHerFore - despair", // 可能重复·B(较可能同一首)·同「ablikimwow - DeSpair」
	"Martin Garrix、Troye Sivan - There For You",
	"Max Raabe - We Will Rock You", // 可能重复·A(高度相似)·同「We Will Rock You」
	"69 - 98K吃鸡摇游戏段子专用DJ",
	"Pascal Letoublon - Friendships (Original Mix)",
	"Despai - One Two Three",
	"搬运工 - 芒提琴",
	"河源小天 - 泡妞就两个字耍酷",
	"苏名哲 - Geronimo",
	"Jim Yosef - Firefly",
	"阳山伟伟 - 送给未来的你",
	"亦轩、圈妹 - 所有精神小伙全部听令 (DJ版)",
	"Rizky Ayuba - You Know I'll Go Get",
	"Kelly Clarkson - Stronger (What Doesn't Kill You)",
	"Steerner、Martell - Sky (Radio Edit)",
	"Alan Walker - Spectre", // 可能重复·B(较可能同一首)·同「Alan Walker - The Spectre」
	"徐梦圆 - Color-X (3D版)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"Kayaz - Sansa Lala (纯音乐)",
	"OMFG - Hello (你好)",
	"Brand X Music - Helmet to Helmet", // 可能重复·B(较可能同一首)·同「Brand X Music - Helmet to Helmet (头盔挨着头盔)」
	"宋善恩 - 面对疾风吧 (DJ版)",
	"Ramin Djawadi、Tom Morello - Pacific Rim (feat. Tom Morello)",
	"Klaus Badelt - Will And Elizabeth",
	"Ramin Djawadi、Tom Morello - Go Big Or Go Extinct (feat. Tom Morello)",
	"Alan Walker - Fade (褪色)(低音版)", // 可能重复·B(较可能同一首)·同「Alan Walker - Faded」
	"Peter Roe - Epicmusicvn Series",
	"英雄联盟 - Welcome to Planet Urf (欢迎来到海牛星)",
	"未知歌手 - 和平精英#枪响",
)

// QQ飞车音乐合集哈（202首）
songs.push(
	"本兮、阿悄 - 无限速",
	"Craig David - Insomnia", // 可能重复·B(较可能同一首)·同「Craig David - Insomnia (Up All Night Mix)」
	"Akon - Right Now (Na Na Na)", // 可能重复·B(较可能同一首)·同「Akon - Right Now (Na Na Na) (承利0.8x版)」
	"The Black Eyed Peas - I Gotta Feeling",
	"The Hit Crew - Love Story", // 可能重复·B(较可能同一首)·同「Taylor Swift - Love Story」
	"Linkin Park - Numb", // 可能重复·C(可能同一首)·同「XXXTentacion - NUMB」
	"Rachel Platten - Lone Ranger",
	"McFly - Nothing",
	"Skillet - What I Believe",
	"张震岳 - 爱的初体验", // 可能重复·B(较可能同一首)·同「纵贯线 - 爱的初体验 (Live)」
	"The Downtown Fiction - I Just Wanna Run",
	"Simple Plan - Last One Standing",
	"Green Day - Know Your Enemy",
	"Backstreet Boys - Straight Through My Heart",
	"Avril Lavigne - Girlfriend (Radio Edit)",
	"Katy Perry、Snoop Dogg - California Gurls",
	"Flo Rida - Whistle",
	"Flo Rida、T-Pain - Low (Album Version)",
	"Britney Spears - Do Somethin'",
	"Sum 41 - Welcome To Hell",
	"Rain - 하루도 (Not A Single Day) (Not A Single Day)",
	"少女时代 - Mr.Mr",
	"Fall Out Boy - Uma Thurman",
	"Shakira - Try Everything", // 可能重复·B(较可能同一首)·同「Shakira - Try Everything (From ＂Zootopia＂｜Soundtrack)」
	"angeles del Infierno - Rocker",
	"Fall Out Boy - ＂The Take Over, The Breaks Over＂",
	"Rain、泰万 - Touch Ya",
	"Avicii - Waiting for Love", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"Rain - Don't Stop",
	"MARINA - Savages",
	"8stops7 - Regression (Explicit)",
	"Flo Rida、99 Percent - Cake (Challenge Version)",
	"SUPER JUNIOR - SORRY, SORRY",
	"大嘴巴 - Play ! (Album Version)",
	"Macklemore、Ryan Lewis、Ray Dalton - Can't Hold Us (feat. Ray Dalton)",
	"Flo Rida、99 Percent - Cake (Jay Mac & Kameo Remix)",
	"Ed Sheeran - Nancy Mulligan",
	"Simple Plan - Freaking Me Out (feat. Alex Gaskarth｜Explicit)",
	"Linkin Park - Crawling",
	"Skillet - Comatose",
	"Ashley Parker Angel - Let U Go",
	"Nightwish - She Is My Sin",
	"Nightwish - Bye Bye Beautiful", // 可能重复·B(较可能同一首)·同「Nightwish - Bye Bye Beautiful (DJ Orkidea Remix)」
	"Fort Minor、Styles of Beyond - Remember The Name", // 可能重复·B(较可能同一首)·同「Fort Minor、Styles of Beyond - Remember The Name (Album Version)」
	"Agent 51、Simon Dine、Paul John Weller - Aim High (Explicit)",
	"Bon Jovi - Have A Nice Day",
	"A - The Distance",
	"Kesha - Crazy Kids",
	"Avril Lavigne - Sk8er Boi",
	"P!NK - Blow Me (One Last Kiss)",
	"Kesha - TiK ToK",
	"Fort Minor、Styles of Beyond - Remember The Name (feat. Styles of Beyond)", // 可能重复·B(较可能同一首)·同「Fort Minor、Styles of Beyond - Remember The Name (Album Version)」
	"Karaoke King - Crash (Originally Performed by Usher)(Karaoke Version)",
	"Miley Cyrus - Wrecking Ball",
	"Britney Spears - 3",
	"A - Starbucks",
	"5 Years And Counting - Pokerface", // 可能重复·B(较可能同一首)·同「Lady Gaga - Poker Face (Makkur Remix)」
	"Axwell ／＼ Ingrosso、Kid Ink - I Love You", // 可能重复·B(较可能同一首)·同「Kevin Rater - I LOVE YOU」
	"Fall Out Boy - My Songs Know What You Did In The Dark Light Em Up",
	"Rancid - Where I'm Going",
	"The Ting Tings - That's Not My Name",
	"Simple Plan - Take My Hand",
	"Nickelback - What Are You Waiting For？",
	"Akon - Gangsta Bop",
	"Nightwish - I Want My Tears Back",
	"Taio Cruz、Flo Rida - Hangover",
	"Linkin Park - In The End", // 可能重复·B(较可能同一首)·同「Black Veil Brides - In the End」
	"青山テルマ、SoulJa - そばにいるね (留在我身边)",
	"Sweetbox - Don't Push Me",
	"Wonder Girls - Nobody (Korean Version)",
	"Linkin Park - Somewhere I Belong",
	"Maroon 5 - One More Night",
	"Justin Bieber、Ludacris - Baby",
	"高耀太 - 불꽃 (火花)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"少女时代 - Gee", // 可能重复·B(较可能同一首)·同「少女时代 - Gee (Korean Ver.)」
	"8 Stops7 - My Would-Be Savior", // 可能重复·B(较可能同一首)·同「8 Stops7 - My Would-Be Savior (Album Version)」
	"日本ACG - OP BON VOYAGE！",
	"苏芮琪 - 向着光，出发",
	"Agent 51 - Wrecking Ball",
	"韦琪 - 超速度",
	"Axwell ／＼ Ingrosso、Kid Ink - I Love You (Explicit)", // 可能重复·B(较可能同一首)·同「Kevin Rater - I LOVE YOU」
	"DOMA - QQ飞车手游——开场CG音乐",
	"Wolfmother - Woman",
	"Krewella - Live for the Night (Explicit)",
	"LOKEY低调组合、QQ飞车 - 得儿漂",
	"龚琳娜、QQ飞车 - 拐弯",
	"Agent 51 - Aim High",
	"Bon-Bon Blanco - BON VOYAGE!",
	"Fall Out Boy - My Songs Know What You Did In The Dark (Light Em Up)",
	"Justin Bieber - Baby (Acoustic Version)",
	"Perfume - FLASH",
	"景甜 - 还爱你",
	"小橘子、QQ飞车 - 拾光梦想",
	"李子璇、QQ飞车 - 继续出发",
	"小阿甜 - 无限速",
	"跟风超人 - 爱漂才会赢",
	"罗志祥 - 星舞者",
	"Ed Sheeran - Shape of You (Yxng Bane Remix)", // 可能重复·B(较可能同一首)·同「Ed Sheeran - Shape of You」
	"许嵩 - 飞驰于你",
	"Maroon 5 - One More Night (Sticky K Remix)",
	"汪苏泷、QQ飞车 - 生来第一",
	"D-51 - BRAND NEW WORLD",
	"黄子韬 - 最开心的瞬间",
	"小橘子、QQ飞车 - 与你同行",
	"谭维维、QQ飞车 - 制胜无限速",
	"Avicii、Martin Garrix、Simon Aldred - Waiting For Love (Live)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"段奥娟 - So So",
	"潘辰 - 极速梦想",
	"Fall Out Boy - My Songs Know What You Did in the Dark（Light 'Em Up）",
	"Metallica - Whiskey In The Jar",
	"张杰、QQ飞车 - 骄傲的选择",
	"张杰、LOKEY低调组合、QQ飞车 - FAST",
	"Linkin Park - In the End (Live BBC Radio)", // 可能重复·B(较可能同一首)·同「Black Veil Brides - In the End」
	"Ed Sheeran - Shape of You", // 可能重复·B(较可能同一首)·同「Ed Sheeran - Shape of You」
	"t.A.T.u. - Loves Me Not",
	"张含韵、QQ飞车 - 极速战姬",
	"OneRepublic、Logic - Start Again",
	"周杰伦 - 不爱我就拉倒",
	"Supper Moment - 橙海",
	"Maddie Poppe - Going Going Gone",
	"Calvin Harris、Dua Lipa - One Kiss",
	"Clean Bandit、Demi Lovato - Solo (feat. Demi Lovato)",
	"乃木坂46 - シンクロニシティ (同步巧合)",
	"Banx & Ranx、Ella Eyre、Afro B、Yxng Bane - Answerphone (feat. Yxng Bane & Afro B)(Team Salut Remix)",
	"Ella Mai - Boo'd Up",
	"庄心妍 - 不安",
	"许嵩 - 明智之举",
	"Martin Garrix、Khalid - Ocean",
	"Cheat Codes、Little Mix - Only You", // 可能重复·B(较可能同一首)·同「罗家英 - Only You」
	"苏见信 (信) - 荣耀征战",
	"Maroon 5 - Three Little Birds",
	"Fairies - BLING BLING MY LOVE",
	"HONNE - Coastal Love",
	"Innertier、Thomas Gregersen - Du er ung (feat. Thomas Gregersen)",
	"Payper Corleone - I Like It (Remix｜Explicit)",
	"Jess Glynne - I'll Be There",
	"简廷芮 - 奇怪女孩",
	"容祖儿 - 心之科学",
	"Meghan Trainor - ALL THE WAYS",
	"ZICO (지코)、IU - SoulMate",
	"Bebe Rexha - Ferrari",
	"Martin Garrix、Bonn - High On Life",
	"Imagine Dragons - Natural", // 可能重复·B(较可能同一首)·同「Imagine Dragons - Natural (Live)」
	"FTISLAND - Pretty Girl",
	"Why Don't We - Talk",
	"ビッケブランカ (VK Blanka) - WALK (Movie Version)",
	"蔡徐坤 - You Can Be My GirlFriend",
	"David Guetta、Anne-Marie - Don't Leave Me Alone (Acoustic)",
	"Zedd、Elley Duhé - Happy Now",
	"Juanes - La Camisa Negra",
	"温拿乐队 - Bad Time (Album Version)",
	"Rain Man、Oly - Bring Back the Summer (feat. OLY)",
	"Fort Minor、Styles of Beyond - Feel Like Home",
	"Macklemore、Ryan Lewis、Ray Dalton - Can't Hold Us",
	"BOBBY - 꽐라 (HOLUP!)",
	"Fall Out Boy - The Phoenix",
	"SISTAR - I Like That",
	"羽泉、李敏镐 - 奔跑", // 可能重复·B(较可能同一首)·同「羽·泉、黄征 - 奔跑」
	"Perfume - FLASH (闪光)",
	"Justin Bieber - Love Me",
	"A - Something's Going On",
	"Bon Jovi - Last Man Standing",
	"Linkin Park - Numb (Single Version)",
	"Taylor Swift - Love Story (爱情故事)", // 可能重复·B(较可能同一首)·同「Taylor Swift - Love Story」
	"泫雅 (HyunA)、龙俊亨 - Change",
	"Kesha - TiK ToK (Wolfedelic Club Mix)",
	"Taylor Swift - Love Story", // 可能重复·B(较可能同一首)·同「Taylor Swift - Love Story」
	"Tipsy(Young Souljaz)、卓义峰 - 随我造",
	"BAAD - 君が好きだと叫びたい (好想大声说爱你)",
	"7爷、秦晓疯 - QQ飞车 (Remix)",
	"小旭音乐 - QQ飞车T3机甲-QQ飞车视频配乐",
	"Chuang - QQ飞车火花飘曲 (Remix)",
	"2PM、尹恩惠 - Tik Tok",
	"Blush - Beyond Tomorrow",
	"Rain、TABLO - I'm Coming",
	"Kesha - Your Love Is My Drug",
	"Lady Gaga - Poker Face", // 可能重复·B(较可能同一首)·同「Lady Gaga - Poker Face (Makkur Remix)」
	"MC 몽、Mellow - 죽을 만큼 아파서 (死一样的痛苦)(Feat. 멜로우)",
	"Not A Single Day.ogg",
	"丹戈尔 - 极速梦想",
	"Blush - This Time",
	"韦琪、本兮 - 超速度",
	"辉星 - Insomnia (불면증)",
	"Beatrich - I Need the Beat",
	"Bellefire - Say Something Anyway",
	"Christina Aguilera - Not Myself Tonight (Jody Den Broeder Mixshow)",
	"Colbie Caillat - The Little Things",
	"Monica - Believing In Me",
	"Maker、听风Xyi - Cardiac moment",
	"Maker、听风Xyi - Metaverse",
	"Taylor Swift - Love Story (3D环绕版)", // 可能重复·B(较可能同一首)·同「Taylor Swift - Love Story」
	"SoulJa、青山テルマ - ここにいるよ (我就在这里)",
	"高耀太 - 실연 (失恋)",
	"Fort Minor、Styles of Beyond - Remember the Name (feat. Styles of Beyond)(Explicit)", // 可能重复·B(较可能同一首)·同「Fort Minor、Styles of Beyond - Remember The Name (Album Version)」
	"Linkin Park - New Divide",
	"Wir Sind Helden - Nur ein Wort",
	"Britney Spears - Toxic",
	"少女时代 - 소원을 말해봐 (说出你的愿望)(Genie)",
	"少女时代 - Mr.Taxi (Japanese Ver.)",
	"에픽하이 (EPIK HIGH)、지선 (Loveholic) - One",
	"Rain - With U",
)

// 怀旧单机游戏音乐（561首）
songs.push(
	"大话Game - 史上十大经典红白机游戏!#游戏 #单机主机游戏 游戏",
	"Ari Pulkkinen - Title Theme",
	"増田順一 - ミシロタウン",
	"冒险岛游戏 - 冒险岛",
	"华语群星 - FC《功夫》主题BGM",
	"铭一 - 马戏团 (原FC游戏马戏团第一关背景) (50秒片段)",
	"刘翼诚 - In the battle",
	"徐梦圆 - 第五人格",
	"球球大作战 - 彩豆森林",
	"Various Artists - 海绵宝宝片尾曲", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"合金弹头 - FINAL ATTACK",
	"纯音乐 - 拳皇97合成音乐",
	"林宇文 - 恐怖之眼主菜单声音",
	"Soundtracks - Field of memories",
	"C418 - Minecraft (我的世界)",
	"华语群星 - FC《绿色兵团》第一关BGM",
	"纯音乐 - 魂斗罗",
	"铃声 - 超级玛丽",
	"光宗信吉 - 熱き決闘者たち",
	"天天酷跑 - 酷跑 Run To You (活力冲刺版)",
	"纯音乐 - 植物大战僵尸2背景音乐",
	"Soundroll - Troublemaker",
	"翟锦彦 - 主菜单",
	"乐石涯音频 - 保卫萝卜",
	"Danny McCarthy - silver scrapes (混音)",
	"Laura Shigihara - Zombies on Your Lawn",
	"Laura Shigihara - Crazy Dave",
	"Laura Shigihara - Brainiac Maniac",
	"Laura Shigihara - Graze the Roof",
	"Laura Shigihara - Grasswalk",
	"Laura Shigihara - Loonboon",
	"Laura Shigihara - Moongrains",
	"Laura Shigihara - 2.75",
	"Cheetah Mobile - 第一关 Massif 山丘",
	"Cheetah Mobile - 童话", // 可能重复·A(高度相似)·同「光良 - 童话」
	"Cheetah Mobile - 街篮",
	"Cheetah Mobile - 狂热派对",
	"Cheetah Mobile - 王牌",
	"Cheetah Mobile - 遗迹",
	"Cheetah Mobile - 雷鬼",
	"Cheetah Mobile - 扑克",
	"Cheetah Mobile - 矩阵浪潮",
	"Cheetah Mobile - 几何",
	"Cheetah Mobile - 奖励关 8Bits 8比特",
	"Cheetah Mobile、F-777 - 第十六关 1UP 像素", // 可能重复·C(可能同一首)·同「F-777 - The 7 Seas (七片海)」
	"Tobu、Cheetah Mobile - Candyland",
	"Cheetah Mobile、F-777 - 第十五关 Kung Fu 功夫", // 可能重复·C(可能同一首)·同「F-777 - The 7 Seas (七片海)」
	"Cheetah Mobile - 圣诞节",
	"Cheetah Mobile、F-777 - Deep Space", // 可能重复·C(可能同一首)·同「F-777 - The 7 Seas (七片海)」
	"Cheetah Mobile - 奖励一关 illusion 幻想 (Unused)",
	"Cheetah Mobile - 第十一关 Halloween 万圣节",
	"Cheetah Mobile - 幻想",
	"Cheetah Mobile - 第十二关 Ghost Dance 亡灵之舞",
	"Cheetah Mobile - 第十关 Castle in the Sky 天空之城",
	"Cheetah Mobile - 第九关 E-labyrinth 电子迷宫",
	"Cheetah Mobile - 俄罗斯方块",
	"Cheetah Mobile - 科技",
	"Cheetah Mobile - 第六关 City 城市",
	"Cheetah Mobile - 第五关 Volcano 火山",
	"Cheetah Mobile - 第四关 Desert 沙漠",
	"Cheetah Mobile - 森林", // 可能重复·B(较可能同一首)·同「一杯陈豆浆 - 森林」
	"Cheetah Mobile - 第二关 Sky 天空",
	"华语群星 - FC《超级魂斗罗》第1关BGM",
	"怀旧游戏音乐精选100 (Video Game Music Top100)、华语群星 - 赤色要塞",
	"华语群星 - FC《魂斗罗》Base",
	"华语群星 - FC《魂斗罗》通关BGM",
	"日本ACG - Cyborg_Factory",
	"日本ACG - Waterfall_Boss",
	"纯音乐 - Base_Boss",
	"日本ACG - Jungle_Normal",
	"日本ACG - Base",
	"日本ACG - Harvest_Yard",
	"日本ACG - Ocean",
	"日本ACG - Harbor",
	"纯音乐 - Waterfall",
	"纯音乐 - Jungle_Hard",
	"日本ACG - Neo_City",
	"阿部功、西垣俊 - ボス 1,2 イントロ ~ボス 1 (STAGE 1,5)",
	"阿部功、西垣俊 - 追撃 (STAGE 1-3,7-1)",
	"西垣俊、阿部功 - 静寂の罠 (STAGE 1-2,2-3,6-1)",
	"阿部功、西垣俊 - ボス 2 (STAGE 2,6,8)",
	"阿部功、西垣俊 - 密猟者の森にて (STAGE 2-1,6-2)",
	"阿部功、西垣俊 - 爆走 (STAGE 3-A)",
	"阿部功、西垣俊 - ボス 3 イントロ~ボス 3 (STAGE 3)",
	"阿部功、西垣俊 - 疾風のごとく (STAGE 3-B,7-2)",
	"阿部功、西垣俊 - 太古の地 (STAGE 2-2,6-3)",
	"阿部功、西垣俊 - 奪われた要塞 (STAGE 4-1,8-2)",
	"阿部功、西垣俊 - 乱射・乱闘 (STAGE 4-2,5-2)",
	"阿部功、西垣俊 - 待ち伏せ (STAGE 4-3,7-3)",
	"阿部功、西垣俊 - ボス 4 イントロ~ボス 4 (STAGE 4,7)",
	"阿部功、西垣俊 - 恐竜たちの荒野 (STAGE 5-1)",
	"纯音乐 - MD《幽游白书 魔强统一战》I'm Jin, Say Something if You Can!",
	"华语群星 - FC《南极大冒险》主题BGM",
	"华语群星 - FC《赤影战士》第一关BGM",
	"华语群星 - PS《荒野兵器》To the End of the Wilderness",
	"华语群星 - PS《最终幻想7》神の诞生",
	"华语群星 - PS《大航海时代4》远航",
	"华语群星 - SS、DC《樱花大战2》梦のつづき",
	"怀旧游戏音乐精选100 (Video Game Music Top100) - MD《幽游白书 魔强统一战》斗技场BGM",
	"华语群星 - PS、SS《超级机器人大战F》残酷な天使のテーゼ",
	"华语群星 - PS《最终幻想8》Waltz For the Moon",
	"华语群星 - 多机种《最终幻想》系列 Chocobo Theme",
	"光田康典 - PS《异度装甲》Small Two Of Pieces",
	"华语群星 - DC《樱花大战3》未来",
	"华语群星 - DC《樱花大战4》君よ花よ",
	"华语群星 - PS《恶魔城-月下夜想曲》バ－ル舞踏曲",
	"华语群星 - FC《超时空要塞》主题BGM",
	"怀旧游戏音乐精选100 (Video Game Music Top100) - PS《幻想传说》梦は終わらな",
	"华语群星 - 梦幻模拟战2 Leon",
	"怀旧游戏音乐精选100 (Video Game Music Top100)、华语群星 - FC《沙罗曼蛇》第1关BGM",
	"怀旧游戏音乐精选100 (Video Game Music Top100)、华语群星 - PS《恶魔城-月下夜想曲》虹の墓地",
	"华语群星 - DC《莎木》Shenfa~Sedge Flower",
	"怀旧游戏音乐精选100 (Video Game Music Top100)、华语群星 - PS《最终幻想7》Aeris'Theme",
	"怀旧游戏音乐精选100 (Video Game Music Top100)、华语群星 - Knights Errant",
	"山根ミチル - PS《恶魔城-月下夜想曲》水晶のしずく",
	"怀旧游戏音乐精选100 (Video Game Music Top100)、华语群星 - 多机种《恶魔城》系列 Vampire Killer",
	"超级玛丽 - FC《超级玛丽》水下关BGM",
	"华语群星 - FC《松鼠大作战》第1关BGM",
	"怀旧游戏音乐精选100 (Video Game Music Top100)、华语群星 - DC《樱花大战3》御旗のもとに",
	"GARNET CROW - PS《永恒传说》Flying",
	"华语群星 - PS《恶魔城-月下夜想曲》神々たちのレクイエム",
	"华语群星 - FC《马戏团》第1、4关BGM",
	"山根ミチル - PS《恶魔城-月下夜想曲》黄金の舞曲",
	"怀旧游戏音乐精选100 (Video Game Music Top100)、华语群星 - SS《樱花大战》如花少女",
	"华语群星 - ARC《街头霸王2》春丽主场BGM",
	"山根ミチル、华语群星 - PS《恶魔城-月下夜想曲》悲境の贵公子",
	"华语群星 - 多机种《最终幻想》系列 The Prelude",
	"山根ミチル - PS《恶魔城-月下夜想曲》夜曲",
	"山根ミチル - PS《恶魔城-月下夜想曲》失わ",
	"华语群星 - 多机种《最终幻想》系列 战斗",
	"Shiratori Emiko - PS《最终幻想9》Melodies of",
	"山根ミチル - PS《恶魔城-月下夜想曲》ドラ",
	"山根ミチル - PS《恶魔城-月下夜想曲》I Am",
	"华语群星 - 多机种《最终幻想》系列主题曲",
	"王菲 - Eyes On Me",
	"羊了个羊 - 超级玛丽 - 游戏音乐",
	"华语群星 - FC《三国志2-霸王的大陆》地图BGM",
	"华语群星 - PS《生化危机3》结束曲",
	"华语群星 - FC《七宝奇谋》第一关BGM",
	"怀旧游戏音乐精选100 (Video Game Music Top100) - The Edge Of Soul",
	"华语群星 - FC《马戏团》第2、3关BGM",
	"华语群星 - 游戏原声松鼠大作战最终关bgm",
	"华语群星 - PS、SS《超级机器人大战F》燃え上がれ闘志",
	"华语群星 - MD梦幻模拟战2 The Dark Princess",
	"华语群星 - FC《影子传说》主题BGM",
	"华语群星 - GBA《超级机器人大战A》DARK KNIGHT",
	"华语群星 - The Last Battle",
	"山根ミチル - PS《恶魔城-月下夜想曲》焉道",
	"华语群星 - SFC《最终幻想6》Tina",
	"华语群星 - PS《穿越时空》Scars of Time",
	"JAM Project - PS《超级机器人大战α外传》钢の救世主",
	"华语群星 - PS《最终幻想9》You're Not Alone",
	"藤尾敦、船内秀浩、鈴木勝彦 - TwinBee 3 (FC) (Pattern Clear BGM)",
	"上高治己、小倉努、山根ミチル - がんばれゴエモン外伝~きえた黄金キセル (FC)",
	"GMR - FC (忍者龙剑传)",
	"前沢秀憲 - スーパー魂斗羅 (FC)",
	"天空蝎 - 星际魂斗罗 (FC)",
	"前沢秀憲 - 月風魔伝 (FC)",
	"二周年庆特典 - FC (魔天童子)",
	"天空蝎 - 中国象棋 (FC)",
	"山下絹代 - エスパードリーム (FC)",
	"天空蝎 - 双截龙II-第二关 (FC)",
	"二周年庆特典 - FC (燃烧战车)",
	"天空蝎 - 双截龙II-第四关 (FC)",
	"二周年庆特典 - 双截龙 - Mission-1",
	"鈴木勝彦、藤尾敦 - 魍魎戦記 摩陀羅 (FC)",
	"竹安弘、冨田朋也 - パロディウスだ! (FC)",
	"GMR - FC (忍者神龟)",
	"GMR - FC (洛克人)",
	"未知歌手 - fc (赤色要塞)",
	"天空蝎 - 冒险岛1 (FC)",
	"GMR - FC - 玛丽医生 - BGM",
	"GMR - FC - 影子传说 - Main Theme",
	"feilei7 - [FC]赤色要塞-开场结尾",
	"陈栋 - 超时空要塞",
	"陈栋 - 超级玛丽第一关",
	"Bit Brigade - Waterfall",
	"Bit Brigade - Victory", // 可能重复·B(较可能同一首)·同「Two Steps From Hell、Thomas Bergersen - Victory」
	"Bit Brigade - Base Boss",
	"Bit Brigade - Jungle",
	"纯音乐 - base",
	"Kazuki Muraoka - Shadowgate (Ending)",
	"日本ACG - Tiny Toon Adventures - Title Theme",
	"日本ACG - Rush 'N' Attack - Unknown Stage (Unknown Stage)",
	"山根ミチル - Castlevania - Stage 5",
	"Kazuki Muraoka - Metal Gear (Ending)",
	"v.a. - Life Force - Stage 6",
	"david wise - Snake Rattle 'N' Roll - Stage 1",
	"山根ミチル - Castlevania 2 - Daylight (Daylight)",
	"近藤浩治 - Underworld (31秒片段)",
	"日本ACG - Ghost 'N' Goblins - Stage 1 (Stage 1)",
	"松前真奈美、坂口由洋 - Mega Man (Cut Man)",
	"山根一央 - Double Dragon (Stage 1)",
	"近藤浩治 - 城BGM",
	"近藤浩治 - Legend of Zelda - Outworld",
	"近藤浩治 - 地上BGM",
	"日本ACG - Ice Climber - Title & Play (Title & Play)",
	"日本ACG - Rush 'N' Attack - Stage 1",
	"日本ACG - Gunsmoke - Stage 1 (Stage 1)",
	"V.A. - Goonies 2 - World 1",
	"小高直樹 - Super Mario Bros 2 - Stage 1",
	"吴尐少 - Life Force - Stage 2",
	"Yuukichan's Papa - Duck Tales - The Amazon",
	"山根美智留 - Castlevania - Stage 1",
	"v.a. - Super Mario Bros - Overworld Theme",
	"藤尾敦、坂元信也、Satoe Terashima - Life Force - Stage 1",
	"日本ACG - Chip 'N' Dale's - Title & Stage 1 (Title & Stage 1)",
	"SNK新世界楽曲雑技団 - Good ending",
	"SNK - Escape (ラスボス倒した後のデモ)",
	"SNK新世界楽曲雑技団 - Uncanny laugh",
	"SNK新世界楽曲雑技団 - Let's run through!",
	"SNK新世界楽曲雑技団 - Cadaverous",
	"SNK新世界楽曲雑技団 - Show spirit",
	"SNK新世界楽曲雑技団 - Choose a person",
	"SNK - MS_X ENDING (エンドロール)",
	"合金弹头 - END TITLE AGAIN -X-",
	"METAMORPHOSIS -X- (ステージ 5 - 3)",
	"NEW GODOKIN STREET -X- (ステージ 5 - 1)",
	"ASSAULT THEME -X- (ボステーマ C、ステージ 6 - 1)",
	"SNK新世界楽曲雑技団 - JUDGMENT -X-",
	"SNK - BARRACKS -X- (キャラクターセレクト)",
	"SNK新世界楽曲雑技団 - END TITLE AGAIN",
	"SNK新世界楽曲雑技団 - FINAL ATTACK (ステージ 6 - 3)",
	"SNKプレイモア - METAMORPHOSIS (ステージ 5 - 3)",
	"SNK新世界楽曲雑技団 - KISS IN THE DARK",
	"SNK新世界楽曲雑技団 - NEW GODOKIN STREET",
	"SNK新世界楽曲雑技団 - back to the china",
	"SNK新世界楽曲雑技団 - ASSAULT THEME",
	"LIVIN ON THE DECK -X- (ステージ 3 - 1)",
	"FIRST CONTACT -X- (ボステーマ B、ステージ 6 - 2)",
	"SNK - THE CENOTAPH -X- (ステージ 2 - 3)",
	"SNK新世界楽曲雑技団 - PREHISTORIC SITE",
	"SNK新世界楽曲雑技団 - BARRACKS",
	"SNK - THE MILITARY SYSTEM (操作説明、ランキング)",
	"SNK新世界楽曲雑技団 - 最終演出 2P",
	"SNK新世界楽曲雑技団 - 最終演出 1P",
	"SNK新世界楽曲雑技団 - ステージ 6",
	"SNK新世界楽曲雑技団 - ステージ 5",
	"SNK新世界楽曲雑技団 - ステージ 4",
	"SNK新世界楽曲雑技団 - ステージ 3",
	"SNK新世界楽曲雑技団 - ステージ 2",
	"SNK新世界楽曲雑技団 - ボスステージ",
	"SNK新世界楽曲雑技団 - ステージ 1",
	"SNK新世界楽曲雑技団 - 操作説明、ランキング",
	"SNK新世界楽曲雑技団 - TITLE (オープニング) ~ ナスカロゴ 1",
	"合金弹头 - END TITLE AGAIN",
	"合金弹头 - ESCAPE",
	"合金弹头 - BIOINFORMATICS",
	"合金弹头 - FIRST CONTACT",
	"合金弹头 - KISS IN THE DARK",
	"合金弹头 - 宇宙へ",
	"合金弹头 - THE KIDNAPPING",
	"SNK新世界楽曲雑技団 - 空へ (飞向天空)",
	"合金弹头 - 日本兵 (ステージ 4 分岐ルート～旧正規軍アジト)",
	"合金弹头 - THE CENOTAPH",
	"合金弹头 - ピラミッド",
	"合金弹头 - 砂漠",
	"合金弹头 - ひみつ工場",
	"合金弹头 - ASSAULT THEME",
	"合金弹头 - ハード海中",
	"合金弹头 - 浅い海",
	"SNKプレイモア - METAMORPHOSIS (ボステーマ B)",
	"合金弹头 - 魔の雪洞",
	"合金弹头 - 真夜中の彷徨 (午夜的彷徨)",
	"合金弹头 - STEEL BEAST 6BEETS",
	"合金弹头 - THE UNKNOWN WORLD",
	"合金弹头 - マリンダイバー",
	"合金弹头 - 蒼海の牙 -Dr.モローの島- (苍海之牙 -莫洛博士之岛-)",
	"合金弹头 - BARRACKS",
	"合金弹头 - THE MILITARY SYSTEM",
	"SNK新世界楽曲雑技団 - ROAD TO SUCCESS",
	"合金弹头 - FIERCE BATTLE",
	"合金弹头 - LASTDITCH RESISTANCE",
	"合金弹头 - SPEEDER",
	"合金弹头 - BOTTOM OF THE SEA",
	"合金弹头 - RUN THROUGH",
	"SNK新世界楽曲雑技団 - INTRIGUE",
	"合金弹头 - ZOOM DOWN",
	"合金弹头 - WINDY DAY",
	"合金弹头 - RUINS EXCAVATION",
	"合金弹头 - SORTIE!",
	"深澤秀行 - Street Fighter IV -Orchestra ver",
	"深澤秀行 - Shop PV BGM",
	"深澤秀行 - TGS '08 PV BGM",
	"深澤秀行 - Staff Roll",
	"深澤秀行 - Theme of Gouken vs. Ryu",
	"深澤秀行 - Theme of Gouki vs. Ryu",
	"深澤秀行 - Theme of Rose -SFIV Arrange",
	"深澤秀行 - Theme of Cammy -SFIV Arrange",
	"深澤秀行 - Theme of Sakura",
	"深澤秀行 - Theme of Gouken",
	"深澤秀行 - Theme of Gouki -SFIV Arrange",
	"深澤秀行 - Theme of Sagat -SFIV ArrangeTheme of Vega -SFIV Arrange",
	"深澤秀行 - Theme of El",
	"深澤秀行 - Theme of Rufus",
	"深澤秀行 - Theme of Abel",
	"深澤秀行 - Theme of C. Viper",
	"深澤秀行 - Theme of Zangief (SF IV Arrange)",
	"深澤秀行 - Theme of Chun-Li -SFIV Arrange",
	"深澤秀行 - Theme of Ken -SFIV Arrange",
	"深澤秀行 - Theme of Ryu -SFIV Arrange",
	"深澤秀行 - THE NEXT DOOR -INDESTRUCTIBLE",
	"深澤秀行 - AC Ending -Type E-",
	"深澤秀行 - AC Ending -Type D-",
	"深澤秀行 - AC Ending -Type C-",
	"深澤秀行 - AC Ending -Type B-",
	"深澤秀行 - AC Ending -Type A-",
	"深澤秀行 - Congratulations Screen",
	"深澤秀行 - CS Lobby Screen",
	"深澤秀行 - Continue Screen",
	"深澤秀行 - A NEW WARRIOR HAS ENTERED THE RING",
	"深澤秀行 - Results Screen",
	"深澤秀行 - VS Screen -Normal-",
	"深澤秀行 - Training Stage",
	"深澤秀行 - Secret Laboratory Stage (Round 2) -Unknown",
	"深澤秀行 - Secret Laboratory Stage (Round 1) -Unknown",
	"深澤秀行 - Pitch-black Jungle Stage -Brazil",
	"深澤秀行 - Morning Mist Bay Stage -Vietnam",
	"深澤秀行 - Run-down Back Alley Stage -China", // 可能重复·B(较可能同一首)·同「Sand - CHINA-2」
	"深澤秀行 - Deserted Temple Stage -Japan",
	"深澤秀行 - Volcanic Rim Stage -Street Fighter IV",
	"深澤秀行 - Overpass Stage -Tokyo", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"深澤秀行 - Historic Distillery Stage -Scotland",
	"深澤秀行 - Inland Jungle Stage -Brazil",
	"深澤秀行 - Small Airfield Stage -Africa",
	"深澤秀行 - Drive-in at Night Stage -USA",
	"深澤秀行 - Beautiful Bay Stage -Vietnam",
	"深澤秀行 - Cruise Ship Stern Stage -Europe-",
	"深澤秀行 - Snowy Rail Yard Stage -Russia",
	"深澤秀行 - Crowded Downtown Stage -China", // 可能重复·B(较可能同一首)·同「Sand - CHINA-2」
	"深澤秀行 - Old Temple Stage -Japan",
	"深澤秀行 - Character Select Screen -Game Arrange",
	"深澤秀行 - AC Mode Select Screen -Game Arrange",
	"深澤秀行 - Introduction",
	"山岸継司 - 鮮烈のリュウ",
	"株式会社コーエーテクモゲームス - 一口坂に陽が昇る (一口坂旭日东升)(外国バージョンのグランドキャニオン面 BGM)",
	"日本ACG - 悪魔のハミング (最終面 BGM)",
	"山岸継司 - 最後の最後まで、こいつは (大陸横断鉄道面 BGM)",
	"斎藤幹雄 - 大自然のシンフォニー (グランドキャニオン面 BGM)",
	"斎藤幹雄 - CASINO (赌场)(2004 Remastered Version)",
	"斎藤幹雄 - I AM MAN (N.Y面、大陸横断鉄道面ボス BGM",
	"斎藤幹雄 - SHADOW SOLDIER (LA面 1R BGM)",
	"山岸継司 - アイリーン ‐夜明けの序曲 (プレリュード) ‐",
	"山岸継司 - 窮地‐試練の闘い‐",
	"日本ACG - 邪神の呪力",
	"山岸継司 - 攻防‐死のアギトにて‐",
	"山岸継司 - 鎮魂歌 (レクイエム)",
	"山岸継司 - 哀しき運命 (さだめ",
	"山岸継司 - 急襲 ‐暗躍する魔‐",
	"新田竜一 - CIA",
	"日本ACG - 潜伏 ‐悪夢の追撃‐",
	"山岸継司 - 疾風 (はやて) のように",
	"山岸継司 - 回想",
	"日本ACG - 勇壮 ‐迫り来る魔手‐",
	"山岸継司 - 謎の女 (神秘的女子)",
	"新田竜一 - 龍の忍者",
	"纯音乐 - 決意 ‐父の手紙‐",
	"山岸継司 - 月光の対決 (月光的对决)",
	"Hadouken! - Mic Check (Camo & Krooked Remix)",
	"Far Too Loud - Lightbringer",
	"Deadmau5 - Professional Griefers (Vocal Mix)",
	"The Crystal Method - Play For Real (feat. The Heavy)(Dirtyphonics Remix)(Explicit)",
	"Monsta - Holdin' On (Skrillex & Nero Remix)",
	"Kasabian - Underdog",
	"The Bloody Beetroots - Rocksteady",
	"Mord Fustang - Windwaker",
	"The Qemists - Be Electric",
	"vitalic - Stamina",
	"greta svabo bech、Gemini - Fire Inside",
	"Mind Vortex - Arc (Original Mix)",
	"Queens of the Stone Age - Go With The Flow",
	"Nero - Etude",
	"AWOLNATION - Burn It Down",
	"DJ Gontran - Chemistry",
	"Dj Dubai - Vodka Aspirin",
	"Krubb Wenkroist - Asphalt 8： Airborne – “Bleach”",
	"DJ Gontran - Moby Glitch",
	"Celldweller - Pulsar",
	"Celldweller - Through The Gates",
	"Two Mics - Bluebird",
	"Laura Shigihara - Plants vs. Zombies",
	"Laura Shigihara - Watery Graves",
	"Laura Shigihara - Secret Labs",
	"Laura Shigihara - Look up at the Sky",
	"Laura Shigihara - Kitanai Sekai",
	"Laura Shigihara - Braniac Maniac",
	"Laura Shigihara - Faster",
	"Laura Shigihara - Mountains",
	"Laura Shigihara - Cerebrawl",
	"Laura Shigihara - Rigor Mormist",
	"Laura Shigihara - Zen Garden",
	"Laura Shigihara - Choose Your Seeds",
	"Laura Shigihara - Uraniwa Ni Zombies Ga!",
	"Laura Shigihara - Zombotany (Unreleased Track)(Unreleased Track)",
	"Laura Shigihara - Ultimate Battle",
	"Laura Shigihara - Watery Graves (Fast Version)(slow)",
	"Laura Shigihara - Watery Graves (Slow Version)(fast)",
	"Laura Shigihara - Crazy Dave (Intro Theme)",
	"上田雅美 - Staffs & Credit",
	"华语群星 - PS《超级机器人大战α》Time Diver",
	"华语群星 - PS《超级机器人大战α》我ニ敌ナシ",
	"ZONE - 白い花 (白色的花朵)",
	"华语群星 - PS《北欧女神》Mighty Blow",
	"Khan - The Edge Of Soul",
	"クリスタルキング - 愛をとりもどせ!! (把爱夺回来!!)",
	"华语群星 - PS《超级机器人大战α》Marionette Messiah",
	"华语群星 - PS《北欧女神》Requiem to a Predicament",
	"华语群星 - PS《北欧女神》Take a Flight",
	"日本ACG - SFC《第四次超级机器人大战》Time to Come",
	"JAM Project - DARK KNIGHT (黑暗骑士)",
	"山根ミチル - 焉道",
	"华语群星 - 多机种《勇者斗恶龙》系列 Overture",
	"光田康典 - CHRONO CROSS ~時の傷痕~",
	"JAM Project - 鋼の救世主 (钢之救世主)",
	"华语群星 - PS《北欧女神》Valhalla",
	"植松伸夫 - 独りじゃない",
	"JAM Project - 鋼鉄の孤狼",
	"华语群星 - PS《北欧女神》Blameless Thoughts",
	"华语群星 - PS、SS《超级机器人大战F》时を越えて",
	"日本ACG - 荒野の果てへ",
	"华语群星 - PS《北欧女神》Turn Over a New Leaf",
	"华语群星 - PS《北欧女神》Confidence in the Domination",
	"横山智佐 - 夢のつづき",
	"华语群星 - PS《北欧女神》Epic Poem to Sacred Death",
	"帝国歌劇団 - 奇跡の鐘",
	"坂元信也、水谷郁、寺島里恵、安達昌宣 - BGM1",
	"华语群星 - GBA《逆转裁判》Ryuuichi Naruhodou",
	"光田康典 - スモール・ツー・オブ・ピーセス~軋んだ破片",
	"Various Artists - 未来 (ボヤージュ)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"华语群星 - PS《超级机器人大战α》Ace Attacker",
	"山根ミチル - パール舞踏曲",
	"よーみ - 夢は終わらない~こぼれ落ちる時の雫~ (梦想不会结束〜洒落的时之水滴〜)",
	"山根ミチル - 虹の墓地 (彩虹墓地)",
	"山根ミチル - 水晶のしずく",
	"巴里华撃団 - 御旗のもとに",
	"GARNET CROW - flying",
	"植松伸夫 - 片翼の天使",
	"怀旧游戏音乐精选100 (Video Game Music Top100)、华语群星 - PS (《超级机器人大战α外传》ダークプリズン)",
	"山根ミチル - 神々たちのレクイエム",
	"日本群星 - The Best Is Yet To Come",
	"怀旧游戏音乐精选100 (Video Game Music Top100)、华语群星 - PS《恶魔城-月下夜想曲》きまよえゐ魂",
	"山根ミチル - 黄金の舞曲",
	"群星 - 花咲く乙女",
	"山根ミチル - 悲境の貴公子",
	"山根ミチル - 失われた彩画 (遗失的绘画)",
	"Shiratori Emiko - Melodies Of Life",
	"山根ミチル - ドラキュラ城",
	"群星 - PS《合金装备》Metal Gear Solid Main Theme",
	"山根ミチル - アイ・アム・ザ・ウインド (I am the wind)(シンシア・ハレル)",
	"纯音乐 - FC《功夫》主题BGM",
	"植松伸夫 - Opening", // 可能重复·B(较可能同一首)·同「黄英华 - Opening」
	"横山智佐 - 檄！帝国華撃団 (帝国华击团)",
	"Mile$ - STAGE4",
	"DEEN - 夢であるように (彷如梦境)",
	"I Fight Dragons - Proxima Centauri",
	"Sabrepulse - Dark Lightning",
	"8-Bit Weapon - Gameboy Rocker",
	"纯音乐 - 超级玛丽纯人声变奏曲大男当婚配乐",
	"小旭音乐 - 欢乐斗地主背景音乐",
	"Tom、Angela - You Get Me (From ＂Talking Friends＂)",
	"纯音乐 - 冒险岛11周年经典BGM串烧",
	"近藤浩治 - Super Mario World ／ 地上BGM",
	"近藤浩治 - プレイヤーダウン",
	"近藤浩治 - Miss ~ Game Over (铃声)",
	"近藤浩治 - Course Clear Fanfare",
	"近藤浩治 - World Clear Fanfare",
	"马里奥银河 - Theme of SMG2",
	"近藤浩治 - New Super Mario Bros. Wii ／ タイトル",
	"横田真人 - Super Mario Galaxy",
	"日本ACG、近藤浩治 - 地上BGM",
	"近藤浩治 - DallPick Town",
	"近藤浩治 - スライダー (滑动)",
	"近藤浩治 - アスレチック",
	"近藤浩治 - Super Mario USA ／ 地上BGM",
	"七尾旅人 - Dr. Mario - Chill -Chill Clear",
	"近藤浩治 - Dr. Mario - Fever -Fever Clear",
	"近藤浩治 - Dr. Mario (Select)",
	"近藤浩治 - Dr. Mario (Title BGM)",
	"近藤浩治 - Super Mario USA (Player Select)",
	"近藤浩治 - Game Over",
	"近藤浩治 - 王様の部屋 (King's Room)",
	"近藤浩治 - キノピオの家 (Kinopio's House)",
	"近藤浩治 - オルゴール (Music Box)",
	"日本ACG - Athletic BGM",
	"近藤浩治 - Super Mario Bros. 3 (Ground Stage BGM -Warning -Ground Stage BGM)",
	"近藤浩治 - Ending Theme",
	"近藤浩治 - Ending BGM",
	"近藤浩治 - Super Mario Bros. (Water Stage BGM -Warning -Water Stage (Hurry up!))",
	"近藤浩治 - Miss -Game Over-",
	"近藤浩治 - Super Mario Bros. (Bonus Stage ／Invisible BGM -Warning -Bonus Stage BGM)",
	"近藤浩治 - Super Mario Bros. (Underground Stage BGM -Warning -Underground BGM)",
	"近藤浩治 - Stage Clear Fanfare",
	"近藤浩治 - Ground Stage BGM",
	"近藤浩治 - Mario Bros. - Game Start A -Miss -Clear - Game Start B -Restart -Extend",
	"近藤浩治 - Super Mario USA (Ground Stage BGM)",
	"日本群星 - ロックマン3 ＂スネークマン＂",
	"日本群星 - 影の伝説「メインテーマ」",
	"群星 - RETURN IN GLORY",
	"群星 - THE SHOWDOWN",
	"群星 - MEGALOPOLIS",
	"群星 - スーパー魂斗罗（FC）THUNDER LANDING～FREE WORLD～GAME OVER",
	"群星 - 魂斗罗(FC)密林の戦い~戦慄の鼓动~凯旋1",
	"群星 - スーパー魂斗罗（AC）WHAT IS THIS PLACE～THUNDER LANDING～GREAT HELI-RUINED BASE～PATTERN CLEAR NO.1",
	"コナミ矩形波倶楽部 - 魂斗罗(AC)魂斗罗~密林の戦い~迷路要塞1~ランキング",
	"群星 - GO FOWARD UNDER FIRE",
	"群星 - HELL MESSENGER",
	"群星 - DAREDEVIL",
	"コナミ矩形波倶楽部 - BATTLE RUNNER (3st BGM)",
	"コナミ矩形波倶楽部 - SELECT THE LANDING POINT (降下地点セレクトBGM)",
	"群星 - BLOODY STORM",
	"群星 - IT'S TIME FOR REVENGE",
	"コナミ矩形波倶楽部 - ALIEN WARS BEGIN",
	"群星 - コントラ（GB）密林の戦い～エンディング",
	"コナミ矩形波倶楽部 - 魂斗羅サウンドヒストリー 魂斗羅 (MSX 2)",
	"Bit Brigade - Ending",
	"Cinemechanica as Contraband - Contra (The Alien's Lair)",
	"Bit Brigade - Energy Zone",
	"Bit Brigade - Snowfield",
	"植松伸夫 - プレリュード (序曲)",
	"山根ミチル - さまよえる魂 (流浪的灵魂)",
	"日本群星 - 君よ花よ",
	"植松伸夫 - ティナのテーマ",
	"クリスタルキング、日本群星 - 愛をとりもどせ!! (把爱夺回来！！)",
	"桜庭統 - Confidence in the domination",
	"Konami Kukeiha Club、山根ミチル - Vampire Killer (悪魔城ドラキュラ(MSX2))",
	"纯音乐 - BGM1",
	"烂兔子 - FC-荒野大镖客 (Remix)",
	"纯音乐 - 洛克人3",
	"日本ACG - SNAKEMAN STAGE",
	"日本ACG - SPARKMAN STAGE",
	"日本ACG - TOPMAN STAGE",
	"日本ACG - MAGNETMAN STAGE",
	"日本ACG - GEMINIMAN STAGE",
	"日本ACG - NEEDLEMAN STAGE",
	"日本ACG - HARDMAN STAGE",
	"藤田靖明 - GET A WEAPON",
	"藤田靖明 - BOSS",
	"藤田靖明 - ENDING",
	"GMR - FC_魂斗罗&街霸",
	"FC精选合集 - 马戏团音乐合集",
	"坦克游戏 - 坦克",
	"FC精选合集 - 功夫",
	"BEYOND - 喜欢你", // 可能重复·A(高度相似)·同「軍 - 喜欢你」
	"萧敬腾 - 僵尸全明星",
	"深澤秀行 - Theme of Ken -SFIV Arrange-",
	"下村陽子 - 対武器ボス戦",
	"DJ Striden - Lights",
	"Spaze - Who You Are",
	"坂本英城 - Cathy's Theme",
	"Elecrystal Studio - 骑士之家 (片段)",
	"V.A. - Cathy角色歌",
	"南ゆに - Ray角色歌 上弦之月",
	"V.A. - Zack角色歌 危险地带",
	"山岸継司 - 鮮烈のリュウ -DW SW MIX- –リュウ・ハヤブサ–",
	"华语群星 - FC《坦克大战》战前BGM",
	"横山智佐、华语群星 - 檄!帝国華撃団 (檄! 帝国華撃団)",
	"忍者龙剑传游戏 - 忍者龙剑传",
	"忍者龙剑传 - 沙漠地区背景音乐",
	"英雄联盟 - 涅槃 (Phoenix)",
	"超级马里奥兄弟游戏 - 超级玛丽",
	"纯音乐哄睡 - 愤怒的小鸟",
)

// gg（36首）
songs.push(
	"华语群星 - 第三套全国小学生广播体操-七彩阳光",
	"网络歌手 - 第九套广播体操",
	"华语群星 - 第二套全国中学生广播体操：时代在召唤",
	"纯音乐 - 上课音乐铃声及语音提示",
	"网络歌手 - 国歌 出旗曲 升旗仪式 (伴奏)",
	"纯音乐 - 纯军训背景音乐 (59秒片段)",
	"华语群星 - 妈妈教我一支歌 (Live)",
	"华语群星 - 没有共产党就没有新中国",
	"网络歌手 - 跑操音乐",
	"阎维文 - 强军战歌",
	"战士歌舞团 - 团结就是力量",
	"小海燕少年合唱团 - 我和我的祖国", // 可能重复·B(较可能同一首)·同「李谷一 - 我和我的祖国」
	"北京市少年宫合唱团 - 我爱你，中国", // 可能重复·B(较可能同一首)·同「汪峰 - 我爱你中国」
	"小蓓蕾组合 - 学习雷锋好榜样",
	"中国人民解放军军乐团、吕蜀中、于建芳 - 义勇军进行曲",
	"中国人民解放军军乐团 - 运动员进行曲",
	"总政合唱团 - 走向复兴",
	"韩红 - 祖国不会忘记", // 可能重复·B(较可能同一首)·同「韩红 - 祖国不会忘记」
	"中央乐团交响乐队 - 春节序曲", // 可能重复·B(较可能同一首)·同「中央乐团交响乐队 - 春节序曲」
	"纯音乐 - 大气开场",
	"阎维文 - 打靶归来", // 可能重复·B(较可能同一首)·同「阎维文 - 打靶归来」
	"李谷一 - 难忘今宵", // 可能重复·B(较可能同一首)·同「李谷一 - 难忘今宵」
	"阎维文 - 一二三四歌", // 可能重复·B(较可能同一首)·同「阎维文 - 一二三四歌」
	"纯音乐 - 渔舟唱晚", // 可能重复·B(较可能同一首)·同「纯音乐 - 渔舟唱晚」
	"中央乐团合唱队 - 保卫黄河 (齐唱轮唱)(Single Version)",
	"华语群星 - 北京欢迎你",
	"蔡程昱 - 歌唱祖国 (Live)",
	"中国人民解放军军乐团、刘玉宝 - 哀乐",
	"黄华 - 毛主席的光辉",
	"宋祖英 - 爱我中华", // 可能重复·B(较可能同一首)·同「宋祖英 - 爱我中华」
	"叶翠 - 我的祖国", // 可能重复·B(较可能同一首)·同「叶翠 - 我的祖国」
	"成龙、吴京 - 中国", // 可能重复·B(较可能同一首)·同「成龙、吴京 - 中国」
	"林志玲 - 特别设计：绽放 (Live)",
	"广州军区战士歌舞团 - 我是一个兵",
	"汤非 - 当兵前的那晚上",
	"殷秀梅、程志 - 松花江上",
)

// 新白娘子传奇（108首）
songs.push(
	"左宏元 - 啊张玉堂",
	"庄蕙如 - 雨伞是媒红",
	"卓依婷 - 夫妻双双把家还",
	"林美满、张慧清 - 互报家门",
	"古月、林美满 - 硫磺原是火中精",
	"林美满、庄蕙如 - 雷锋塔前声声唤",
	"高胜美 - 千年等一回",
	"古月 - 青城山下白素贞",
	"古月 - 天下多风光",
	"古月 - 西湖美景三月天",
	"林美满 - 原来前世因缘定",
	"林美满 - 天上造物有主张",
	"古月 - 失魂落魄在金山",
	"古月 - 山明水秀半偈心",
	"林美满 - 生地卑亥金银花",
	"古月 - 欢天喜地好嘉庆",
	"古月 - 相逢咫尺间",
	"古月 - 年华似水容易过",
	"古月 - 仇王府本是黄梁地",
	"古月、林美满、庄蕙如 - 仁心仁术许汉文",
	"古月 - 患难夫妻添恩爱",
	"林美满 - 针灸之术我在行",
	"庄蕙如 - 看他孩子一模样",
	"古月 - 同行同业不同功",
	"庄蕙如 - 鹤顶剧毒太无辜",
	"古月 - 断桥重逢天安排",
	"古月 - 乌云散去天清明",
	"网络歌手 - 心湖雨又风",
	"古月 - 春秋四季上下翻",
	"古月、林美满 - 这里处处有曾经",
	"林美满 - 开言我尊一声众乡亲",
	"林美满 - 孤家寡人许汉文",
	"古月 - 夜色如酒熏人醉",
	"古月 - 梦魂飞渡关心易",
	"古月 - 桃花流水满前溪",
	"古月 - 平地一声春雷响",
	"古月 - 桥未断情未断",
	"庄蕙如 - 月有阴晴圆缺时",
	"张慧清 - 仕林他春风满面",
	"古月 - 世间红尘皆枉然",
	"古月 - 成亲",
	"庄蕙如、林美满 - 孤家寡人有情郎 豪富之家多妻房 娘子忧虑疑经常",
	"古月 - 侯门似海深重重",
	"林美满 - 娘子你飞上九重天",
	"张慧清、庄蕙如 - 前世牧童",
	"林美满、庄蕙如、张慧清 - 姐姐娇艳胜天仙",
	"张慧清、庄蕙如 - 几次解围费心机 姐姐啊",
	"古月 - 慈悲心肠白素贞",
	"百合二重唱 - 想飞的水",
	"张真、古月、吕祯晃、庄蕙如、尤景仰 - 情仇爱恨",
	"张真、吕祯晃、尤景仰、古月 - 神仙歌",
	"林美满 - 小弟本是寒门一书生",
	"张慧清、庄蕙如 - 一见宝塔怒火烧",
	"张慧清、庄蕙如 - 不羡天上鸟比翼",
	"林美满、庄蕙如 - 官人不愧是良人",
	"古月、林美满 - 一束青丝系儿身",
	"古月 - 清明上坟",
	"古月、林美满 - 十年寒窗苦读诗书经 大人壮志凌云冲霄汉 我家娘子承认去盗宝",
	"古月、庄蕙如 - 望儿面",
	"张慧清、庄蕙如 - 姐姐的修为已经两千年",
	"林美满、张慧清、庄蕙如 - 谁人是我生父母",
	"林美满 - 家有贤妻俏佳人",
	"林美满、庄蕙如 - 世人都怕鬼来缠",
	"林美满、庄蕙如 - 洞房花烛遇知己",
	"裘海正 - 纠缠",
	"FORMOSA - 悲情面具",
	"古月 - 保安堂中保安丸",
	"古月 - 默默无闻保安堂",
	"古月 - 五鬼巧做万灵丹",
	"张慧清 - 看移窗日影近黄昏",
	"林美满 - 我儿不必添悲戚",
	"古月 - 惊闻仕林病在身",
	"古月 - 爱深深恨渺渺",
	"古月 - 姑苏城中遇贵人",
	"古月 - 漫漫长夜不知晓",
	"古月 - 烟光山色淡溟朦",
	"古月 - 九重天上好时辰",
	"林美满 - 许汉文本名是许仙",
	"古月 - 夕阳如火是黄昏",
	"林美满 - 婀娜多姿俏红颜",
	"林美满 - 天与多情",
	"古月 - 春风清夜生",
	"古月 - 日月精华齐聚凝",
	"古月 - 夫妻恩爱情意重",
	"古月 - 炉火红红铁索寒",
	"庄蕙如 - 人寂寂画沉沉",
	"古月 - 普济观吕祖庆生辰",
	"林美满 - 见锦囊泪汹涌",
	"庄蕙如、张慧清 - 许仙受惊吓断魂 许仙是我恩人是我丈夫",
	"林美满、庄蕙如 - 鬼迷心窍太糊涂",
	"林美满、庄蕙如 - 娘子天生好心肠",
	"古月 - 时光迅速飞一般",
	"庄蕙如 - 心事一重重",
	"古月 - 日落西山把路迷",
	"林美满、庄蕙如 - 我与你同把端阳庆 感谢官人一片心",
	"古月 - 避难逃遁十三载",
	"古月、林美满 - 大人 白素贞心地善良",
	"庄蕙如 - 三杯酒迷了本性",
	"古月 - 巫山半路惊残梦",
	"古月 - 白素贞",
	"古月 - 紫竹林中观自在",
	"林美满 - 天降好音到许门",
	"古月 - 伴青灯黄卷",
	"林美满、古月 - 我家娘子白素贞",
	"高胜美 - 心湖雨又风",
	"古月、张慧清 - 渡情", // 可能重复·B(较可能同一首)·同「左宏元、张慧清 - 渡情」
	"叶蒨文 - 潇洒走一回", // 可能重复·B(较可能同一首)·同「叶蒨文 - 潇洒走一回」
	"高胜美 - 千年等一回 (《新白娘子传奇》片头曲｜《又见白娘子》电视剧主题曲｜《The Legend of White Snake 1992版》电视剧摇滚版主题曲)(DJ小小高版)",
)

// 西游记音乐合集（107首）
songs.push(
	"许镜清 - 助兴鹤仙舞",
	"许镜清 - 猪八戒背媳妇",
	"潘军 - 伴君常开花一朵",
	"吴静 - 别亦难 (TV版)",
	"吸引力组合 - 白龙马",
	"许镜清 - 百花羞遇险",
	"丁小青 - 被贬五行山",
	"许镜清 - 初称美猴王",
	"许镜清 - 大圣游天宫",
	"赵英俊 - 大王叫我来巡山",
	"许镜清 - 官封弼马温",
	"蒋大为 - 敢问路在何方",
	"吴静 - 何必西天万里遥",
	"许镜清 - 金殿戏巨灵",
	"许镜清 - 快乐的花果山",
	"迟重瑞 - 看我跃马扬鞭",
	"许镜清 - 梦中会御弟",
	"许镜清 - 庆功天仙曲2",
	"许镜清 - 庆功天仙曲",
	"蒋大为 - 取经归来",
	"许镜清 - 上任弼马温",
	"许镜清 - 三美戏八戒",
	"胡寅寅 - 孙悟空之歌",
	"许镜清 - 搜寻人参果",
	"许镜清 - 天王琵琶曲", // 可能重复·B(较可能同一首)·同「琵琶曲」
	"许镜清 - 天蓬戏嫦娥",
	"三叶草演唱组、崔京浩 - 通天大道宽又阔",
	"郁钧剑 - 五百年桑田沧海", // 可能重复·B(较可能同一首)
	"王立军 - 五百年桑田沧海",
	"许镜清 - 玄奘初长成",
	"许镜清 - 逍遥自在的孙大圣", // 可能重复·B(较可能同一首)·同「许镜清 - 逍遥自在的孙大圣」
	"许镜清 - 云宫迅音",
	"许镜清 - 杨戬擒悟空",
	"许镜清 - 玉帝升朝堂",
	"周立夫 - 走啊走",
	"吴静、牟玄甫 - 多少情和意",
	"许镜清 - 风雨行路难",
	"李玲玉 - 天竺少女",
	"吴静 - 女儿情", // 可能重复·B(较可能同一首)·同「吴静 - 女儿情」
	"胡寅寅 - 大圣歌",
	"祖海 - 天竺少女",
	"华夏管弦乐团 - 猪八戒背媳妇 (民乐合奏版)",
	"迟重瑞 - 晴空月儿明",
	"许镜清、多杰太阳 - 女儿情 (伴奏)", // 可能重复·B(较可能同一首)·同「吴静 - 女儿情」
	"李静娴 - 青青菩提树",
	"郁钧剑 - 吹不散这点点愁",
	"许镜清、多杰太阳 - 敢问路在何方 (伴奏)",
	"三叶草演唱组、崔京浩 - 通天大道宽又阔 (伴奏)",
	"庞龙 - 大圣歌",
	"冯珊珊 - 女儿情", // 可能重复·B(较可能同一首)·同「吴静 - 女儿情」
	"李殊 - 留不住去也难",
	"文武贝 - 看我跃马扬鞭 (钢琴版)",
	"许镜清、多杰太阳 - 取经归来 (伴奏)",
	"李静娴 - 走啊走",
	"蒋大为、黑鸭子演唱组 - 敢问路在何方",
	"华夏管弦乐团 - 普天同庆 (民乐合奏)",
	"叶毛 - 晴天月儿明",
	"许镜清、多杰太阳 - 天竺少女 (伴奏)",
	"华夏管弦乐团 - 序曲 (电视连续剧西游记)",
	"许镜清 - 敢问路在何方",
	"华夏管弦乐团 - 江流儿 (民乐合奏)",
	"华夏管弦乐团 - 仙鹤舞 (民乐合奏)",
	"黎光 - 走啊走",
	"成都市西城区少年宫合唱团 - 官封弼马温",
	"王小青 - 生无名本无姓",
	"庞龙 - 晴天月儿明",
	"李小护 - 紧箍咒",
	"纯音乐 - 放生曲",
	"许镜清 - 初进灵宵殿",
	"郭天节 - 四大天王",
	"许镜清 - 悟空巧行医",
	"许镜清 - 敢问路在何方(变奏版)1",
	"许镜清 - 天竺少女(变奏版)2",
	"许镜清 - 王母娘娘咏叹调",
	"许镜清 - 猪八戒背媳妇 (纯音乐)",
	"许镜清 - 铁扇剑释怀",
	"许镜清 - 敢问路在何方(变奏版)2",
	"许镜清 - 悟空变高小姐戏八戒",
	"许镜清 - 人参果树",
	"许镜清 - 悟空大战琵琶精",
	"许镜清 - 三清吃贡品",
	"许镜清 - 三星洞学艺",
	"许镜清 - 女儿情 (纯音乐｜53秒片段)",
	"许镜清 - 悟空得宝扇",
	"许镜清 - 绣球选佳婿",
	"许镜清 - 三美戏八戒 (无人声版)",
	"许镜清 - 赴任遭祸变",
	"许镜清 - 荒山入魔窟",
	"许镜清 - 蝎子精献艺",
	"许镜清 - 无底洞游园",
	"许镜清 - 招安上天庭",
	"许镜清 - 观音院露宝",
	"许镜清 - 幽深琵琶洞",
	"许镜清 - 重回三星观",
	"许镜清 - 白龙刺黄袍",
	"许镜清 - 贺新春",
	"许镜清 - 圣僧朝唐皇",
	"许镜清 - 端午横祸生",
	"许镜清 - 天竺少女(变奏版)1",
	"许镜清 - 仙童斥四僧",
	"纯音乐 - 逍遥自在的孙大圣", // 可能重复·B(较可能同一首)·同「许镜清 - 逍遥自在的孙大圣」
	"陈涓 - 相见难别亦难", // 可能重复·B(较可能同一首)·同「陈涓 - 相见难别亦难」
	"沫 - 怎么办自己爱上自己啦#猪八戒背媳妇小助手",
	"许镜清、叶毛 - 无底船歌", // 可能重复·B(较可能同一首)·同「许镜清、叶矛 - 无底船歌」
	"姚明 - 天府乐",
	"李玲玉 - 女儿情 (Live)", // 可能重复·B(较可能同一首)·同「吴静 - 女儿情」
	"李玲玉 - 天竺少女 (原版)",
)

// 熊出没（44首）
songs.push(
	"阿鲲 - 宝石龟",
	"占伟帆 - 爸,求你快回来",
	"占伟帆 - 出击水帘洞",
	"谭笑、张秉君、张伟 - 大明星",
	"阿鲲 - 光头强 熊二莫名被崇拜",
	"阿鲲 - 狼群最终的攻击",
	"阿鲲 - 狼群复仇",
	"白挺 - 你从未离去",
	"洪辰、宁桓宇 - 我乘着风飞过来",
	"刘晨 - 我还有点小糊涂",
	"网络歌手 - 一帅到底",
	"许晓莎 - 温暖",
	"林家睿 - 像小时候一样", // 可能重复·B(较可能同一首)·同「郁可唯 - 像小时候一样」
	"李智平 - 早安大森林",
	"尚雯婕 - 鹿 be free",
	"徐佳莹 - 我一直都在这里",
	"白挺 - 终会与你同行",
	"黄霄雲 - 重返地球",
	"Various Artists - Hi Ball Cha Cha (Main Track) (Full Length)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"纯音乐 - 猎人",
	"唐鑫 - 小紧张",
	"影视原声 - 熊出没原声", // 可能重复·C(可能同一首)·同「熊出没. - Tricks And Traps」
	"Various Artists - Slapstick (Main Track｜Full Length)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"Various Artists - Funk Shui (Main Track｜Full Length)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"Various Artists - Dum Dee Dum (Main Track｜Full Length)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"Pyotr Ilyich Tchaikovsky - 四只小天鹅",
	"Various Artists - Empty Hands (Main Track｜Full Length)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"Various Artists - Gotta Go (Main Track｜Full Length)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"Richard Clayderman - La Cumparcita",
	"Various Artists - Frantic Fire Brigade (Main Track｜Full Length)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"Various Artists - Sexy Sax (Main Track｜Full Length)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"唐鑫 - 轻松愉快2",
	"唐鑫 - 轻松愉快",
	"玛塔音乐 - 小丑",
	"唐鑫 - 偷偷摸摸 (47秒片段)",
	"Various Artists - A Sly One (Main Track) (Full Length)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"Various Artists - Tricks And Traps (Alternative Version)(Full Length)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"月下独君 - 群星 (熊出沒主題曲 (合集))",
	"熊出没. - Tricks And Traps", // 可能重复·C(可能同一首)·同「熊出没. - Tricks And Traps」
	"刘思奇 - 彩虹", // 可能重复·B(较可能同一首)·同「刘思奇 - 彩虹」
	"罗高丞 - 森林时光 (TV Verison)",
	"张伟、谭笑、张秉君、儿歌和动画精选 - 大明星",
	"郁可唯 - 像小时候一样", // 可能重复·B(较可能同一首)·同「郁可唯 - 像小时候一样」
	"网络歌手 - 熊出没主题曲", // 可能重复·C(可能同一首)·同「熊出没. - Tricks And Traps」
)

// two（66首）
songs.push(
	"乌龟组合 - 빙고 (答对了)", // 可能重复·B(较可能同一首)·同「Turtles - 빙고 (答对了)」
	"华莎 - 마리아 (María) (玛利亚)",
	"PSY - 강남스타일 (Gangnam Style)",
	"佐橋俊彦 - ツナ覚醒 (阿纲觉醒)",
	"เบลล์ นิภาดา、BOSS HAN - ให้เคอรีมาส่งได้บ่ 泰语童声 (可以让克里快递寄过来吗)(Remix)",
	"Tyomcha、Tanir - Да да да (嗯 嗯 嗯)(Jarico Remix)",
	"Бамбинтон - Зая (扎娅)", // 可能重复·A(高度相似)·同「Зая（扎娅）」
	"小阿枫 - 醉倾城", // 可能重复·B(较可能同一首)·同「小阿枫 - 醉倾城」
	"小猫多鱼 - 祝你生日快乐",
	"百石元 - 猪突猛進", // 可能重复·B(较可能同一首)·同「百石元 - 猪突猛進」
	"笑白Ermy、White Wolf Tracks - 战曲 Battle Epic Song",
	"张震岳 - 再见", // 可能重复·A(高度相似)·同「周杰伦 - 说了再见」
	"庄学忠 - 中华功夫", // 可能重复·B(较可能同一首)·同「庄学忠 - 中华功夫」
	"Lambert凌杰、十七草 - Young boss 2.0",
	"全弟 - You Spin Me Round (说唱原版)",
	"雅欣 - You Don t Know Me",
	"宝石Gem、陈伟霆 - 野狼Disco (feat.陈伟霆)",
	"黄霑 - 傲气傲笑万重浪 (终曲)",
	"纵贯线 - 爱的初体验 (Live)", // 可能重复·B(较可能同一首)·同「纵贯线 - 爱的初体验 (Live)」
	"Kaiz、Phúc Du、King Kudo - AKLGD (remix：KAIZ)", // 可能重复·C(可能同一首)·同「Kaiz、Phúc Du、King Kudo - AKLGD (KAIZ Remix)」
	"Chris Rock、Danny Jacobs - Afro Circus ／ I Like To Move It",
	"Rootkit、Anna Yvette - Against The Sun", // 可能重复·B(较可能同一首)·同「Anna Yvette、Rootkit - Against The Sun」
	"Alan Walker、Noah Cyrus、Digital Farm Animals、Juliander - All Falls Down", // 可能重复·B(较可能同一首)·同「Alan Walker、Noah Cyrus、Digital Farm Animals、Juliander - All Falls Down」
	"Achim Reichel - Aloha Heja He",
	"Rompasso - Angetenar (remix：Subkills)",
	"Vicetone、Tony Igy - Astronomia", // 可能重复·B(较可能同一首)·同「Jiaye - Astronomia」
	"LJY - Autumn (秋)", // 可能重复·B(较可能同一首)·同「可陌 - Autumn 秋」
	"Chester Young、Castion - PYRO", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"Hoàng Thùy Linh - See Tình (遇见挚爱)(Speed Up Version)",
	"Thimlife、Bibiane Z - Home (Blaze U Remix)", // 可能重复·A(高度相似)·同「Thimlife、BibianeZ - Home (Blaze U Remix)」
	"欧翠峰 - 西班牙斗牛士",
	"Mountain、LINGDURemix - ltalia e  voi (remix)", // 可能重复·A(高度相似)·同「Mountain、LINGDURemix - ltalia e  voi (Remix)」
	"DJ HAI CENA - Not the One", // 可能重复·B(较可能同一首)·同「DJ HAI CENA - Not the One (不是那个)」
	"布袋寅泰 - BATTLE WITHOUT HONOR OR HUMANITY (无差别格斗)",
	"MC赵小涣 - 王牌飞行员申请出战 (DJ版)",
	"萧全 - 动感光波",
	"BGM收集官 - 嗨害嗨我又来了",
	"灵空GTech - 皇家萌卫",
	"赖仔Morris - 非酋", // 可能重复·B(较可能同一首)·同「赖仔Morris - 非酋」
	"Sia、Alan Walker - Move Your Body (Alan Walker Remix)",
	"Rihanna - Umbrella (Grakk & Tiger Jz Remix)",
	"十三叔 - X8飞曲 (麻木版)",
	"ALan - Octopus",
	"Virtual Riot - Energy Drink", // 可能重复·B(较可能同一首)·同「Virtual Riot - Energy Drink (能量饮料)」
	"The Tokens - The Lion Sleeps Tonight (Wimoweh)(Remastered)",
	"大张伟 - 倍儿爽", // 可能重复·B(较可能同一首)·同「大张伟 - 倍儿爽」
	"Home Free - Sea Shanty Medley",
	"火箭少女101 - 卡路里",
	"Zedd、Jon Bellion - Beautiful Now",
	"X-Ray Dog - Hope Always", // 可能重复·B(较可能同一首)·同「X-Ray Dog - Hope Always」
	"Universal Idol、VodKe、HSHK、Pnan、贰皮 - Italia e voi (双枪说)",
	"Sevenn - Loco Papi",
	"米线 - 哈尼宝贝",
	"Billie Eilish - bad guy",
	"Fifth Harmony - Worth It",
	"DJ凯撒 - Lone Ranger (DJ Kaisa)", // 可能重复·C(可能同一首)·同「凯撒 - Sugar Crash (DJ Kaisa)」
	"螃蟹真疼、DJ野马 - 兰多卡兰多摇 (DJ版)",
	"海边有风浪 - 查尔斯顿舞挑战曲",
	"Music4U - Hehaha Hehoho",
	"半吨兄弟 - 最美的伤口",
	"Lady Gaga - Poker Face (remix：Makkur)", // 可能重复·B(较可能同一首)·同「Lady Gaga - Poker Face (Makkur Remix)」
	"The Cranberries - Zombie (DJ金6、DJ金6(5)版)", // 可能重复·B(较可能同一首)·同「Zombie-The Cranberries」
	"李文杰 - 杀死比尔", // 可能重复·B(较可能同一首)·同「李文杰 - 杀死比尔」
	"赵今麦、郭俊辰、姜冠南、韩沛颖、ANU - 飞",
	"锋锋 - 佛罗里达州最硬的男人",
	"G.E.M.邓紫棋 - 画 (Live Piano Session Ⅱ)",
)

// 串烧（11首）
songs.push(
	"DJ - 加快版中文网络流行歌曲劲爆串烧 - 2014年12月收录 (DJ版)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"DJ - 2010年伤感网络流行歌曲劲爆舞曲串烧 by DJ阿喜 (DJ版)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"DJ - 百听不厌全中文网络流行歌曲慢摇串烧", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"美从头开始 - 美从头开始创作的原声",
	"六哲 - 潮流串烧", // 可能重复·B(较可能同一首)·同「六哲 - 潮流串烧」
	"群星 - Joke+老司机带带我",
	"Aove - 群星-2018 Serato Recording 2 (Aove Remix)", // 可能重复·A(高度相似)·同「Aove - 群星-2018 Serato Recording 2（Aove Remix）」
	"马丹妮（丫蛋蛋）、沈虫虫 - 流行歌曲串烧", // 可能重复·B(较可能同一首)·同「丫蛋蛋(马启涵)、沈虫虫 - 流行歌曲串烧」
	"苏冬涛 - 你是我未曾拥有无法捕捉的亲昵 (DJ8先生版)",
	"青山 - 你是我未曾拥有无法捕捉的亲昵 (男生版)",
	"网络歌手 - 神曲串烧 (Live)",
)

// 花千骨（37首）
songs.push(
	"麦振鸿 - 长留山 (纯音乐)",
	"清漪 - 执念", // 可能重复·B(较可能同一首)·同「清漪 - 执念」
	"麦振鸿 - 知晓万里 (纯音乐)",
	"霍建华、赵丽颖 - 不可说", // 可能重复·B(较可能同一首)·同「霍建华、赵丽颖 - 不可说」
	"麦振鸿 - 五上仙 (纯音乐)",
	"任妙音 - 花千骨", // 可能重复·B(较可能同一首)·同「任妙音 - 花千骨」
	"麦振鸿 - 疤痕 (纯音乐)", // 可能重复·B(较可能同一首)·同「麦振鸿 - 疤痕 (纯音乐)」
	"麦振鸿 - 曾经拥有 (纯音乐)",
	"麦振鸿 - 痴颜 (纯音乐)", // 可能重复·B(较可能同一首)·同「麦振鸿 - 痴颜 (纯音乐)」
	"麦振鸿 - 倒大霉 (纯音乐)",
	"麦振鸿 - 恩断情绝 (纯音乐)",
	"麦振鸿 - 非礼勿视 (纯音乐)",
	"奇然 - 花千殇", // 可能重复·B(较可能同一首)·同「奇然 - 花千殇」
	"麦振鸿 - 戒情 (纯音乐)", // 可能重复·B(较可能同一首)·同「麦振鸿 - 戒情 (纯音乐)」
	"麦振鸿 - 乐天派 (纯音乐)",
	"马可 - 两生缘", // 可能重复·B(较可能同一首)·同「马可 - 两生缘」
	"麦振鸿 - 美人的吻 (痴颜) (纯音乐)", // 可能重复·B(较可能同一首)·同「麦振鸿 - 痴颜 (纯音乐)」
	"麦振鸿 - 念难断 (纯音乐)",
	"麦振鸿 - 七分伤 (纯音乐)",
	"麦振鸿 - 牵绊一生 (不可说) (纯音乐)",
	"张杰 - 三生三世", // 可能重复·B(较可能同一首)·同「一杨 - 三生三世」
	"麦振鸿 - 天水滴 (纯音乐)",
	"麦振鸿 - 为她而活 (纯音乐)",
	"麦振鸿 - 一心修仙 (纯音乐)",
	"麦振鸿 - 异香 (纯音乐)", // 可能重复·B(较可能同一首)·同「麦振鸿 - 异香 (纯音乐)」
	"麦振鸿 - 遵从本心 (纯音乐)",
	"F.I.R.飞儿乐团、彭佳慧 - 心之火", // 可能重复·C(可能同一首)·同「F.I.R.飞儿乐团、彭佳慧 - 心之火」
	"香香 - 就算没有如果", // 可能重复·B(较可能同一首)·同「香香 - 就算没有如果」
	"张明明 - 千般", // 可能重复·B(较可能同一首)·同「张明明 - 千般」
	"杨宗纬、张碧晨 - 凉凉 (Live)",
	"旧时月色音乐、花千骨、苏清墨 - 书途同归",
	"马健南、Shirley Jiang - 花千骨", // 可能重复·B(较可能同一首)·同「任妙音 - 花千骨」
	"霍建华、赵丽颖 - 不可说 (TV)", // 可能重复·B(较可能同一首)·同「霍建华、赵丽颖 - 不可说」
	"王亚乔 - 疤痕 (Inst.)",
	"张丹峰 - 地老天荒",
	"毛方圆 - 是夜",
	"麦振鸿 - 只相信你 (不可说) (纯音乐)",
)

// Yy（114首）
songs.push(
	"降央卓玛 - 走天涯", // 可能重复·B(较可能同一首)·同「龙梅子、老猫 - 走天涯」
	"凤凰传奇 - 自由飞翔", // 可能重复·B(较可能同一首)·同「凤凰传奇 - 自由飞翔」
	"李玲玉 - 祝福", // 可能重复·B(较可能同一首)·同「李玲玉 - 祝福」
	"凤凰传奇 - 最炫民族风 (广场舞版)", // 可能重复·B(较可能同一首)·同「凤凰传奇 - 最炫民族风 (广场舞版)」
	"徐千雅 - 坐上火车去拉萨",
	"腾格尔 - 在那遥远的地方", // 可能重复·B(较可能同一首)·同「阎维文 - 在那遥远的地方」
	"才旦卓玛 - 在北京的金山上", // 可能重复·B(较可能同一首)·同「才旦卓玛 - 北京的金山上」
	"饶天亮 - 做你的爱人", // 可能重复·B(较可能同一首)·同「饶天亮 - 做你的爱人」
	"央金兰泽 - 遇上你是我的缘",
	"龙梅子、老猫 - 爱情专属权", // 可能重复·B(较可能同一首)·同「龙梅子、老猫 - 爱情专属权」
	"张燕 - 月亮女儿", // 可能重复·B(较可能同一首)·同「张燕 - 月亮女儿」
	"刀郎、云朵 - 十送红军", // 可能重复·B(较可能同一首)·同「刀郎、云朵 - 十送红军」
	"邓丽君 - 路边的野花不要采",
	"凤凰传奇 - 我和草原有个约定", // 可能重复·B(较可能同一首)·同「凤凰传奇 - 我和草原有个约定」
	"宋祖英 - 小背篓", // 可能重复·B(较可能同一首)·同「宋祖英 - 小背篓」
	"宋祖英 - 好日子", // 可能重复·B(较可能同一首)·同「宋祖英 - 好日子」
	"乌兰托娅 - 梦高原", // 可能重复·B(较可能同一首)·同「乌兰托娅 - 梦高原」
	"网络歌手 - 绣荷包", // 可能重复·B(较可能同一首)·同「未知歌手 - 绣荷包」
	"张也 - 绣荷包", // 可能重复·B(较可能同一首)·同「未知歌手 - 绣荷包」
	"李羿慧 - 花开花落", // 可能重复·B(较可能同一首)·同「李羿慧 - 花开花落」
	"凤凰传奇 - 荷塘月色", // 可能重复·B(较可能同一首)·同「凤凰传奇 - 荷塘月色」
	"陈少华 - 九九女儿红", // 可能重复·B(较可能同一首)·同「陈少华 - 九九女儿红」
	"吕继宏、宋祖英 - 九九艳阳天",
	"陈少华 - 九月九的酒", // 可能重复·B(较可能同一首)·同「陈少华 - 九月九的酒」
	"邰正宵 - 九百九十九朵玫瑰", // 可能重复·C(可能同一首)·同「邰正宵 - 九百九十九朵玫瑰」
	"李玲玉 - 妈妈的吻", // 可能重复·B(较可能同一首)·同「李玲玉 - 妈妈的吻」
	"网络歌手 - 孟姜女", // 可能重复·B(较可能同一首)·同「宋祖英 - 孟姜女」
	"郭玲、冷漠 - 迷茫的爱", // 可能重复·B(较可能同一首)·同「郭玲、冷漠 - 迷茫的爱」
	"龙梅子、王强 - 你把爱情给了谁",
	"铃声 - 哦拉拉", // 可能重复·B(较可能同一首)·同「铃声 - 哦拉拉」
	"才旦卓玛 - 北京的金山上", // 可能重复·B(较可能同一首)·同「才旦卓玛 - 北京的金山上」
	"索朗旺姆 - 北京的金山上", // 可能重复·B(较可能同一首)·同「才旦卓玛 - 北京的金山上」
	"刀郎 - 敖包相会", // 可能重复·B(较可能同一首)·同「刀郎 - 敖包相会」
	"大庆小芳 - 敖包相恋",
	"央金兰泽 - 爱琴海", // 可能重复·B(较可能同一首)·同「央金兰泽 - 爱琴海」
	"昆明聂耳交响乐团 - 阿佤人民唱新歌 (2022 CCTV-15音乐频道精彩音乐汇现场)", // 可能重复·B(较可能同一首)·同「李玉刚 - 新贵妃醉酒 (2013CCTV-15音乐频道精彩音乐汇现场)」
	"谢军 - 阿哥阿妹", // 可能重复·B(较可能同一首)·同「余志坪 - 阿哥阿妹」
	"冯晓泉 - 冰糖葫芦", // 可能重复·B(较可能同一首)·同「冯晓泉 - 冰糖葫芦」
	"华语群星 - 北京欢迎你",
	"格格 - 雪莲", // 可能重复·B(较可能同一首)·同「格格 - 雪莲」
	"德乾旺姆 - 香巴拉并不遥远", // 可能重复·B(较可能同一首)·同「德干旺姆 - 香巴拉并不遥远」
	"才旦卓玛 - 唱支山歌给党听",
	"那英 - 春暖花开",
	"赵真、司徒兰芳 - 闯天涯", // 可能重复·B(较可能同一首)·同「司徒兰芳、赵真 - 闯天涯」
	"黄安 - 东南西北风", // 可能重复·B(较可能同一首)·同「黄安 - 东南西北风」
	"李玲玉 - 粉红色的回忆",
	"索朗扎西 - 姑娘我爱你",
	"乌兰图雅、师鹏、沙溢、胡可、云朵、云飞 - 歌舞：点赞新时代 (Live)",
	"吉克隽逸 - 歌舞：映山红 (Live)",
	"容中尔甲 - 高原红", // 可能重复·B(较可能同一首)·同「容中尔甲 - 高原红」
	"邓丽君 - 高山青", // 可能重复·B(较可能同一首)·同「邓丽君 - 高山青」
	"花儿乐队 - 化蝶飞", // 可能重复·B(较可能同一首)·同「花儿乐队 - 化蝶飞」
	"李晓杰 - 好姑娘", // 可能重复·B(较可能同一首)·同「李晓杰 - 好姑娘」
	"祖海 - 好运来", // 可能重复·B(较可能同一首)·同「祖海 - 好运来」
	"刘欢 - 好汉歌", // 可能重复·B(较可能同一首)·同「刘欢 - 好汉歌」
	"新疆美丽公主组合 - 欢乐地跳吧", // 可能重复·A(高度相似)·同「欢乐地跳吧」
	"格格 - 火苗", // 可能重复·B(较可能同一首)·同「格格 - 火苗」
	"乌兰图雅 - 火辣辣的情歌",
	"高安、黑鸭子演唱组 - 红尘情歌", // 可能重复·B(较可能同一首)·同「高安、黑鸭子组合 - 红尘情歌」
	"扎西顿珠 - 康定情歌", // 可能重复·B(较可能同一首)·同「扎西顿珠 - 康定情歌」
	"邵雨涵 - 拉拉爱", // 可能重复·B(较可能同一首)·同「邵雨涵 - 拉拉爱」
	"庞龙 - 你是我的玫瑰花", // 可能重复·B(较可能同一首)·同「王小帅 - 你是我的玫瑰花」
	"龙梅子、老猫 - 漂亮的姑娘就要嫁人啦",
	"凤凰传奇 - 全是爱", // 可能重复·A(高度相似)·同「要不要买菜 - 全是爱 (片段)」
	"李娜 - 青藏高原", // 可能重复·B(较可能同一首)·同「李娜 - 青藏高原」
	"刘尊 - 傻妹妹",
	"迟志强、张秀艳 - 十不该",
	"董文华 - 十五的月亮",
	"王二妮 - 山丹丹开花红艳艳", // 可能重复·B(较可能同一首)·同「阿宝 - 山丹丹开花红艳艳」
	"阿宝 - 山丹丹开花红艳艳", // 可能重复·B(较可能同一首)·同「阿宝 - 山丹丹开花红艳艳」
	"刘三姐 - 山歌好比春江水",
	"李琼 - 山路十八弯",
	"静妹 - 所有精神小伙听令",
	"蒋大为 - 送别", // 可能重复·B(较可能同一首)·同「蒋大为 - 送别」
	"王琪 - 送亲", // 可能重复·B(较可能同一首)·同「王琪 - 送亲」
	"山鹰组合 - 唐古拉风暴 (DJ版)",
	"凤凰传奇 - 天蓝蓝", // 可能重复·B(较可能同一首)·同「凤凰传奇 - 天蓝蓝」
	"网络歌手 - 小妹不跟你 (快四版)", // 可能重复·B(较可能同一首)·同「未知歌手 - 小妹不跟你 (快四版)」
	"乌兰图雅 - 套马杆", // 可能重复·B(较可能同一首)·同「乌兰图雅 - 套马杆」
	"邓丽君 - 甜蜜蜜",
	"徐怀钰 - 踏浪", // 可能重复·B(较可能同一首)·同「徐怀钰 - 踏浪 (Live)」
	"祖海 - 为了谁", // 可能重复·B(较可能同一首)·同「祖海 - 为了谁」
	"凤凰传奇 - 我从草原来",
	"乌兰托娅 - 我要去西藏",
	"林俊杰、蔡卓妍 - 小酒窝", // 可能重复·B(较可能同一首)·同「林俊杰、蔡卓妍 - 小酒窝 (国语版)」
	"谢军 - 心在跳情在烧",
	"凤凰传奇 - 月亮之上", // 可能重复·B(较可能同一首)·同「凤凰传奇 - 月亮之上」
	"办桌二人组 - 在心里从此永远有个你", // 可能重复·B(较可能同一首)·同「办桌二人组 - 在心里从此永远有个你」
	"胡雯 - 左眼皮跳跳", // 可能重复·B(较可能同一首)·同「金志文 - 左眼皮跳跳」
	"萨顶顶 - 左手指月 (Live)", // 可能重复·C(可能同一首)·同「萨顶顶 - 左手指月 (Live)」
	"王二妮、阿宝 - 张灯结彩",
	"古茗川 - 最炫民族风 (热门新版)",
	"旺姆、容中尔甲 - 天籁之爱 (合唱版)",
	"陈红 - 常回家看看", // 可能重复·B(较可能同一首)·同「陈红 - 常回家看看」
	"乌兰托娅 - 套马杆", // 可能重复·B(较可能同一首)·同「乌兰图雅 - 套马杆」
	"王麟、老猫 - 伤不起",
	"顾峰、斯琴高丽 - 犯错", // 可能重复·B(较可能同一首)·同「顾峰 - 犯错」
	"卓依婷 - 打锣打鼓", // 可能重复·B(较可能同一首)·同「四千金 - 打锣打鼓」
	"GARNiDELiA - 極楽浄土 (极乐净土)",
	"徐怀钰 - 分飞 (Live)", // 可能重复·C(可能同一首)·同「徐怀钰 - 分飞」
	"叶启田 - 爱拼才会赢", // 可能重复·B(较可能同一首)·同「叶启田 - 爱拼才会赢」
	"乌兰图雅 - 站在草原望北京",
	"龙梅子、老猫 - 走天涯", // 可能重复·B(较可能同一首)·同「龙梅子、老猫 - 走天涯」
	"冷漠 - 小三",
	"邓丽君 - 阿里山的姑娘",
	"李玲玉 - 情网", // 可能重复·B(较可能同一首)·同「李玲玉 - 情网」
	"卓依婷 - 冰糖葫芦", // 可能重复·B(较可能同一首)·同「冯晓泉 - 冰糖葫芦」
	"韩红 - 北京的金山上", // 可能重复·B(较可能同一首)·同「才旦卓玛 - 北京的金山上」
	"宋祖英 - 大地飞歌", // 可能重复·B(较可能同一首)·同「宋祖英 - 大地飞歌」
	"斯琴高丽、顾峰 - 犯错", // 可能重复·B(较可能同一首)·同「顾峰 - 犯错」
	"高胜美 - 风飞沙", // 可能重复·B(较可能同一首)·同「高胜美 - 风飞沙」
	"宋祖英 - 十送红军", // 可能重复·B(较可能同一首)·同「刀郎、云朵 - 十送红军」
)

// 电视剧（30首）
songs.push(
	"金琳 - 雨落长安", // 可能重复·B(较可能同一首)·同「金琳 - 雨落长安」
	"樱九 - 画骨成沙", // 可能重复·B(较可能同一首)·同「樱九 - 画骨成沙」
	"化身复仇者 - 济公1985",
	"麦振鸿、罗坚 - 天下第一",
	"胡伟立 - 初识太极", // 可能重复·B(较可能同一首)·同「胡伟立 - 初识太极」
	"游本昌 - 鞋儿破帽儿破",
	"杨庆煌 - 雪中情", // 可能重复·B(较可能同一首)·同「杨庆煌 - 雪中情」
	"刘欢 - 从头再来", // 可能重复·B(较可能同一首)·同「刘欢 - 从头再来」
	"黄霑、鲍比达 - 定情", // 可能重复·B(较可能同一首)·同「鲍比达、黄霑 - 定情」
	"黄宏、魏宗万、徐玉琨 - 弹棉花 (TV版)",
	"黎允文 - 赵子龙", // 可能重复·B(较可能同一首)·同「黎允文 - 赵子龙」
	"翟迎新 - 鬼子进村", // 可能重复·B(较可能同一首)·同「翟迎新 - 鬼子进村」
	"武聆音雄 - 六脉神剑", // 可能重复·B(较可能同一首)·同「武聆音雄 - 六脉神剑」
	"高胜美 - 千年等一回 (DJ小猫多鱼版)",
	"那英 - 三生三世十里桃花",
	"胡伟立 - 市集", // 可能重复·B(较可能同一首)·同「胡伟立 - 市集」
	"武聆音雄 - 天龙八部间奏曲 (23秒片段)",
	"罗文、甄妮 - 铁血丹心", // 可能重复·A(高度相似)·同「铁血丹心」
	"赵季平 - 王进打高俅", // 可能重复·B(较可能同一首)·同「赵季平 - 王进打高俅」
	"Y2002 - 仙剑奇缘 (琵琶版)", // 可能重复·B(较可能同一首)·同「Y2002 - 仙剑奇缘 (琵琶版)」
	"康硕Kenny - 喜剧之王 Silent Open (电影喜剧之王原声)",
	"群星 - 向天再借五百年", // 可能重复·B(较可能同一首)·同「韩磊 - 向天再借五百年」
	"孙悦 - 隐隐作痛 (杨门虎将)",
	"贾乃亮 - 炽热的青春", // 可能重复·B(较可能同一首)·同「贾乃亮 - 炽热的青春」
	"胡夏 - 如果可以（去到你去的地方）", // 可能重复·B(较可能同一首)·同「胡夏 - 如果可以 (DJ豪大大版)」
	"郁可唯 - 夙念", // 可能重复·B(较可能同一首)·同「郁可唯 - 夙念」
	"希瓜音乐 - 夜华的爱",
	"徐嘉良 - 花间", // 可能重复·A(高度相似)·同「花间」
	"小时姑娘 - 爱殇",
)

// 儿歌（66首）
songs.push(
	"儿童歌曲 - 两只老虎", // 可能重复·B(较可能同一首)·同「未知歌手 - 两只老虎」
	"美美jocie - 不怕不怕", // 可能重复·B(较可能同一首)·同「郭美美 - 不怕不怕」
	"段丽阳 - 爸爸妈妈听我说",
	"郑伊健 - 虫儿飞 (聂风版)",
	"欧阳菲菲 - 感恩的心", // 可能重复·B(较可能同一首)·同「欧阳菲菲 - 感恩的心」
	"贾玲、刘维 - 感觉自己萌萌哒",
	"凤凰传奇 - 感到幸福你就拍拍手",
	"贝乐虎 - 歌唱祖国",
	"华语群星 - 歌舞：找朋友 (Live)",
	"乐池风 - 找朋友", // 可能重复·B(较可能同一首)·同「乐池风 - 找朋友」
	"儿童歌曲、儿童歌曲 - 找朋友", // 可能重复·B(较可能同一首)·同「乐池风 - 找朋友」
	"好好（张轩睿） - 可爱小宝贝", // 可能重复·B(较可能同一首)·同「优秀少年好好 - 可爱小宝贝」
	"儿童歌曲 - 数鸭子",
	"毛阿敏 - 同一首歌", // 可能重复·B(较可能同一首)·同「毛阿敏 - 同一首歌」
	"澈子 - 玛卡巴卡",
	"王搏 - 尿床记", // 可能重复·B(较可能同一首)·同「王搏 - 尿床记」
	"杨钰莹 - 轻轻地告诉你",
	"杨烁 - 让我们荡起双桨", // 可能重复·B(较可能同一首)·同「杨烁 - 让我们荡起双桨」
	"蓝天合唱团 - 世上只有妈妈好",
	"安平 - 唐僧骑马咚那个咚",
	"刘玥含 - 小冤家 (俏皮女声)", // 可能重复·C(可能同一首)·同「刘玥含 - 小冤家 (俏皮女声版)」
	"徐怀钰 - 我是女生", // 可能重复·B(较可能同一首)·同「徐怀钰 - 我是女生」
	"花儿乐队 - 嘻唰唰", // 可能重复·B(较可能同一首)·同「花儿乐队 - 嘻唰唰」
	"大D(DLyn)、驴 - 小毛驴之歌",
	"杨烁 - 小草", // 可能重复·B(较可能同一首)·同「杨烁 - 小草」
	"青蛙乐队 - 小跳蛙", // 可能重复·B(较可能同一首)·同「青蛙乐队 - 小跳蛙」
	"火火兔 - 一闪一闪亮晶晶",
	"许美静 - 阳光总在风雨后",
	"贝瓦儿歌 - 找朋友", // 可能重复·B(较可能同一首)·同「乐池风 - 找朋友」
	"宝宝巴士 - 卖报歌",
	"儿歌多多 - 粉刷匠",
	"贝瓦儿歌 - 两只老虎", // 可能重复·B(较可能同一首)·同「未知歌手 - 两只老虎」
	"李希侃SayKan - 青春舞曲 (Live)", // 可能重复·B(较可能同一首)·同「王洛宾、李毓敏 - 青春舞曲」
	"儿童儿歌故事 - 春天在哪里",
	"小蓓蕾组合 - 小二郎",
	"蓝天合唱团 - 让我们荡起双桨", // 可能重复·B(较可能同一首)·同「杨烁 - 让我们荡起双桨」
	"中央人民广播电台少年儿童合唱团 - 大风车",
	"华语群星 - 我们是共产党主义接班人",
	"贝瓦儿歌 - 蓝精灵之歌",
	"儿童歌曲 - 大头儿子和小头爸爸",
	"成毅 - 歌唱二小放牛郎",
	"贝乐虎儿歌 - 洋娃娃和小熊跳舞",
	"小蓓蕾组合 - 歌声与微笑",
	"儿歌多多 - 同一首歌 (哄睡儿歌)",
	"杨烁 - 小燕子",
	"贝瓦儿歌 - 字母歌",
	"贝乐虎儿歌 - 数鸭子",
	"儿歌多多 - 一分钱",
	"纯音乐哄睡 - 愤怒的小鸟",
	"宋小睿 - 我和你", // 可能重复·B(较可能同一首)·同「宋小睿 - 我和你」
	"林妙可 - 爱我你就抱抱我",
	"Gelato - 兔子舞",
	"儿歌多多 - 蜗牛与黄鹂鸟",
	"贝瓦儿歌 - 茉莉花", // 可能重复·B(较可能同一首)·同「贝瓦儿歌 - 茉莉花」
	"VIVI - 开心往前飞",
	"贝瓦儿歌 - 妈妈教我一支歌",
	"张浩东 - 小小少年",
	"宝宝巴士 - 世上只有妈妈好",
	"韩雪、关晓彤、魏大勋、王嘉、台风少年团 - 歌舞：青春畅想 (Live)",
	"青春美少女 - Happy Baby", // 可能重复·A(高度相似)·同「青春美少女 - HAPPY Baby」
	"青春美少女 - 快乐宝贝1997版 (happy baby)", // 可能重复·A(高度相似)·同「青春美少女 - HAPPY Baby」
	"巧乐兹儿 - 小草", // 可能重复·B(较可能同一首)·同「杨烁 - 小草」
	"吸引力组合、人之初成长乐园 - 一个师傅仨徒弟", // 可能重复·B(较可能同一首)·同「吸引力合唱组 - 一个师傅仨徒弟」
	"EY刘德祥 - 洋娃娃和小熊跳舞 (钢琴2级)",
	"书香气 - 178 【起床音乐会】 3-6岁 谁说没有好听的中文儿歌？ ｜ 第七十七期",
)

// 改编/鬼畜/片段/DJ（352首）
songs.push(
	"未知歌手 - 可惜没如果 (鼓点版)", // 顾依辰版（鼓点版缺）
	"董丫丫 - 说谎 (片段)",
	"馒头 - 变态单身狗", // 可能重复·B(较可能同一首)·同「馒头 - 变态单身狗」
	"07 - 奥利给",
	"华语群星 - 爸爸去哪儿 (11秒改编版片段)",
	"宿敌(片段)--黎林添娇", //
	"梦柯 - 菠萝咒", // 可能重复·B(较可能同一首)·同「梦柯 - 菠萝咒」
	"网络歌手 - 创作的原声 (片段)", // 可能重复·B(较可能同一首)·同「未知歌手 - 创作的原声 (片段)」
	"祺明 - 吃鸡手势舞 (DJ版)",
	"阿溪 - 床头吵架床尾和 (片段)",
	"赵俊飞 - 抽烟只抽煊赫门", // 可能重复·C(可能同一首)·同「赵俊飞 - 抽烟只抽煊赫门」
	"依邦妮 - 大猩猩舞 (DJ版)",
	"未知歌手 - 大话西游 (9秒片段)",
	"澈子 - 当你被塞班洗脑后 (20秒片段)",
	"沈熙 - 凤舞九天", // 可能重复·B(较可能同一首)·同「沈熙 - 凤舞九天」
	"馒头 - 肥宅快乐歌", // 可能重复·B(较可能同一首)·同「馒头 - 肥宅快乐歌」
	"孟颖 - 飞 (网友改编)",
	"王建荣 - 公虾米", // 可能重复·B(较可能同一首)·同「王建荣 - 公虾米」
	"YangYang - 关机又关机",
	"馒头 - 挂科版凉凉 (《凉凉》改编版)", // 可能重复·B(较可能同一首)·同「馒头 - 挂科版凉凉 (《凉凉》改编版)」
	"西游记 - 搞笑 (唐僧跑妞)",
	"BOSS HAN - 搞笑音乐",
	"馒头 - 鬼才会想起", // 可能重复·B(较可能同一首)·同「馒头 - 鬼才会想起」
	"网络歌手 - 嗨害嗨 (20秒片段)",
	"锋锋 - 囍啊囍 (绿茶版)", // 可能重复·B(较可能同一首)·同「锋锋 - 囍啊囍 (绿茶版)」
	"张伟进 - 猴哥", // 可能重复·B(较可能同一首)·同「张伟进 - 猴哥」
	"馒头 - 画个圈圈祝福你",
	"苏伟杰 - 红伞伞白杆杆",
	"馒头 - 红昭愿 (知否版)", // 可能重复·B(较可能同一首)·同「馒头 - 红昭愿 (知否版)」
	"杭天琪 - 黄土高坡", // 可能重复·B(较可能同一首)·同「杭天琪 - 黄土高坡」
	"小伊伊 - 黑人抬棺 (唢呐版)",
	"零柒 - 九张机 (王者荣耀版)",
	"迪总 - 今夜星光闪闪", // 可能重复·B(较可能同一首)·同「迪总 - 今夜星光闪闪」
	"馒头 - 加薪歌", // 可能重复·B(较可能同一首)·同「馒头 - 加薪歌」
	"肖琴、刘小满 - 姐姐微信来了 (DJ版)",
	"赵俊铭 - 鲸落WF End (35秒钢琴版片段)", // 可能重复·B(较可能同一首)·同「赵俊铭 - 鲸落WF End (钢琴版片段)」
	"MOONBOI（杨望舒）、李开心 - 可不可以给我你的微信", // 可能重复·A(高度相似)·同「MOONBOI(杨望舒)、李开心 - 可不可以给我你的微信」
	"网络歌手 - 可不可以 (20秒改编版片段)",
	"野小马 - 可不可以 (26秒改编版片段)",
	"雪二 - 可不可以 (18秒改编版片段)",
	"馒头 - 可不可以 (假日版)",
	"何鹏、金久哲 - 嗑儿 (DJ何鹏版)",
	"馒头 - 我是一条酸菜鱼",
	"馒头 - 两只野狗在恋爱",
	"腾金涛 - 卢本伟", // 可能重复·B(较可能同一首)·同「腾金涛 - 卢本伟」
	"馒头 - 撸串之歌", // 可能重复·B(较可能同一首)·同「馒头 - 撸串之歌」
	"馒头 - 旅行青蛙好害怕",
	"网络歌手 - 梁志超他奶奶",
	"馒头 - 期末之歌 (Single Version)",
	"馒头 - 最炫猪肉风", // 可能重复·B(较可能同一首)·同「馒头 - 最炫猪肉风」
	"馒头 - 我的对象啊", // 可能重复·B(较可能同一首)·同「馒头 - 我的对象啊」
	"馒头 - 生僻字", // 可能重复·B(较可能同一首)·同「馒头 - 生僻字」
	"馒头 - 沙漠骆驼", // 可能重复·B(较可能同一首)·同「馒头 - 沙漠骆驼 (馒头版)」
	"馒头 - おどるポンポコリン",
	"馒头 - 我还追个鬼",
	"馒头 - 胖人愁 (变音版)", // 可能重复·B(较可能同一首)·同「馒头 - 胖人愁 (变音版)」
	"馒头 - 穷的响叮当", // 可能重复·B(较可能同一首)·同「馒头 - 穷的响叮当」
	"馒头 - 胖胖的白羊", // 可能重复·B(较可能同一首)·同「馒头 - 胖胖的白羊」
	"馒头 - 灭霸之歌", // 可能重复·B(较可能同一首)·同「馒头 - 灭霸之歌」
	"馒头 - 吃的是啥东西", // 可能重复·B(较可能同一首)·同「馒头 - 吃的是啥东西」
	"馒头 - 嘤嘤嘤", // 可能重复·B(较可能同一首)·同「馒头 - 嘤嘤嘤」
	"馒头 - 小屁孩你快走开",
	"馒头 - 妈妈再打我一次",
	"馒头 - 你是我的平底锅",
	"馒头 - 苏大强之歌", // 可能重复·B(较可能同一首)·同「馒头 - 苏大强之歌」
	"馒头 - 123喝热水 (59秒Live片段)",
	"馒头 - 胖胖之歌", // 可能重复·B(较可能同一首)·同「馒头 - 胖胖之歌」
	"馒头 - 你的酒馆为我烤了羊,我就当酒馆的老板娘 (DJ长音频)",
	"馒头 - 浪里个浪", // 可能重复·B(较可能同一首)·同「馒头 - 浪里个浪」
	"馒头 - 我是不是你最疼爱的人，你为什么不打钱",
	"猫有饼 - 38度6 (41秒吃鸡版片段)",
	"Y2002 - 澜拿蓝 (王者版)",
	"拼音师 - 老八秘制小汉堡",
	"朵儿超甜鸭 - 老六", // 可能重复·B(较可能同一首)·同「朵儿超甜鸭 - 老六」
	"网络歌手 - 铃儿响叮当 (10秒改编版片段)",
	"小鸟伏特加 - 雷霆嘎巴", // 可能重复·B(较可能同一首)·同「小鸟伏特加 - 雷霆嘎巴」
	"搬运工 - 每个人的身上都有毛毛",
	"抽象带篮子 - 野心千万种 (Original Mix)",
	"王小帅 - 你是我的玫瑰花", // 可能重复·B(较可能同一首)·同「王小帅 - 你是我的玫瑰花」
	"浪子金 - 拿着青春陪你赌",
	"南方北方 - 盘他",
	"冰冰淇淋 - 破碎英文 (BGM)",
	"_咕噜咕噜 - 胖头娃娃舞 (12秒DJ版片段)",
	"黄文文 - 骑上我心爱的小摩托",
	"官硕 - 如此包装",
	"自信的阿呆 - Rumors",
	"攀娘、吴石九、扎哥 - 三天不打上房揭瓦 (32秒片段)",
	"宋瑞、竭容生 - 三条腿的蛤蟆找不着,两条腿的女人多的是",
	"小阿诺 - 上天安排的最大 (Remix)",
	"精彩轩迪 - 山前山后各有哀愁",
	"纯音乐 - 沙雕之歌", // 可能重复·B(较可能同一首)·同「沙雕少年可乐君、言和 - 沙雕之歌」
	"杨硕哥哥 - 生僻字 (完整电晕版)",
	"网络歌手 - 生僻字 (15秒学生考试版片段)",
	"未知歌手 - 耍猴儿 (片段)", // 可能重复·B(较可能同一首)·同「未知歌手 - 耍猴儿 (片段)」
	"小乐颜 - 天空之城 (说唱版)",
	"MC小太妹 - 天空之城 (特别版)", // 可能重复·B(较可能同一首)·同「小太妹 - 天空之城 (特别版)」
	"张一诺 - 天空之城 (吉他版)",
	"R7 - 桃花运 (DJR7版)",
	"黄英杰 - 万恶之源的完整版。",
	"8先生 - 万有引力", // 可能重复·B(较可能同一首)·同「8先生 - 万有引力 (吃鸡版)」
	"新地、卢克 - 我不是刘德华",
	"有点焦绿 - 我叫安琪拉",
	"自信的渐选 - 我和我的牛马兄弟",
	"来一碗老于 - 我好想你 (28秒片段)",
	"孔柏森 - 我爱他 (14秒片段)",
	"武昌理工学院合唱 - 我的天空 (高考版)",
	"蘑菇头 - 我的将军啊 (考试版)",
	"DJ - 我的草原我的马 (10秒DJ版片段)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"吴小兮 - 挖草 (DJ版)",
	"网络歌手 - 挖掘机技术哪家强？",
	"旺仔小乔 - 我还是 (20秒片段)",
	"任宇翔 - 稳住别浪 (王者荣耀鬼畜版)",
	"小明同志 - 给贫民百万做歌星的歌迷",
	"赵马熙汝 - 喜欢你 (翻唱版)", // 可能重复·A(高度相似)·同「軍 - 喜欢你」
	"石仙、张龙、杜支村、谭琳 - 小粽子 (小苹果改编版)",
	"拼音师 - 小鸟伏特加", // 可能重复·B(较可能同一首)·同「小鸟伏特加 - 雷霆嘎巴」
	"伶伶er - 小鸟伏特加", // 可能重复·B(较可能同一首)·同「小鸟伏特加 - 雷霆嘎巴」
	"颜一 - 心酸", // 可能重复·B(较可能同一首)·同「颜一 - 心酸」
	"梁炜️（黄瓜哥） - 新娘嫁人了新郎不是我",
	"好多倩 - 熊出没 + 喜洋洋与灰太狼 + 大耳朵图图 + 猪猪侠 + 巴啦啦小魔仙 (40秒片段)",
	"MC彪先生 - 一人我考驾照",
	"纯音乐 - 一生要走多远的路程 (15秒片段)",
	"Heaven J - 鱿鱼游戏 (123木头人)",
	"冰绎 - 最伟大的作品",
	"诗黎安 - 终是庄周梦了蝶",
	"华语群星 - 这个老六我真的服了",
	"全球音乐吧 - 13年前的这首歌要是放到现在,依旧是不可超越的神曲,太洗脑!",
	"网络歌手 - 38度6 (苏谭谭)", // 可能重复·B(较可能同一首)·同「未知歌手 - 38度6 (苏谭谭)」
	"李文踹 - 38度6 (烧烤版)",
	"伤过的心谁来弥补 - 38度6 (改编版)", // 可能重复·B(较可能同一首)·同「馒头 - 38度6」
	"云凌蘑菇头 - 38度6 (改编版)", // 可能重复·B(较可能同一首)·同「馒头 - 38度6」
	"宾哥 - 38度6 (改编版)", // 可能重复·B(较可能同一首)·同「馒头 - 38度6」
	"搞笑蘑菇君 - 38度6 (改编版)", // 可能重复·B(较可能同一首)·同「馒头 - 38度6」
	"网络歌手 - 38度6 (改编版)", // 可能重复·B(较可能同一首)·同「馒头 - 38度6」
	"黑龙 - 38度6 (DJ小鱼儿版)", // 可能重复·B(较可能同一首)·同「馒头 - 38度6」
	"黑龙 - 38度6", // 可能重复·B(较可能同一首)·同「馒头 - 38度6」
	"张有道 - 蓝色海黑色河",
	"赵今麦、郭俊辰、姜冠南、韩沛颖、ANU - 飞",
	"锋锋 - 佛罗里达州最硬的男人",
	"嘿嘿嘿 - 鸡你太美", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"天泽 - 奥利给,干了兄弟们!",
	"MC赵小涣 - 王牌飞行员申请出战 (DJ版)",
	"萧全 - 动感光波",
	"小佳 - 秒针 (女声版)", // 可能重复·B(较可能同一首)·同「阿梨粤 - 秒针」
	"DJ YiXiu、小奶瓶、苏可可、竭容生 - 点头yes摇头no",
	"网络歌手 - 少年 (23秒网课版片段)",
	"DJ - 你搞偷袭你玩不起", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"潮音哥 - 一giao我里giao",
	"DJ - 梁志超他奶 (DJ版)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"抢九 - 老六", // 可能重复·B(较可能同一首)·同「朵儿超甜鸭 - 老六」
	"自信的南辞 - 这 个 老 六 我 真 的 服 了",
	"旦色Music - 无中生有暗度陈仓",
	"王亚鹏 - 身法大佬专用BGM",
	"Singers after 00 - 伞兵一号卢本伟 (remix： Aya)",
	"Time - 电摇小子", // 可能重复·C(可能同一首)·同「Cat naps - time」
	"张大仪 - 卢本伟广场",
	"拼音师 - 卢本伟-全体起立 (Remix)", // 可能重复·B(较可能同一首)·同「腾金涛 - 卢本伟」
	"翟迎新 - 鬼子进村", // 可能重复·B(较可能同一首)·同「翟迎新 - 鬼子进村」
	"白小白、高火火 - 大话西游 (16秒片段)",
	"沙雕少年可乐君、言和 - 沙雕之歌", // 可能重复·B(较可能同一首)·同「沙雕少年可乐君、言和 - 沙雕之歌」
	"鬼畜阿精 - 奥利给 (58秒DJ版片段)",
	"DJ - 老师一回头 (44秒DJ版片段)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"怀逸-nshim - 鸡你太美", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"P.W.W.画风风 - giao我里giao (片段)",
	"吴小兮 - 你搞偷袭你玩不起", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"DJ Titon - 死机之歌",
	"拼音师 - 金坷垃2020",
	"余轩、G.z Boom$ - 8848488钛金手机",
	"7爷、Faded、扎职、KUAIS - 小朋友你是否有很多问号 (DJ版)",
	"Kevin MacLeod - Breaktime",
	"搬运工、潮妹、Y2002 - 吹喇叭之一桌八个菜",
	"雷军、Mr.Lemon - Are You OK",
	"段兴华 - 我害怕鬼", // 可能重复·B(较可能同一首)·同「段兴华 - 我害怕鬼」
	"网络歌手 - 神曲串烧 (Live)",
	"e中人 - 江南Style (我爸刚弄死他)",
	"洛天依、初音ミク - 江南皮革厂 (DJ版)",
	"萍爷 - Как вы哦NO哦NO",
	"苏三 - 秘制小汉堡",
	"网络歌手 - 我没空 (17秒搞笑版片段)",
	"澈子 - 睡觉前听这个",
	"澈子 - 此时在家的你",
	"HERO-科艺-P、洛天依、言和 - 达拉崩吧 (钉钉版)",
	"BGHY苏刚、花臂轩 - 泰式蹦迪",
	"Various Artists - 玛丽医生 (乡村民谣版)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"五条人 - 阿珍爱上了阿强",
	"Gigi D'Agostino - The Riddle (混音)",
	"梅尼耶 - The Riddle (口哨版)",
	"ShalomTeck - Circus (Explicit)",
	"网友贝多芬 - 你在狗叫什么",
	"纯音乐 - 诡异恐怖音效",
	"小猫多鱼 - 祝你生日快乐",
	"拼音师 - 接化发",
	"跟风超人 - 你打不过我吧",
	"官云康 - 所以到哪里都像快乐被燃起",
	"000x - 酒喝不尽磕唠不完",
	"DJ - 鸡你太美 (DJ版)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"迪总 - 江归江山归山 (57秒DJ版｜片段)",
	"芦文文 - 惊呆了老铁",
	"说者瑞泽 - 再见王者荣耀2",
	"DJ - 说谎 (DJ赵小涣)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"董丫丫 - 说谎 (15秒片段)",
	"南辞、泽亦龙 - 总有一天我会变得特别特别优秀 (第三版)",
	"面具锋 - 霸王别姬", // 可能重复·B(较可能同一首)·同「面具锋 - 霸王别姬」
	"吃鸡王者荣耀小仔爷 - 吃鸡王者荣耀小仔爷原声 (56秒片段)", // 可能重复·B(较可能同一首)·同「吃鸡王者荣耀小仔爷 - 吃鸡王者荣耀小仔爷原声 (片段)」
	"李佩琪 - 改革春风吹满地 (24秒片段)",
	"6诗人 - 卡布奇诺", // 可能重复·B(较可能同一首)·同「6诗人 - 卡布奇诺」
	"曹珅 - 可不可以给我你的微信", // 可能重复·A(高度相似)·同「MOONBOI(杨望舒)、李开心 - 可不可以给我你的微信」
	"美味 - 可不可以 (36秒片段)",
	"李少白 - 你男朋友很差",
	"深七 - 你说别再笑了", // 可能重复·B(较可能同一首)·同「深七 - 你说别再笑了」
	"W.K. - 逆战 (王者荣耀版)",
	"情词尧、李哈哈 - 小女子不才",
	"兮妹 - 人最大的烦恼就是记性太好",
	"小抖 - 你的良心告诉我",
	"覃晨皓 - 晨皓精选热门旋律 (DJ版)",
	"小智慧 - 世俗总要男人无惧无畏 (Remix)",
	"陈丙 - 这是我兄弟脑袋被驴踢了",
	"宝藏挖掘机 - 《梦见我们相遇》索菲亚：真的再见到你，再次拥抱你在怀里 (长音频)",
	"张雪峰 - 一人我饮酒醉 (考研版)",
	"转鹿 - Crazy Dave IN-GAME", // 可能重复·B(较可能同一首)·同「转鹿 - Crazy Dave IN-GAME」
	"旺仔小乔 - 剑伤 (15秒片段)",
	"5媚娘 - 拥抱星河万里",
	"苏泽 - 脚艺人", // 可能重复·B(较可能同一首)·同「苏泽 - 脚艺人 (DJ版)」
	"网络歌手 - Animals (金坷垃)",
	"7宇 - 7宇版小毛驴一起摇",
	"仇远旭 - 一格格 (粤语女版)",
	"邢衷晓 - 如果说你曾苦过我的甜",
	"小小奶黄包 - Samsara (0.8×)",
	"铭哥哦 - 冲动的惩罚 (改编版)", // 可能重复·C(可能同一首)·同「刀郎 - 冲动的惩罚」
	"DJ、快手神曲 - 出山 (DJ版)", // 可能重复·B(较可能同一首)·同「花粥、王胜娚 - 出山」
	"李秋实 - 抽烟只抽煊赫门 (片段)", // 可能重复·C(可能同一首)·同「赵俊飞 - 抽烟只抽煊赫门」
	"苏静 - 沉稳总在爱意里翻船",
	"鱼闪闪BLING - 沉醉的青丝 (Live片段)",
	"姜鹏Calm - 猜不透 (29秒Live片段)",
	"爱弹琴的涵妹 - 倒数 (33秒Live片段)",
	"邓寓君(等什么君) - 冬眠 (20秒片段)",
	"馒头 - 大哥大姐如果你要骂我就请这样骂",
	"璐爷 - 大天蓬 (弹唱片段)", // 可能重复·B(较可能同一首)·同「李袁杰 - 大天蓬」
	"馒头 - 大家好，给大家介绍一下",
	"可以喜欢我吗 - 当你走了 (改编版)", // 可能重复·C(可能同一首)·同「吾尊 - 当你走了」
	"阿禹ayy - 盗墓笔记·十年人间 (32秒片段)",
	"锦零 - 豆花之歌 (Demo版)", // 可能重复·C(可能同一首)·同「锦零 - 豆花之歌」
	"Jessica - Fractures (24秒片段)",
	"旺仔小乔 - 光的方向 (16秒片段)",
	"藤竹京 - 孤独 (31秒片段)",
	"网络歌手 - 孤雏 (18秒0.8x片段)",
	"四只烤翅 - 耿 (四合院版)",
	"二嘉 - 后来的我们 (57秒片段)",
	"李鑫ya - 好想爱这个世界啊 (片段)", // 可能重复·C(可能同一首)·同「李鑫ya - 好想爱这个世界啊 (片段)」
	"李鑫ya - 剑伤 (13秒片段)",
	"姜鹏Calm - 即兴 (长音频)",
	"就是南方凯 - 即兴 (28秒片段)",
	"旺仔小乔 - 嘉宾 (15秒片段)",
	"蓝心羽 - 寂寞烟火 (32秒片段)",
	"浪子楚阳 - 江海不渡你 (烟嗓版片段)", // 可能重复·C(可能同一首)·同「MC浪子楚阳 - 江海不渡你 (烟嗓版)」
	"en (王翊恩) - 可不可以 (56秒片段)",
	"DJ - Color", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"Zealot周星星 - 流离 (28秒片段)",
	"萌小新、李哈哈 - 萝莉哭了",
	"蓝心羽 - 落 (44秒片段)",
	"DJ YiXiu - 落叶",
	"刘亦心（可乐就是力量） - Lover Boy 88 (19秒片段)",
	"澈子 - 玛卡巴卡",
	"蜜雪冰城 - 蜜雪冰城主题曲", // 可能重复·B(较可能同一首)·同「蜜雪冰城 - 蜜雪冰城主题曲 (官方版)」
	"曹万江 - 你要结婚了",
	"洛天依 - 哪凉快到哪待着去",
	"刘大壮 - 偏爱 (14秒片段)",
	"顾小柒 - 怕的不是等 是等不到",
	"小咪 - 我走后 (Live片段)", // 可能重复·A(高度相似)·同「小咪-我走后」
	"来一碗老于 - 我走后 (13秒片段)",
	"徐泽（要不要买菜） - 全是爱 (18秒片段)",
	"就是南方凯 - 信仰 (30秒片段)",
	"是二智呀 - 修炼爱情 (20秒片段)",
	"秦晓疯 - 喜欢你", // 可能重复·A(高度相似)·同「軍 - 喜欢你」
	"天才 - 天龙八部之宿敌 (片段)", // 可能重复·A(高度相似)·同「天龙八部之宿敌--许嵩」
	"网络歌手 - 淘汰 (20秒片段)",
	"白雲兮、DJ家兴、寐加岛 - 我还能把你抢回来", // 可能重复·A(高度相似)·同「我还能把你抢回来」
	"大D(DLyn)、驴 - 小毛驴之歌",
	"不是花火呀 - 善变 (17秒片段)",
	"林达浪 - 不找了 (15秒片段)",
	"静妹 - 所有精神小伙听令",
	"P.W.W.画风风 - 关于我们",
	"馒头 - 挂科版凉凉", // 可能重复·B(较可能同一首)·同「馒头 - 挂科版凉凉 (《凉凉》改编版)」
	"高陵区锦阳杰百货店 - 帝国解散曲配的上你",
	"搬运工 - 反正他都不难受",
	"我不是法法 - 预谋 (枪声版)",
	"阿祥 - 预谋 (阿祥 Remix)", // 可能重复·B(较可能同一首)·同「岑溪阿祥 - 预谋 (阿祥 Remix)」
	"梓冷 - 情不知所起一往而深",
	"克然Eli、Pary、苏克 - 情书",
	"冯靖凯 - 晴天 (14秒片段)",
	"竭容生 - 起风了 (校园版)", // 可能重复·B(较可能同一首)·同「未知歌手 - 起风了 (校园版)」
	"北川同学. - 日不落 (37秒片段)",
	"旺仔小乔 - 失控 (14秒片段)",
	"华语群星 - 水星记 (15秒片段)",
	"嘿狐狸 - 溯 (Reverse) (22秒Live片段)",
	"旺仔小乔 - 溯 (Reverse) (16秒女声版片段)",
	"网络歌手 - 盛夏的果实 (20秒片段)",
	"胡胖 - 外婆的澎湖湾 (40秒片段)",
	"林达浪 - 忘记拥抱 (12秒片段)",
	"DJ - 我的歌声里 (12秒DJ版片段)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"姚六一 - 雾里 (DJ版｜片段)", // 可能重复·C(可能同一首)·同「姚六一 - 雾里」
	"王靖雯 - 星辰大海 (15秒片段)",
	"隔壁老樊_樊凯杰 - 一个人想着一个人 (20秒片段)",
	"旺仔小乔 - 一吻天荒 (12秒片段)",
	"网络歌手 - 一次就好 (DJ版)", // 可能重复·B(较可能同一首)·同「未知歌手 - 一次就好 (DJ版)」
	"啊宝儿鸭、刘星宇lxy - 一笑倾城 (26秒片段)",
	"浅影阿 - 一笑江湖 (18秒DJ版片段)",
	"王靖雯 - 云与海 (14秒片段)",
	"刘大壮 - 勇气 (16秒Live片段)",
	"余超颖 - 勇气 (35秒片段)",
	"万能青年 - 庸人自扰 (18秒片段)",
	"藤竹京 - 庸人自扰 (19秒片段)",
	"井胧 - 庸人自扰 (20秒片段)",
	"澈子 - 月亮不睡你不睡 (Live)", // 可能重复·C(可能同一首)·同「Die - 月亮不睡你不睡」
	"宋雅萌 - 月亮惹的祸 (DJ版)", // 可能重复·B(较可能同一首)·同「张宇 - 月亮惹的祸」
	"王不醒 - 月老掉线 (DJ阿卓、DJ阿龙版)", // 可能重复·B(较可能同一首)·同「王不醒 - 月老掉线」
	"助眠纯音乐 - 有没有人告诉你 (萨克斯版)", // 可能重复·C(可能同一首)·同「陈楚生 - 有没有人告诉你」
	"方季惟 - 怨苍天变了心", // 可能重复·A(高度相似)·同「怨苍天变了心」
	"康乐、名决 - 樱花树下的约定 (咚鼓版)",
	"旺仔小乔 - 永不失联的爱 (15秒片段)",
	"Ersen0306 - 烟火里的尘埃 (24秒片段)",
	"云澤Zeo - 烟火里的尘埃 (Live)", // 可能重复·A(高度相似)·同「艾辰 - 烟火里的尘埃」
	"叫宝宝 - 烟花易冷 (13秒片段)",
	"是二智呀 - 疑心病 (18秒片段)",
	"闻人听書_ - 虞兮叹 (DJ沈念版)", // 可能重复·B(较可能同一首)·同「闻人听書_ - 虞兮叹」
	"张振轩、蕾蕾的小麦霸们 - 赢在江湖 (童声版)", // 可能重复·C(可能同一首)·同「姜鹏 - 赢在江湖」
	"在忠 - 遇到 (DJ梦菲版)",
	"孙燕姿 - 遇见 (DJ版)", // 可能重复·B(较可能同一首)·同「孙燕姿 - 遇见 (DJ版)」
	"221小伙伴 - 遥远的你 (59秒室友合唱版片段)",
	"不是花火呀 - 陨落 (Live片段)", // 可能重复·C(可能同一首)·同「不是花火呀 - 陨落」
	"刘大壮 - 做我老婆好不好 (15秒Live片段)", // 可能重复·A(高度相似)·同「做我老婆好不好」
	"徐誉滕 - 做我老婆好不好 (DJ浪子兮版)", // 可能重复·A(高度相似)·同「做我老婆好不好」
	"刘大壮 - 再见 (10秒片段)",
	"王津凯 - 再见 (22秒Live片段)",
	"王巨星 - 再见 (29秒片段)",
	"不够 - 只是太爱你 (18秒片段)",
	"慢热的气球 - 在你的身边 (片段)", // 可能重复·B(较可能同一首)·同「慢热的气球 - 在你的身边 (片段)」
	"小乐哥（王唯乐） - 执迷不悟 (DJ版)", // 可能重复·C(可能同一首)·同「小乐哥（王唯乐） - 执迷不悟」
	"未知歌手 - 自由飞翔 (27秒片段)",
	"沐泽 - 这一拜",
	"李鑫ya - 这个年纪 (12秒片段)",
	"刘大壮 - 这个年纪 (13秒片段)",
	"纯音乐 - 浮生皆纵 恍如一梦",
	"刘大壮 - 说了再见 (17秒片段)",
	"DreamSky - 七月七日晴 (不敢睁开眼希望是我的幻觉)(喊叫版纯享片段)",
	"王桑 - 一起走过的日子 (钢琴)",
	"Nicky - 说散就散 (弹唱版)", // 可能重复·A(高度相似)·同「说散就散-袁娅维TIA RAY」
	"DJ - 舞动音乐 (DJ版片段)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"DP龙猪 - 风吹一夏 (片段)", // 可能重复·C(可能同一首)
	"刘大壮 - 勇气 (Live片段)",
	"Yiu玥 - 老男孩 (Live片段)",
	"是二智呀 - 修炼爱情 (片段)", // 移动到 片段
)

// 动画片（49首）
songs.push(
	"儿童歌曲、原声带 - 少年英雄小哪吒 (纯音乐)", // 可能重复·B(较可能同一首)·同「未知歌手 - 少年英雄小哪吒 (纯音乐)」
	"MAKE-UP - 圣斗士星矢主题曲 (天马座幻想)", // 可能重复·C(可能同一首)·同「MAKE-UP - ペガサス幻想」
	"姜必群 - 围棋少年",
	"杨阳、想一想、哎呦喂 - 呼噜歌",
	"毛华锋 - 奇迹再现", // 可能重复·B(较可能同一首)·同「毛华锋 - 奇迹再现 (DJ J.C.Zhou版)」
	"吸引力组合、人之初成长乐园 - 一个师傅仨徒弟", // 可能重复·B(较可能同一首)·同「吸引力合唱组 - 一个师傅仨徒弟」
	"spongebob - 《海绵宝宝》主题曲", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"古倩敏 - 别看我只是一只羊",
	"吴应炬 - 葫芦娃 (片尾曲)",
	"杨沛宜 - 别看我只是一只羊",
	"杨沛宜 - 左手右手", // 可能重复·B(较可能同一首)·同「杨沛宜 - 左手右手」
	"金海心 - 别看我小",
	"儿童歌曲 - 碧波摇篮曲", // 可能重复·B(较可能同一首)·同「未知歌手 - 碧波摇篮曲」
	"刘罡、陈洁丽 - 超兽武装",
	"陈致逸 - 命运战士",
	"陈致逸 - 光的战役",
	"唐俊迪、张志林 - 不败的英雄", // 可能重复·C(可能同一首)·同「来一碗老于 - 不败的英雄 (片段)」
	"潘松和 - 青春之火",
	"杨采钰 - 少年英雄小哪吒", // 可能重复·B(较可能同一首)·同「未知歌手 - 少年英雄小哪吒 (纯音乐)」
	"樊竹青 - 白龙马",
	"杨菲洋 - 开心往前飞 (TV Version)",
	"水晶蝶 - 情动",
	"胡彦斌 - 月光 (LPCD)", // 可能重复·B(较可能同一首)·同「徐良、阿悄 - 月光」
	"卢文韬 - 誓约",
	"菅田将暉 - 虹",
	"Duca - 夢をかなえてドラえもん (实现梦想的哆啦A梦)",
	"禹丁洁 - 心中想的还是他",
	"袁接伟 - 人生不过一百年",
	"和田光司 - Butter-Fly", // 可能重复·C(可能同一首)·同「ANU - FLY」
	"十二生肖闯江湖动画 - 十二生肖闯江湖",
	"陈洁丽、陆双、祖丽晴、王巍 - 疯狂果宝",
	"钟茵波 - 人生如棋",
	"周游格 - 小英雄大肚腩", // 可能重复·A(高度相似)·同「筷子兄弟 - 老男孩 (Live)」
	"周元恒 - 问题小孩",
	"王心凌 - 梦的光点", // 可能重复·B(较可能同一首)·同「王心凌 - 梦的光点」
	"胡彦斌 - 月光", // 可能重复·B(较可能同一首)·同「徐良、阿悄 - 月光」
	"牛奶咖啡 - 快乐星猫",
	"Jessie J - Flashlight (From ＂Pitch Perfect 2＂ Soundtrack)",
	"林俊杰 - 爱不会绝迹", // 可能重复·B(较可能同一首)·同「林俊杰 - 爱不会绝迹」
	"彭雨菲 - 超级棒棒糖", // 可能重复·B(较可能同一首)·同「彭雨菲 - 超级棒棒糖」
	"书香气 - 178 【起床音乐会】 3-6岁 谁说没有好听的中文儿歌？ ｜ 第七十七期",
	"儿童歌曲 - 大头儿子和小头爸爸",
	"叫ぶ獣 - 剑指苍茫",
	"邵雨涵 - 拉拉爱", // 可能重复·B(较可能同一首)·同「邵雨涵 - 拉拉爱」
	"贝瓦儿歌 - 蓝精灵之歌",
	"段丽阳 - 小孩的梦", // 可能重复·B(较可能同一首)·同「段丽阳 - 小孩的梦」
	"老男孩 - 小英雄大肚腩 - 周游格", // 可能重复·A(高度相似)·同「筷子兄弟 - 老男孩 (Live)」
	"陈洁丽 - 猪猪侠", // 可能重复·B(较可能同一首)·同「陈洁丽 - 猪猪侠」
	"MAKE-UP - ペガサス幻想 (天马座幻想)", // 可能重复·C(可能同一首)·同「MAKE-UP - ペガサス幻想」
)

// 。（109首）
songs.push(
	"Capo Productions - Journey",
	"Fri、TomLeevis - Leevis",
	"OMFG - Hello (你好)",
	"K-391 - Summertime (夏日时光)",
	"Janji - Shadows",
	"Approaching Nirvana - You", // 可能重复·B(较可能同一首)·同「Approaching Nirvana - You」
	"The Kid LAROI、Justin Bieber - STAY (Clean)", // 可能重复·B(较可能同一首)·同「The Kid LAROI、Justin Bieber - STAY (Clean)」
	"Mark Petrie、Danny McCarthy - Rags To Rings", // 可能重复·B(较可能同一首)·同「纯音乐 - rags to rings」
	"SeVen.13 - Limitless (无限)",
	"Mark Petrie - Go Time (Full Length)(Main Track)",
	"Klaus Badelt - He's a Pirate + To The Pirates' Cave! (网友改编)",
	"Dreamtale - Intro", // 可能重复·B(较可能同一首)·同「The xx - Intro (前奏)」
	"Maroon 5 - Animals", // 可能重复·B(较可能同一首)·同「Maroon 5 - Animals」
	"July - Somewhere",
	"久石让 - Summer (菊次郎的夏天)(PIANO VER.)", // 可能重复·B(较可能同一首)·同「久石让 - Summer (菊次郎的夏天)」
	"TheFatRat - Unity (原版伴奏)", // 可能重复·B(较可能同一首)·同「TheFatRat - Unity (团结)」
	"Xomu - Lanterns",
	"Queen - We Will Rock You", // 可能重复·A(高度相似)·同「We Will Rock You」
	"Silent Partner - Spring In My Step",
	"Kevin MacLeod - Carefree",
	"Thomas Greenberg - Easy Breeze",
	"Far Out、Karra - Constellation",
	"Alan Walker - Force",
	"Vexento - Return Of The Raver",
	"Alan Walker - Spectre", // 可能重复·B(较可能同一首)·同「Alan Walker - The Spectre」
	"Tobu - Hope (Original Mix)",
	"Pascal Letoublon - Friendships (Original Mix)",
	"Vicetone、Tony Igy - Astronomia", // 可能重复·B(较可能同一首)·同「Jiaye - Astronomia」
	"Jiaye - Fade Again",
	"Alex Skrindo、Verdial - Emotions",
	"阳山伟伟 - 送给未来的你",
	"Tobu - Seven",
	"Mark Pride - River Flows In You (你的心河)(Original Mix)",
	"Janji - Horizon (地平线)", // 可能重复·B(较可能同一首)·同「Ahxello - Horizon (地平线)」
	"Two Steps From Hell - Star Sky (DJ阳山伟伟版)",
	"Alan Walker、K-391、Sofia Carson、CORSAK胡梦周 - Different World",
	"Alan Walker、A$AP Rocky、Kameron - Live Fast (PUBGM)",
	"Axero - Waves (波浪)(Radio Edit)",
	"Hinkik - Outbreaker (突破者)",
	"Tobu - Candyland",
	"Kirara Magic - Chrono",
	"Kadenza - Timeless",
	"Alan Walker、Sabrina Carpenter、Farruko - On My Way (Explicit)",
	"Hellberg、Cozi Zuehlsdorff - The Girl",
	"Alok、John Martin - Wherever You Go (feat. John Martin)",
	"Mountain、LINGDURemix - ltalia e  voi (remix)", // 可能重复·A(高度相似)·同「Mountain、LINGDURemix - ltalia e  voi (Remix)」
	"Imagine Dragons、JID - ENEMY (宿敌)",
	"Mike Perry、Casso - Inside the Lines",
	"24KGoldn、iann dior - Mood (Explicit)",
	"Caviare - Lost",
	"Alan Walker、Against The Current - Legends Never Die (remix：Alan Walker)",
	"KSHMR、Tungevaag - Close Your Eyes",
	"Martin Garrix、David Guetta、Jamie Scott、Romy Dya - So Far Away",
	"Professor Green - In The Shadow Of The Sun",
	"Lulleaux、Kid Princess - Empty Love",
	"Fall Out Boy - My Songs Know What You Did in the Dark（Light 'Em Up）",
	"Nightwish - She Is My Sin",
	"Nightwish - I Want My Tears Back",
	"Tobu - Mesmerize",
	"Josh Vietti - Because of You (因你而起)",
	"Twisted Jukebox - Angels Will Rise",
	"Two Steps From Hell、Thomas Bergersen - Jump!",
	"三上优妹 - 梦里寻他千百度",
	"沈乐、梓迪 - 再战南天门",
	"Tobu、Itro - Sunburst",
	"DJ林颜 - Take It Easy",
	"何友 - 最新经典笛子开场舞曲 (DJ版)",
	"莫尘 - 刘二狗战歌 (伴奏)",
	"黄锦城 - 舞魂热场music (Remix)",
	"枫总、在忠、小奶瓶、秦晓疯 - Outside (Remix)", // 可能重复·C(可能同一首)·同「Calvin Harris、Ellie Goulding - Outside」
	"废博 - Believe AMG",
	"Vikki Leigh - Salt", // 可能重复·B(较可能同一首)·同「未知歌手 - Salt (DJ版)」
	"Mangoo - Eurodancer",
	"Nightwish - Bye Bye Beautiful", // 可能重复·B(较可能同一首)·同「Nightwish - Bye Bye Beautiful (DJ Orkidea Remix)」
	"Within Temptation 诱惑本质 - Faster (Radio Edit)",
	"Owl City、Carly Rae Jepsen - Good Time", // 可能重复·B(较可能同一首)·同「Ultimate Party Jams (最强派对混音)、Ultimate Party Jams - Good Time」
	"David Guetta、Vassy、Showtek - Bad (Radio Edit)",
	"Alan Walker、ISÁK - Sorry",
	"Rachel Platten - Lone Ranger",
	"Fall Out Boy - The Phoenix",
	"John The Whistler - Wild Wild Web",
	"Lenzi、Soriani、Sily - Poker Face (Extended Mix)",
	"NOXMU - Tomorrow",
	"秣茴 - 我饮酒老闭登 (DJ版)",
	"张碧晨 - 开往早晨的午夜 (Live)",
	"6诗人 - 卡布奇诺", // 可能重复·B(较可能同一首)·同「6诗人 - 卡布奇诺」
	"林俊杰 - 江南", // 可能重复·A(高度相似)
	"林俊杰 - 交换余生 (Live)", // 可能重复·C(可能同一首)·同「林俊杰 - 交换余生 (Live)」
	"黄雅莉 - 蝴蝶泉边 (Live)",
	"茂茂呀 - 洪荒之力 (越南鼓)",
	"新疆美丽公主组合 - 欢乐的跳吧",
	"李宗盛 - 鬼迷心窍 (Live)", // 可能重复·B(较可能同一首)·同「李宗盛 - 鬼迷心窍」
	"许巍 - 故乡", // 可能重复·C(可能同一首)·同「许巍 - 故乡 (Live)」
	"Jarico - Fiery Sky (Inst_)", // 可能重复·B(较可能同一首)·同「Jarico - Fiery Sky」
	"Tanir & Tyomcha - Da Da Da", // 可能重复·B(较可能同一首)·同「蒋先生、DJ阿金、李安芳 - DA DA DA」
	"火风 - 大花轿", // 可能重复·B(较可能同一首)·同「火风 - 大花轿」
	"高胜美 - 大约在冬季", // 可能重复·B(较可能同一首)·同「齐秦 - 大约在冬季」
	"James Newton Howard - Chase Across DC",
	"林俊杰 - 曹操", // 可能重复·A(高度相似)·同「曹操-林俊杰」
	"王菲 - 匆匆那年", // 可能重复·B(较可能同一首)·同「王菲 - 匆匆那年」
	"精彩高迪 - Asphyxi窒息 (治愈)",
	"Justin Bieber、Big Sean - As Long As You Love Me",
	"来一碗老于 - 那些你很冒险的梦 + 修炼爱情 (16秒片段)",
	"Else - Paris (巴黎)",
	"纯音乐 - 倩女幽魂", // 可能重复·B(较可能同一首)·同「纯音乐 - 倩女幽魂」
	"南辰Music - 琴师 (二胡版)",
	"赵海洋 - 秋的思念 (钢琴曲)",
	"彭小胖 - 缺憾", // 可能重复·B(较可能同一首)·同「彭小胖 - 缺憾」
	"DJ花神经 - 世间万物 (DJ版)",
)

// 重复（59首）
songs.push(
	"刘德华 - 暗里着迷", // 可能重复·A(高度相似)·同「吉他的天空 - 暗里着迷」
	"刘德华 - 冰雨",
	"刘大壮 - 可惜不是你", // 可能重复·B(较可能同一首)·同「刘大壮 - 可惜不是你」
	"刘艺雯 - 听闻远方有你", // 可能重复·B(较可能同一首)·同「刘钧 - 听闻远方有你」
	"曲肖冰 - 天亮以前说再见", // 可能重复·A(高度相似)·同「天亮以前说再见」
	"夏天Alex - 不再联系", // 可能重复·B(较可能同一首)·同「程响 - 不再联系」
	"苏永康 - 爱一个人好难", // 可能重复·B(较可能同一首)·同「白小白 - 爱一个人好难」·同「我创建·默认收藏」
	"龙梅子、老猫 - 爱情专属权", // 可能重复·B(较可能同一首)·同「龙梅子、老猫 - 爱情专属权」·同「我创建·Yy」
	"龚玥 - 爱琴海", // 可能重复·B(较可能同一首)·同「央金兰泽 - 爱琴海」
	"Rompasso - Angetenar (remix：Subkills)", // 同「我创建·two」
	"精彩高迪 - Asphyxi窒息 (治愈)", // 同「我创建·。」
	"王小帅 - 不是因为寂寞才想你", // 可能重复·A(高度相似)·同「T.R.Y - 不是因为寂寞才想你」
	"封茗囧菌 - 处处吻", // 可能重复·B(较可能同一首)·同「杨千嬅 - 处处吻」
	"Michael Forster、Hans Zimmer、alex gibson、Anna Stevens、Ryan Rubin - Cornfield Chase (原野追逐)(Piano-Cello Version)",
	"卓依婷 - 东南西北风", // 可能重复·B(较可能同一首)·同「黄安 - 东南西北风」
	"高胜美 - 大约在冬季", // 可能重复·B(较可能同一首)·同「齐秦 - 大约在冬季」·同「我创建·。」
	"蒋蒋、曲肖冰 - 当真", // 可能重复·B(较可能同一首)·同「野小马 - 当真」
	"许茹芸 - 独角戏", // 可能重复·B(较可能同一首)·同「薛之谦 - 独角戏 (Live)」
	"文武贝 - 繁华的寂静", // 可能重复·B(较可能同一首)·同「文武贝 - 繁华的寂静」
	"李玉刚 - 刚好遇见你 (DJ Ain听说家族版)",
	"刘彬濠 - 后来遇见他", // 可能重复·B(较可能同一首)·同「刘彬濠 - 后来遇见他」
	"高进 - 怀念青春 (Live)", // 可能重复·B(较可能同一首)·同「小洲 - 怀念青春」
	"金贵晟 - 虹之间 (DJ版)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」
	"小潘潘（潘柚彤） - 黄梅戏 (流行唱腔版)", // 可能重复·A(高度相似)·同「小潘潘(潘柚彤) - 黄梅戏 (流行唱腔版)」
	"路飞文 - 嘉宾", // 可能重复·B(较可能同一首)·同「张远 - 嘉宾」
	"苏晗 - 寂寞沙洲冷", // 可能重复·B(较可能同一首)·同「刘大壮 - 寂寞沙洲冷 (片段)」
	"陈泫孝 - 静悄悄", // 可能重复·B(较可能同一首)·同「陈泫孝(大泫) - 静悄悄」
	"任然 - 空空如也", // 可能重复·B(较可能同一首)·同「胡66 - 空空如也」
	"高胜美 - 恋曲1990", // 可能重复·B(较可能同一首)·同「罗大佑 - 恋曲1990」
	"香香 - 老鼠爱大米 (2017版)",
	"小蓝背心 - 目及皆是你 (心跳版)", // 可能重复·B(较可能同一首)·同「小蓝背心 - 目及皆是你」
	"张信哲 - 信仰", // 可能重复·B(较可能同一首)·同「就是南方凯 - 信仰 (片段)」
	"蔡国庆 - 同一首歌", // 可能重复·B(较可能同一首)·同「毛阿敏 - 同一首歌」
	"乌兰图雅 - 套马杆", // 可能重复·B(较可能同一首)·同「乌兰图雅 - 套马杆」·同「我创建·Yy」
	"七叔（叶泽浩） - 踏山河 (DjYaha版)", // 可能重复·B(较可能同一首)·同「七叔（叶泽浩） - 踏山河」
	"降央卓玛 - 我和草原有个约定", // 可能重复·B(较可能同一首)·同「凤凰传奇 - 我和草原有个约定」
	"李哈哈 - 我的将军啊", // 可能重复·B(较可能同一首)·同「半阳 - 我的将军啊」
	"Hillsong Young & Free - Wake (Studio)",
	"Kristian Kostov - Wolves", // 可能重复·B(较可能同一首)·同「Mia Love、James Major - Wolves」
	"冷漠 - 小三 (DJ版)",
	"虎二 - 不仅仅是喜欢", // 可能重复·B(较可能同一首)·同「孙语赛、萧全 - 不仅仅是喜欢」
	"半吨兄弟 - 伤心城市", // 可能重复·B(较可能同一首)·同「冷漠 - 伤心城市」
	"卓依婷 - 十五的月亮",
	"吕口口 - 失忆",
	"彭铭 - Asphyxia", // 可能重复·B(较可能同一首)·同「逆时针向 - Asphyxia」
	"LJY - Autumn (秋)", // 可能重复·B(较可能同一首)·同「可陌 - Autumn 秋」·同「我创建·two」
	"许冠杰 - 沧海一声笑", // 可能重复·B(较可能同一首)·同「黄霑、罗大佑、徐克 - 沧海一声笑」
	"黄霑 - 男儿当自强", // 可能重复·B(较可能同一首)·同「黄霑 - 男儿当自强」
	"子芮 - 让我做你的眼睛", // 可能重复·B(较可能同一首)·同「魏小然 - 让我做你的眼睛」
	"王小帅 - 怨苍天变了心 (吉他版)", // 可能重复·A(高度相似)·同「怨苍天变了心」
	"王晴 - 月半小夜曲", // 可能重复·B(较可能同一首)·同「李克勤 - 月半小夜曲」
	"旺仔小乔 - 樱花树下的约定", // 可能重复·B(较可能同一首)·同「柯柯柯啊 - 樱花树下的约定」
	"小洲 - 再见只是陌生人 (Live)", // 可能重复·C(可能同一首)·同「庄心妍 - 再见只是陌生人」
	"高安 - 在心里从此永远有个你", // 可能重复·B(较可能同一首)·同「办桌二人组 - 在心里从此永远有个你」
	"阿木 - 最浪漫的事", // 可能重复·B(较可能同一首)·同「赵咏华 - 最浪漫的事」
	"四一三 - Track In Time (钢琴版)", // 可能重复·C(可能同一首)·同「Dennis Kuo - Track in Time」
	"拾贰 - 失恋不怪她阵线联盟",
	"张远 - 嘉宾", // 可能重复·B(较可能同一首)
)

// 我的2023年度歌单（10首）
songs.push(
	"许嵩 - 天龙八部之宿敌", // 可能重复·A(高度相似)·同「天龙八部之宿敌--许嵩」
	"七元 - IF", // 可能重复·A(高度相似)·同「丁可 - If」
	"朱添泽 - 等", // 可能重复·B(较可能同一首)·同「朱添泽 - 等」
	"烟(许佳豪) - 再见我的女孩",
	"新街口组合、Mona Lavi - 暗恋过 结局呢",
	"Vexento - Anesthesia (沉沦)",
	"莫叫弟弟 - 爱囚", // 可能重复·B(较可能同一首)·同「莫叫弟弟 - 爱囚」
	"hea2t - 恋殇", // 可能重复·B(较可能同一首)·同「hea2t - 恋殇」
	"Rauf & Faik - Колыбельная (摇篮曲)(Kolybel'naja)", // 可能重复·B(较可能同一首)·同「Rauf & Faik - Колыбельная (摇篮曲)(Kolybel'naja)」
	"刘思涵 - 走在冷风中", // 可能重复·B(较可能同一首)·同「刘思涵 - 走在冷风中」
)

// 纯音乐/伴奏（4首）
songs.push(
	"别后忘忧 - 遗失的心跳", // 可能重复·B(较可能同一首)·同「萧亚轩 - 遗失的心跳」
	"黄圣依 - 只要为你活一天 (伴奏)", // 可能重复·C(可能同一首)·同「黄圣依 - 只要为你活一天」
	"Diary - 相许 (纯享)", // 同「我创建·默认收藏」
	"拼音师BGM - 旋律曲1 (孤独万岁)",
)

// one（76首）
songs.push(
	"Dennis Kuo - Track in Time", // 可能重复·C(可能同一首)·同「Dennis Kuo - Track in Time」
	"四一三 - Track In Time (钢琴版)", // 可能重复·C(可能同一首)·同「Dennis Kuo - Track in Time」
	"阿YueYue、戾格、小田音乐社 - 沈园外", // 可能重复·A(高度相似)·同「沈园外」
	"徐泽（要不要买菜） - 多情种", // 可能重复·A(高度相似)·同「要不要买菜 - 全是爱 (片段)」
	"小咪 - 我走后", // 可能重复·A(高度相似)·同「小咪-我走后」
	"周传雄 - 冬天的秘密", // 可能重复·B(较可能同一首)·同「张家旺 - 冬天的秘密 (片段)」
	"烟(许佳豪) - 再见我的女孩",
	"刘惜君 - 倩女幽魂", // 可能重复·B(较可能同一首)·同「纯音乐 - 倩女幽魂」
	"庄心妍 - 以后的以后", // 可能重复·B(较可能同一首)·同「庄心妍 - 以后的以后」
	"欢子 - 于心何忍", // 可能重复·B(较可能同一首)·同「欢子 - 于心何忍」
	"牙牙乐、格子兮 - 秋殇别恋",
	"小小浩、文博 - 学生时代2",
	"张碧晨 - 不要忘记我爱你",
	"任然 - 无人之岛", // 可能重复·B(较可能同一首)·同「任然 - 无人之岛」
	"Shang、lil sophy - 断线",
	"阿桑 - 寂寞在唱歌", // 可能重复·B(较可能同一首)·同「阿桑 - 寂寞在唱歌」
	"宋冬野 - 安和桥", // 可能重复·B(较可能同一首)·同「宋冬野 - 安和桥」
	"Glimmer of Blooms - Can't Get You out Of My Head",
	"姜玉阳 - 痛彻心扉", // 可能重复·B(较可能同一首)·同「姜玉阳 - 痛彻心扉」
	"张杰、张碧晨 - 只要平凡", // 可能重复·B(较可能同一首)·同「张杰、张碧晨 - 只要平凡」
	"困困了鱼 - 败方MVP结算画面",
	"听风Xyi - 世间遗憾皆是温柔",
	"刘思涵 - 走在冷风中", // 可能重复·B(较可能同一首)·同「刘思涵 - 走在冷风中」
	"周林枫 - 忘了", // 可能重复·A(高度相似)·同「周林枫 - 忘了」
	"王靖雯 - 忘了没有", // 可能重复·B(较可能同一首)·同「王靖雯 - 忘了没有」
	"锤娜丽莎 - 我太笨", // 可能重复·B(较可能同一首)·同「锤娜丽莎 - 我太笨」
	"胜屿 - 我们说好的", // 可能重复·B(较可能同一首)·同「胜屿 - 我们说好的」
	"三分半 - 别用浪漫伤害我",
	"吴忧吴虑 - Call of Silence (钢琴版)", // 可能重复·B(较可能同一首)·同「吴忧吴虑 - Call of Silence (钢琴版)」
	"比莉 - Dear John",
	"王梦露 - 世本常态", // 可能重复·B(较可能同一首)·同「王梦露 - 世本常态」
	"郭顶 - 凄美地",
	"柯柯柯啊 - 姑娘别哭泣 (弹唱版)", // 可能重复·C(可能同一首)·同「柯柯柯啊 - 姑娘别哭泣 (弹唱版)」
	"谢宇伦 - 夜半", // 可能重复·B(较可能同一首)·同「谢宇伦 - 夜半」
	"北筱 - 好好生活 (Remix)",
	"张碧晨 - 笼", // 可能重复·B(较可能同一首)·同「张碧晨 - 笼」
	"新街口组合、Mona Lavi - 暗恋过 结局呢",
	"MC天子、夏沫MOMO - 不爱又何必纠缠",
	"光泽 - 空心", // 可能重复·B(较可能同一首)·同「光泽 - 空心」
	"黄小琥 - 没那么简单", // 可能重复·B(较可能同一首)·同「黄小琥 - 没那么简单」
	"王雨桐 - 太阳", // 可能重复·B(较可能同一首)·同「王雨桐 - 太阳」
	"薛之谦 - 演员", // 可能重复·B(较可能同一首)·同「薛之谦 - 演员」
	"刘大壮 - 一吻天荒 (吉他版)", // 可能重复·C(可能同一首)·同「刘大壮 - 一吻天荒 (吉他版)」
	"The Piano Guys - Rolling in the Deep",
	"The Chainsmokers、Coldplay - Something Just Like This (网友改编)", // 可能重复·B(较可能同一首)·同「暖豪 - Something Just Like This (Live)」
	"残雪 - 弃佛入魔", // 可能重复·B(较可能同一首)·同「残雪 - 弃佛入魔」
	"梦柯 - 曾经的王", // 可能重复·B(较可能同一首)·同「梦柯 - 曾经的王」
	"深七 - 你说别再笑了", // 可能重复·B(较可能同一首)·同「深七 - 你说别再笑了」·同「我创建·改编/鬼畜/片段/DJ」
	"搬运工 - 反正他都不难受", // 同「我创建·改编/鬼畜/片段/DJ」
	"DJ - 说谎 (DJ赵小涣)", // 可能重复·A(高度相似)·同「未知歌手 - 说谎 (DJ赵小涣)」·同「我创建·改编/鬼畜/片段/DJ」
	"000x - 酒喝不尽磕唠不完", // 同「我创建·改编/鬼畜/片段/DJ」
	"李克勤、周深 - 天下有情人 (Live)",
	"柳爽-漠河舞厅", // 可能重复·B(较可能同一首)
	"赵方婧 - 尽头", // 可能重复·B(较可能同一首)·同「赵方婧 - 尽头」
	"何文宇 - 不配念旧", // 可能重复·B(较可能同一首)·同「何文宇 - 不配念旧」
	"齐会超 - 爱了给了伤了痛了", // 可能重复·B(较可能同一首)·同「齐会超 - 爱了给了伤了痛了」
	"虎二 - 你应该很快乐", // 可能重复·B(较可能同一首)·同「虎二 - 你应该很快乐」
	"小洲 - 怀念青春", // 可能重复·B(较可能同一首)·同「小洲 - 怀念青春」
	"张小九 - 余香", // 可能重复·B(较可能同一首)·同「张小九 - 余香」
	"孙耀威 - 爱的故事(上集)", // 可能重复·B(较可能同一首)·同「孙耀威 - 爱的故事(上集)」
	"周杰伦 - 说了再见 (钢琴版)", // 可能重复·A(高度相似)·同「周杰伦 - 说了再见」
	"张泽熙 - 那个女孩", // 可能重复·B(较可能同一首)·同「张泽熙 - 那个女孩」
	"G.E.M.邓紫棋 - 泡沫", // 可能重复·A(高度相似)·同「泡沫」
	"威仔、格子兮 - 我知道你不爱我",
	"许嵩 - 天龙八部之宿敌", // 可能重复·A(高度相似)·同「天龙八部之宿敌--许嵩」
	"吸猫大师 - 《zhurek 中文翻唱》：有点好听~很难不喜欢",
	"松紧先生 李宗锦 - 你走",
	"潘成（皮卡潘） - 白鸽乌鸦相爱的戏码", // 可能重复·B(较可能同一首)·同「潘成（皮卡潘） - 白鸽乌鸦相爱的戏码」
	"福禄寿FloruitShow - 我用什么把你留住 (Live)", // 可能重复·C(可能同一首)·同「福禄寿FloruitShow - 我用什么把你留住 (Live)」
	"旺仔加真露 - 若把你", // 可能重复·B(较可能同一首)·同「旺仔加真露 - 若把你」
	"封茗囧菌 - 童话镇 (Demo版)", // 可能重复·B(较可能同一首)·同「童话镇-陈一发儿」
	"徐嘉良 - 花间", // 可能重复·A(高度相似)·同「花间」·同「我创建·电视剧」
	"Kam Ridr - Luvsic (忧郁鼓点)",
	"庾澄庆 - 春泥",
	"苏打绿-我好想你",
	"尚士达 - 生而为人", // 可能重复·B(较可能同一首)·同「尚士达 - 生而为人」
)

// 我的2024概念版年度歌单（10首）
songs.push(
	"困困了鱼 - 败方MVP结算画面",
	"小咪 - 我走后", // 可能重复·A(高度相似)·同「小咪-我走后」
	"张杰、张碧晨 - 只要平凡", // 可能重复·B(较可能同一首)·同「张杰、张碧晨 - 只要平凡」
	"Dennis Kuo - Track in Time", // 可能重复·C(可能同一首)·同「Dennis Kuo - Track in Time」
	"四一三 - Track In Time (钢琴版)", // 可能重复·C(可能同一首)·同「Dennis Kuo - Track in Time」
	"阿YueYue、戾格、小田音乐社 - 沈园外", // 可能重复·A(高度相似)·同「沈园外」
	"锤娜丽莎 - 我太笨", // 可能重复·B(较可能同一首)·同「锤娜丽莎 - 我太笨」
	"Glimmer of Blooms - Can't Get You out Of My Head",
	"刘思涵 - 走在冷风中", // 可能重复·B(较可能同一首)·同「刘思涵 - 走在冷风中」
	"烟(许佳豪) - 再见我的女孩",
)

// 每日歌曲推荐20250131（30首）
songs.push(
	"VodKe - Pure Ocean",
	"巫里堡堡、甘梅粉 - 风经过告诉我 (说你很想我)",
	"藤柒吖 - Take Me Hand (温柔版)",
	"Jordann - Dehors (外面)(Single Version)",
	"怪阿姨 - 羡慕风羡慕雨",
	"陈楚生 - 有没有人告诉你", // 可能重复·C(可能同一首)·同「陈楚生 - 有没有人告诉你」
	"杜天宇 - 期盼明天",
	"Max Oazo、Moonessa - Once Upon A Time (House Mix)",
	"吉星出租 - 转身即心痛",
	"CHROMANCE - Wrap Me In Plastic", // 可能重复·B(较可能同一首)·同「모모랜드 (MOMOLAND)、CHROMANCE - Wrap Me In Plastic」
	"Adam Christopher - So Far Away (Acoustic)",
	"TypeD、Veysigz - My Way (风可以越过荆棘)",
	"戴羽彤 - 醒不来的梦 (抒情版)",
	"丛铭君 - 听说", // 可能重复·B(较可能同一首)·同「刘若英 - 听说」
	"王睿卓 - 重生之我在异乡为异客 (纯享版)", // 同「我创建·默认收藏」
	"大宝、IN-K - 回忆观影券 (纯音乐)",
	"张杰 - 只要平凡", // 可能重复·B(较可能同一首)·同「张杰、张碧晨 - 只要平凡」
	"童珺 - 天下有情人 (国语版)",
	"木小雅 - 可能否 (新版)", // 可能重复·B(较可能同一首)·同「冷雪儿 - 可能否」
	"吴东旭 - 妈妈的话", // 可能重复·B(较可能同一首)·同「Zyboy忠宇 - 妈妈的话」
	"四熹丸子 - 天亮以前说再见 (雪花多舍不得冬天)", // 可能重复·A(高度相似)·同「天亮以前说再见」
	"王小乱 - 不挽留没回头", // 可能重复·C(可能同一首)·同「王小乱 - 不挽留没回头 (DJ版)」
	"大壮 - 伪装",
	"傅梦彤 - 潮汐 (Natural)", // 可能重复·B(较可能同一首)·同「IN-K、安苏羽、傅梦彤 - 潮汐(Natural)」
	"叮叮喵 - 幻昼 (钢琴版)", // 可能重复·C(可能同一首)·同「幻昼」
	"于洋 - 一开始说陪你到老的人现在他还在吗",
	"勿 - 探故知 (0.8x混响版)",
	"Quinn - Lifestyle (舍友要出门了)",
	"乐仙人 - 解忧曲 (钢琴版)", // 可能重复·C(可能同一首)·同「小班同学 - 解忧曲 (纯音乐版)」
	"陈大本事 - 想你这件事 (吉他版)", // 可能重复·C(可能同一首)·同「烟(许佳豪) - 想你这件事」
)

// 状态-步行赶路（1首）
songs.push(
	"BOSS HAN - You混搭 (DJ版)",
)

// to（4首）
songs.push(
	"冰冰超人 - 八年的爱", // 可能重复·B(较可能同一首)·同「冰冰超人 - 八年的爱」
	"你郝兄 - 往后余生 (不见)", // 可能重复·A(高度相似)·同「你郝兄 - 往后余生（不见）」
	"曾惜 - 讲真的", // 可能重复·A(高度相似)·同「讲真的」
	"杜宣达 - 原来我从未忘记你",
)

// 3（5首）
songs.push(
	"赵照 - 当你老了 (2012版)",
	"那英 - 默 (XXXDAION0.8X版)",
	"XXXTentacion - NUMB", // 可能重复·C(可能同一首)·同「XXXTentacion - NUMB」
	"麦振鸿、罗坚 - 天下第一", // 同「我创建·电视剧」
	"南辞、泽亦龙 - 总有一天我会变得特别特别优秀 (第三版)", // 同「我创建·改编/鬼畜/片段/DJ」
)

// 私人推荐（615首）
songs.push(
	"Raphaël Beau - Larrons en foire", // 可能重复·A(高度相似)·同「Raphaël Beau - Larrons En Foire」
	"Ramin Djawadi - 存亡之战 (派崔克·史坦普混音)",
	"Rag'n'Bone Man - Skin",
	"容中尔甲 - 高原红", // 可能重复·B(较可能同一首)·同「容中尔甲 - 高原红」·同「我创建·Yy」
	"许嵩 - 如果当时", // 可能重复·A(高度相似)·同「如果当时--许嵩」
	"杨千嬅、任贤齐 - 花好月圆夜",
	"任贤齐 - 心太软", // 可能重复·B(较可能同一首)·同「任贤齐 - 心太软」
	"任贤齐 - 伤心太平洋", // 可能重复·B(较可能同一首)·同「任贤齐 - 伤心太平洋」
	"任立佳、千百顺 - 两个我们2017",
	"任然 - 凉城", // 可能重复·B(较可能同一首)·同「任然 - 凉城」
	"任然 - 飞鸟和蝉", // 可能重复·B(较可能同一首)·同「任然 - 飞鸟和蝉」
	"齐秦 - 外面的世界", // 可能重复·B(较可能同一首)·同「齐秦 - 外面的世界」
	"齐秦 - 大约在冬季", // 可能重复·B(较可能同一首)·同「齐秦 - 大约在冬季」
	"齐会超 - 爱了给了伤了痛了", // 可能重复·B(较可能同一首)·同「齐会超 - 爱了给了伤了痛了」
	"青蛙乐队 - 小跳蛙", // 可能重复·B(较可能同一首)·同「青蛙乐队 - 小跳蛙」·同「我创建·儿歌」
	"青海龙泽 - 山楂啊梨啊",
	"秦海清 - 不如", // 可能重复·B(较可能同一首)·同「秦海清 - 不如」
	"秦晨阳 - 毕业那天", // 可能重复·B(较可能同一首)·同「秦晨阳 - 毕业那天」
	"秋原依 - 错季 (DJ名龙版)",
	"祁隆 - 爱的世界只有你", // 可能重复·B(较可能同一首)·同「祁隆 - 爱的世界只有你」
	"源辰 - Two Steps From Hell-Star Sky (源辰 Remix)",
	"球球、白小白 - 宠爱吖", // 可能重复·B(较可能同一首)·同「球球、白小白 - 宠爱吖」
	"烟嗓船长 - 姑娘请你别再说",
	"名决 - 黄沙 (烟嗓版)",
	"Adele - Someone Like You",
	"晚巧 - 虫儿飞 (温柔版)",
	"Dream Tunes - Every Time We Touch",
	"Ramin Djawadi - A Song of Ice and Fire",
	"久石让 - 太阳照常升起",
	"JOHN - 夜、萤火虫和你 (思绪回到童年)",
	"渔总up - 9420 (烟嗓版)",
	"Loituma - Ievan Polkka",
	"卢润泽 - 别让爱凋落",
	"苏哲 - 土坡上的狗尾草",
	"新街口组合 - 不抽烟 不喝酒",
	"欧美群星 & Ola - Sustain (宿命感)",
	"отрава музыка - Дай Мне Минуту С Тобой",
	"NexR - 鸟之诗 (小提琴合奏)",
	"Tăng Duy Tân、Phong Max - Ngây Thơ (天真)",
	"灵魂配乐师 - 溯 (纯音乐)",
	"付俊乐 - 去远方",
	"你在暮色中 - 爱人先爱己 (emo版)",
	"王梦露 - 大雨还在下 (烟嗓版)",
	"不凌. - DAY BY DAY (emo纯享版)",
	"a_hisa - Caravan",
	"丹正母子 - 乌兰巴托的夜 (吉他弹唱版｜Single Version)",
	"彝族歌手 - 指路经", // 可能重复·B(较可能同一首)·同「彝族歌手 - 指路经」
	"李文杰 - 杀死比尔", // 可能重复·B(较可能同一首)·同「李文杰 - 杀死比尔」·同「我创建·two」
	"萨顶顶 - 自由行走的花",
	"cm - 初雨朦胧",
	"Emeli Sandé - Read All About It, Pt. III",
	"印加音乐 - 最后的莫西干人 (Live)",
	"丹正母子 - 乌兰巴托的夜 (Live)",
	"名决 - 黄沙",
	"Xun - 溯 (Sunian手碟空灵版)(纯音乐)",
	"Maj7_Music 巴音孟克 - 真爱的力量",
	"a_hisa - Town of Windmill (风车小镇)",
	"VodKe、HSHK - 山花终将灿烂 (Call End)",
	"白一莎 - 匆匆那年 (天气预报版)",
	"米线 - 哈尼宝贝", // 同「我创建·two」
	"404Hz - 远方传来风笛",
	"花粥、马雨阳 - 盗将行", // 可能重复·B(较可能同一首)·同「艾辰 - 盗将行」
	"少女泪 - 小小的一片云呀 (童年走马灯)",
	"林友声 - 小刀会序曲",
	"郑智化 - 水手", // 可能重复·B(较可能同一首)·同「郑智化 - 水手」
	"艾尔肯-Erkin Abdulla - 巴郎仔",
	"卢冠廷 - 一生所爱", // 可能重复·B(较可能同一首)·同「卢冠廷、莫文蔚 - 一生所爱」
	"安子与九妹乐队 - 布谷鸟", // 可能重复·B(较可能同一首)·同「吴欣怡 - 布谷鸟」
	"弹棉花的小花 - 再见青春 (释怀版)",
	"AniFace - 夜、萤火虫和你", // 可能重复·B(较可能同一首)·同「桑子 - 夜、萤火虫和你」
	"孟维来 - 野人",
	"VodKe、HSHK - Kill Bill (杀死比尔)",
	"乌龟组合 - 빙고 (Bingo)",
	"Fatrik、L1NO - 窒 Suffocating",
	"Варвара - Катюша (喀秋莎)",
	"白水寒 - 天真的橡皮", // 可能重复·C(可能同一首)·同「天真的橡皮 (DJ版)-白水寒」
	"KOKIA - ありがとう・・・ (谢谢…)",
	"Billie Eilish - bad guy", // 同「我创建·two」
	"TypeD - 理想境 (Ideal Realm)",
	"Nicky Jam、J Balvin - X",
	"李健 - 贝加尔湖畔",
	"宫巴 - 土坡上的狗尾草 (藏语版)",
	"Monogem - Wild",
	"任素汐 - 我要你",
	"いきものがかり - ブルーバード (青鸟)",
	"野菊花 - 걱정말아요 그대 (你不要担心)",
	"杨乃文 - 推开世界的门",
	"费戚戚 - 风催雨 (弹唱版)",
	"HENRY刘宪华 - Trap (English Ver.)",
	"韩红 - 九儿",
	"Yael Naim - New Soul",
	"Dark Model - Judgment Day",
	"Thomas Newman - Por Una Cabeza (一步之遥)",
	"BY2 - 爱丫爱丫", // 可能重复·B(较可能同一首)·同「李浩然 - 爱丫爱丫」
	"白智英 - 총 맞은 것처럼 (像中枪一样)",
	"Fly Project - Toca Toca (Radio Edit)",
	"徐俊雅 - 父亲的散文诗",
	"韩红 - 只要平凡", // 可能重复·B(较可能同一首)·同「张杰、张碧晨 - 只要平凡」
	"柏松 - 寻常岁月诗", // 可能重复·B(较可能同一首)·同「冬日暖阳 - 寻常岁月诗」
	"Klaus Badelt - Barbossa Is Hungry (From ＂Pirates of the Caribbean： The Curse Of the Black Pearl＂／Score)",
	"Sheet Music Boss - Rush E (Playable)",
	"林俊杰、G.E.M.邓紫棋 - 手心的蔷薇",
	"Vikki Leigh - Dance Monkey", // 可能重复·B(较可能同一首)·同「Tones And I - Dance Monkey」
	"Pitbull、Kesha - Timber",
	"Taylor Swift - Welcome To New York",
	"Marian Hill - Got It",
	"Fifth Harmony - Worth It", // 同「我创建·two」
	"洪思雨 - 踏浪 (小小的一片云呀)",
	"许巍 - 蓝莲花 (3D环绕版)", // 可能重复·B(较可能同一首)·同「许巍 - 蓝莲花」
	"Daniele Vitale Sax、Karolina Protsenko - DANCE MONKEY (Sax & Violin)",
	"毛不易 - 借 (Live)", // 可能重复·B(较可能同一首)·同「毛不易-借」
	"柯柯柯啊 - 一点归鸿 (柯柯吉他版)",
	"Ennio Morricone - Titoli",
	"洋澜一 - 追梦人 (空灵女声版)",
	"李宗盛 - 问 (Live)",
	"阿梨粤 - 一格格", // 可能重复·B(较可能同一首)·同「我是小力气 - 一格格」
	"范玮琪 - 最初的梦想",
	"Billie Eilish、Khalid - lovely",
	"时年、绝望工作室 - 野人",
	"浅影阿 - 不怕",
	"开山斧 - Themes (Remix上岸进行曲)",
	"小石头和孩子们、王可儿 - Jar Of Love",
	"Radical Face - Welcome Home, Son",
	"广州交响乐团 - 康康舞曲 Can Can (Live)",
	"詹可可 - 推开世界的门",
	"谭维维、王赫野 - 土坡上的狗尾草 (Live)",
	"刘刚（旭日阳刚） - 怀念青春", // 可能重复·B(较可能同一首)·同「小洲 - 怀念青春」·同「我创建·默认收藏」
	"T.G.4 - 阳光男孩 阳光女孩",
	"Strictlyviolin荀博 - 樱花泪",
	"李克勤 - 红日 (粤语版)", // 可能重复·B(较可能同一首)·同「李克勤 - 红日」
	"李嘻嘻 - 快乐的扑满",
	"稀 - Butterfly (温柔女生版)",
	"Karolina Protsenko、Daniele Vitale Sax - Viva La Vida (生命万岁)(feat. Daniele Vitale SAX)",
	"阿刁哇 - 外婆的澎湖湾", // 可能重复·B(较可能同一首)·同「潘安邦 - 外婆的澎湖湾」
	"虞笙 - 圣诞快乐劳伦斯先生",
	"DJ Ko - Summertime Sadness (Explicit)",
	"真栗 - 月亮船",
	"ILLBlAUER - 夜、萤火虫和你", // 可能重复·B(较可能同一首)·同「桑子 - 夜、萤火虫和你」
	"庞龙 - 星星照亮回家的路",
	"Mono Inc. - Children of the Dark",
	"Tommee Profitt、Fleurie、Mellen Gi - In The End (remix：Mellen Gi)",
	"浅影阿 - 探故知 (超梦幻DJ版)",
	"赵雷 - 我记得",
	"rude boy - Late Night Melancholy",
	"TypeD - 远方传来风笛",
	"1nose - 海绵宝宝 (seaweed remix)",
	"欧阳耀莹 - 戒不掉",
	"Color Music Choir - Something Just Like This (Live)", // 可能重复·B(较可能同一首)·同「暖豪 - Something Just Like This (Live)」
	"橘子味的小呆毛 - 鳥の詩 (鸟之诗)(纯享版)",
	"贰佰 - 玫瑰",
	"蜻蜓酱 - 玫瑰少年 (小提琴版)", // 可能重复·B(较可能同一首)·同「风起词 - 玫瑰少年 (小提琴版)」
	"接个吻，开一枪、SaMZIng - 烟袋斜街",
	"园园 - Free loop (口琴)",
	"锦谣 - 当年情 (口琴版)",
	"邵帅 - 南风北巷 (Demo)",
	"Alexandrov Ensemble - Катюша (喀秋莎)",
	"K.Williams - 菊次郎的夏天",
	"G.E.M.邓紫棋 - 唯一", // 可能重复·A(高度相似)·同「唯一」
	"CrazyG - 理想境 (纯享版)",
	"陈雷 - 欢喜就好",
	"Mikael Sandgren - Red Alert 3 Credits",
	"濮曼乐队 - 三跺脚",
	"赵雷 - 画", // 可能重复·A(高度相似)·同「画-赵雷」
	"日本群星 - ありがとう・・・ (谢谢…)",
	"July - Where memory had stopped (记忆停留的地方)(记忆停止的地方)(纯音乐)",
	"京剧·吴昊 - 此去半生 (青衣戏腔版)",
	"Wolfgang Amadeus Mozart - 土耳其进行曲",
	"吹口琴的水 - 美しきもの (美丽之物)(半音阶口琴版)",
	"泽国同学 - 折风渡夜",
	"薛之谦、毛不易 - 消愁 (Live)", // 可能重复·B(较可能同一首)·同「毛不易-消愁」
	"颜小健 - 一不小心", // 可能重复·B(较可能同一首)·同「颜小健 - 一不小心」
	"周深、李维 - 贝加尔湖畔 (Live)",
	"Park Choi - JingWei (感觉至上)",
	"Love. - 极速夜未央 (迈巴赫DJ)",
	"纯音乐 - For Your Pieces (纯音乐)",
	"墨葉JUN - 花之舞 (flower dance)",
	"海来阿木 - 别知己", // 可能重复·B(较可能同一首)·同「海来阿木、阿呷拉古、曲比阿且 - 别知己」
	"张杰 - 着魔", // 同「我创建·默认收藏」
	"OneRepublic - Counting Stars",
	"clock口琴 - 红凯之歌 (口琴版)",
	"KALEO、slowed down audioss - Way down We Go (Slowed Down Version)",
	"小团子吖 - Rise And Fall (Remix)",
	"白子航 - 疆·梦",
	"侃侃 - 滴答 (吉他版)", // 可能重复·B(较可能同一首)·同「侃侃 - 滴答」
	"Bruno Coulais - Vois Sur Ton Chemin",
	"邵帅 - 你是人间四月天 (Live)", // 可能重复·B(较可能同一首)·同「小沈阳、邵帅 - 你是人间四月天 (Live)」
	"Andree Son - 山花终将灿烂 (New Edit)",
	"你家七哥ya - 火苗", // 可能重复·B(较可能同一首)·同「格格 - 火苗」
	"阿豪 - 去远方",
	"StellarWhisper - 维多利亚港进行曲 (PHONK版)",
	"巫里堡堡 - 兰花草 (轻灵版)",
	"丸子呦 - 广寒宫", // 可能重复·B(较可能同一首)·同「丸子呦 - 广寒宫」
	"EMOWZ - 美丽的神话", // 可能重复·A(高度相似)·同「孙楠、韩红 - 美丽的神话」
	"KM LYK、R3T3 - 杀死比尔", // 可能重复·B(较可能同一首)·同「李文杰 - 杀死比尔」
	"Martins Garix - Things You Said (氛围感纯音乐)",
	"顾清瑶 - 踏浪", // 可能重复·B(较可能同一首)·同「徐怀钰 - 踏浪 (Live)」
	"韩红 - 青春",
	"小眼鑫 - 虫儿飞 (甜美版)",
	"Eva伊瓦 - 一步三摇 (MANGATA)",
	"张学友 - 如果这都不算爱",
	"陈洁丽、李培斌 - 尘曦",
	"王晓天 - 再见吧 喵小姐 (Live)",
	"李秉成 - 只为你着迷",
	"Russian Chorus - 喀秋莎",
	"春风绣 - 及时行乐",
	"张卫 - 机器铃 砍菜刀",
	"烟嗓兄弟 - 我从山中来带着兰花草 (烟嗓版)",
	"黄超 - 似火流年",
	"周杰伦 - 烟花易冷", // 可能重复·C(可能同一首)·同「叫宝宝 - 烟花易冷 (片段)」
	"赵雷 - 浮游",
	"周杰伦 - 稻香", // 可能重复·B(较可能同一首)·同「周杰伦 - 稻香」
	"尼古拉斯·四哥 - 踹 (炸雷)",
	"穆傲寒、鱼baibai - 偷星星的月亮 (清新版)",
	"陈乐基 - 月半小夜曲", // 可能重复·B(较可能同一首)·同「李克勤 - 月半小夜曲」
	"抠抠 - 姑娘我怎能忘 (弹唱版)",
	"鞠文娴 - 病变",
	"李袁杰、Au - 西楼爱情故事",
	"热水福 - 我要找到你", // 可能重复·B(较可能同一首)·同「小阿枫 - 我要找到你」
	"萧敬腾 - 王妃",
	"Love. - 帝王舞步 (phonk)",
	"Mozgi - Аябо (我再也不)",
	"灯叔 - 恰逢那年你明媚",
	"欧翠峰 - 西班牙斗牛士", // 同「我创建·two」
	"王菲 - 致青春",
	"林陈（自动挡吉他手） - 生活没有说明书",
	"Diana Boncheva - Beethoven Virus (贝多芬病毒)",
	"夏城南 - 匆匆那年", // 可能重复·B(较可能同一首)·同「王菲 - 匆匆那年」
	"闻人听書_ - 虞兮叹", // 可能重复·B(较可能同一首)·同「闻人听書_ - 虞兮叹」
	"薛之谦 - 天外来物", // 可能重复·B(较可能同一首)·同「薛之谦 - 天外来物」
	"Mr. Polska - Siekiera (Push Up)(Explicit)",
	"鞠文娴 - cheap thrills", // 可能重复·B(较可能同一首)·同「蔡文姬、澜 - Cheap Thrills (二胡版)」
	"鬼卞 - 佳人",
	"关大洲 - 象王行 (特别版)",
	"Clean Bandit、Jess Glynne - Rather Be",
	"扎西平措 - 起舞",
	"李良松 - 兰花草 (我从山中来带着兰花草)",
	"Nickelback - We Will Rock You", // 可能重复·A(高度相似)·同「We Will Rock You」
	"Greyson Chance - Summertrain",
	"连毅霖 - 循迹 (弦乐版)",
	"关中王 - 关中王进行曲 (关中王来了)",
	"毛不易 - 如果有一天我变得很有钱 (Live)",
	"Barns Courtney - Glitter & Gold",
	"Spice Mangos - Natural", // 可能重复·B(较可能同一首)·同「Imagine Dragons - Natural (Live)」
	"吴昊泽MUSICALBLAST - Croatian Rhapsody (钢琴版)",
	"浮生梦、汐音社 - 探故知 (清风上南枝)",
	"迟志强 - 十三不亲", // 可能重复·A(高度相似)·同「刘牧 - 十三不亲」
	"花僮 - 盗将行", // 可能重复·B(较可能同一首)·同「艾辰 - 盗将行」
	"祥嘞嘞、汐音社 - 空台戏 (甘露寺老臣从头劝)",
	"拉紧我的手 - 帅气卡点 (DJ版)",
	"OAO - Slow Down", // 可能重复·B(较可能同一首)·同「Slow down. - 江南 (0.8x)」
	"Ennio Morricone - Il buono il brutto il cattivo (titoli)",
	"DJariium - BING BONG TOKYO (Flip Mix｜Explicit)",
	"赵季平 - 门楼",
	"黎允文 - 五虎封将",
	"DeeJay Ghost - Betty Boop (Ghost Remix)",
	"豆包 - 多想还小",
	"罗嫣 - 胡广生", // 可能重复·B(较可能同一首)·同「任素汐 - 胡广生」
	"薛之谦 - 我好像在哪见过你", // 可能重复·A(高度相似)·同「薛之谦-我好像在哪见过你」
	"Maroon 5 - Maps",
	"葛林 - 林中鸟",
	"Athletics - III",
	"Ava Max - Sweet but Psycho",
	"姜鹏 - 江湖大道",
	"Gamper & Dadoni - Creep", // 可能重复·B(较可能同一首)·同「Gamper & Dadoni、Ember Island - Creep」
	"Charlie Puth - Attention",
	"Maria - 友谊之光",
	"布袋寅泰 - 新・仁義なき戦いのテーマ (无荣耀之战)",
	"Måneskin - I WANNA BE YOUR SLAVE (Explicit)",
	"Max Elto - Shadow of the Sun",
	"Shaggy、Black M、Trackstorm - Tapage nocturne",
	"Michael Jackson - Beat It",
	"Justin Timberlake、Carey Mulligan、Stark Sands - Five Hundred Miles",
	"何流、宋晓峰 - 难得真兄弟",
	"JordanBeats - Levels",
	"毛不易 - 一程山路",
	"Ummet Ozcan - Xanadu",
	"BLESSED MANE - Death Is No More",
	"蔡健雅 - 被驯服的象",
	"David Garrett - He's A Pirate (加勒比海盗)", // 可能重复·B(较可能同一首)·同「dylanf - He's a Pirate (加勒比海盗)」
	"MAKJ、Timmy Trumpet、Andrew W.K. - Party Till We Die (feat. Andrew W.K.)",
	"Ooberman - Mary Grows Old",
	"陈奕迅 - 不要说话",
	"Öwnboss、Sevek - Move Your Body (remix：Razihel)",
	"Creeds - Push Up (Main Edit)",
	"Romy Wave - Waiting for Love (Original Mix)",
	"Mike Candys - Mission Control",
	"张靓颖、王赫野 - 是你 (Live)", // 可能重复·C(可能同一首)·同「梦然 - 是你」
	"何野 - 天亮以前说再见", // 可能重复·A(高度相似)·同「天亮以前说再见」
	"贺一航 - 原来占据你内心的人不是我",
	"刘若英 - 当爱在靠近", // 可能重复·B(较可能同一首)·同「杨亚茹Triste - 当爱在靠近」
	"青鸟飞鱼 - 此生不换", // 可能重复·B(较可能同一首)·同「青鸟飞鱼 - 此生不换」
	"魏玉慧 - 相思遥",
	"李雅微 - 我们的纪念", // 可能重复·C(可能同一首)·同「小眼睛阿旺 - 我们的纪念 (片段)」
	"许嵩 - 庐州月", // 可能重复·A(高度相似)·同「许嵩 - 庐州月」
	"刘若英 - 原来你也在这里",
	"古巨基 - 匆匆那年 (Live)", // 可能重复·B(较可能同一首)·同「王菲 - 匆匆那年」
	"一棵小葱、张曦匀 - 壁上观",
	"蒋雪儿Snow.J - 落了白",
	"陈粒 - 易燃易爆炸",
	"王力宏 - 爱错", // 可能重复·A(高度相似)·同「爱错」
	"齐一 - 这个年纪", // 可能重复·B(较可能同一首)·同「李鑫ya - 这个年纪 (片段)」
	"许嵩 - 城府", // 可能重复·B(较可能同一首)·同「许嵩 - 城府」
	"李荣浩 - 麻雀", // 可能重复·A(高度相似)·同「麻雀」
	"李荣浩 - 年少有为", // 可能重复·B(较可能同一首)·同「李荣浩 - 年少有为」
	"梁博 - 男孩 (Live)",
	"郭静 - 下一个天亮", // 可能重复·B(较可能同一首)·同「颜人中 - 下一个天亮」
	"胡杨林 - 多情种", // 可能重复·A(高度相似)·同「要不要买菜 - 全是爱 (片段)」
	"羊羊 - 用情", // 可能重复·A(高度相似)·同「用情」·同「我创建·默认收藏」
	"花粥 - 遥不可及的你",
	"小田音乐社、傲七爷(江偌绮) - 枕边童话",
	"文夫 - 骗子", // 可能重复·A(高度相似)·同「骗子」
	"丹正母子 - 乌兰巴托的夜",
	"陈鸿宇 - 理想三旬",
	"赵雷 - 南方姑娘",
	"李健 - 风吹麦浪", // 可能重复·B(较可能同一首)·同「金婷婷 - 风吹麦浪」
	"庾澄庆 - 春泥", // 可能重复·A(高度相似)·同「庾澄庆 - 春泥」
	"柯柯柯啊 - 姑娘别哭泣", // 可能重复·C(可能同一首)·同「柯柯柯啊 - 姑娘别哭泣 (弹唱版)」
	"于春洋 - 不谓侠 (电吉他Solo)",
	"张杰 - 铭记",
	"DJ.SmartD - 此生不换 (DJ降调版)",
	"黑豆ado - 心碎的声音 (想挽留却无能为力)",
	"BINS - 春娇与志明", // 可能重复·B(较可能同一首)·同「欧阳耀莹、街道办GDC - 春娇与志明 (DJ版)」
	"周杰伦、潘儿 - 夜的第七章",
	"Rnbstylerz、Arees、Paweł Turski - WHAT",
	"阿梨粤 - 晚风心里吹",
	"Martynas、David Garrett - Por Una Cabeza (一步之遥)",
	"戴羽彤 - 童话镇", // 可能重复·B(较可能同一首)·同「童话镇-陈一发儿」
	"矢野立美 - 苏る巨人 (复苏的巨人)(＜M-3,M-11＞)", // 可能重复·C(可能同一首)·同「队长、黄礼格 - 11」
	"Robby Burke - Right Na Na Na",
	"吴百萬Million Wu、阿发、艾斯 - 该长大了孩儿",
	"姚莉 - 恭喜恭喜", // 可能重复·C(可能同一首)·同「恭喜恭喜-卓依婷」
	"上海彩虹室内合唱团 - 送别", // 可能重复·B(较可能同一首)·同「蒋大为 - 送别」
	"柏松 - 世间美好与你环环相扣",
	"王优秀 - 墨尔本的秋天 (女版)",
	"琰琰 - 仙剑奇缘 (琵琶版)", // 可能重复·B(较可能同一首)·同「Y2002 - 仙剑奇缘 (琵琶版)」
	"毛阿敏 - 相思",
	"程奎 - 远山少年", // 可能重复·A(高度相似)·同「远山少年」
	"Luis Fonsi、Daddy Yankee - Despacito", // 可能重复·A(高度相似)·同「Despacito」
	"andre kostelanetz、André Kostelanetz - Can Can",
	"祝青（G2er）、灼夭 - 风催雨",
	"三无 - BADGUY (国风版)",
	"ДЕТИ RAVE - МАГНИТОЛА (播放器)",
	"ДЕТИ RAVE - УРЫЛ 0$ (抢劫0$)(Explicit)",
	"陈奕迅 - 淘汰", // 可能重复·A(高度相似)·同「陈奕迅 - 淘汰」
	"张杰 - 三生三世", // 可能重复·B(较可能同一首)·同「一杨 - 三生三世」·同「我创建·花千骨」
	"付豪 - 末班",
	"风华音纪、平生不晚 - 乱世书 (0.87x降调版)",
	"张德伊玲 - 只若初见",
	"Dj ManMan - Dj Titanic Full Bass",
	"张鑫 - 心之火 (DJ版)", // 可能重复·C(可能同一首)·同「F.I.R.飞儿乐团、彭佳慧 - 心之火」
	"Ersen0306 - 攀登 (无Rap版)",
	"痛仰乐队 - 为你唱首歌",
	"刘祉辰 - 温柔乡 (DJ硬核版)",
	"赵雷 - 窑上路",
	"赵雷 - 彩虹下面",
	"霖超凡 - 望故乡",
	"隔壁老樊_樊凯杰 - 我曾", // 可能重复·A(高度相似)·同「我曾」
	"蒋雪儿Snow.J - 莫问归期", // 可能重复·B(较可能同一首)·同「蒋雪儿、七叔(叶泽浩) - 莫问归期」
	"迪克牛仔 - 风飞沙", // 可能重复·B(较可能同一首)·同「高胜美 - 风飞沙」
	"洪思雨 - 踏浪 (清新版)",
	"卢润泽 - 土坡上的狗尾草",
	"林志炫 - 离歌 (Live)", // 可能重复·A(高度相似)·同「离歌-信乐团」
	"郝琪力 - 余香", // 可能重复·B(较可能同一首)·同「张小九 - 余香」
	"泽天龙 - 凯迪拉克进行曲 (Run Away)",
	"小野来了 - 童话镇", // 可能重复·B(较可能同一首)·同「童话镇-陈一发儿」
	"老谢 - 明天会更好 (治愈版)",
	"毛不易 - 无名的人",
	"DJ筱轩 - 游京 (奋斗进行曲)",
	"老狼、王婧 - 想把我唱给你听", // 可能重复·B(较可能同一首)·同「半吨兄弟、王小草 - 想把我唱给你听」
	"徐良、小凌 - 坏女孩", // 可能重复·B(较可能同一首)·同「徐良、小凌 - 坏女孩」
	"戴羽彤 - 漠河舞厅", // 可能重复·B(较可能同一首)·同「柳爽-漠河舞厅」
	"琪大妈 - 痴情冢", // 可能重复·B(较可能同一首)·同「金典音乐 - 痴情冢」
	"马旭东 - 入戏太深", // 可能重复·A(高度相似)·同「入戏太深 - 马旭东」
	"胡夏 - 同桌的你", // 可能重复·B(较可能同一首)·同「老狼 - 同桌的你」
	"真瑞 - 最美的瞬间",
	"小小浩、欧阳朵 - 落单恋人", // 可能重复·B(较可能同一首)·同「欧阳朵、小小浩 - 落单恋人」
	"梁静茹 - 可惜不是你", // 可能重复·B(较可能同一首)·同「刘大壮 - 可惜不是你」
	"薛明媛、朱贺 - 非酋", // 可能重复·B(较可能同一首)·同「赖仔Morris - 非酋」
	"陈奕迅 - 稳稳的幸福",
	"李耀阳 - 那个女孩", // 可能重复·B(较可能同一首)·同「张泽熙 - 那个女孩」
	"阿桑 - 一直很安静", // 可能重复·B(较可能同一首)·同「阿桑 - 一直很安静」
	"葛东琪 - 悬溺",
	"林俊杰 - 她说", // 可能重复·B(较可能同一首)·同「林俊杰 - 她说」
	"黑龙 - 盗心贼", // 可能重复·B(较可能同一首)·同「小洲 - 盗心贼」
	"贺敬轩 - 罗曼蒂克的爱情",
	"银临、Aki阿杰 - 牵丝戏",
	"筷子兄弟 - 老男孩", // 可能重复·A(高度相似)·同「筷子兄弟 - 老男孩 (Live)」·同「我创建·默认收藏」
	"林俊杰 - 江南", // 可能重复·A(高度相似)·同「我创建·。」
	"璐爷 - 大天蓬", // 可能重复·B(较可能同一首)·同「李袁杰 - 大天蓬」
	"名决 - 时间的过客", // 可能重复·B(较可能同一首)·同「大宝软妹、w别丢下甜甜 - 时间的过客」
	"许嵩 - 断桥残雪", // 可能重复·A(高度相似)·同「许嵩 - 断桥残雪」
	"曾熙杰 - 可是啊总有那风吹不散的认真", // 同「我创建·默认收藏」
	"梁静茹 - 勇气", // 可能重复·B(较可能同一首)·同「梁静茹 - 勇气」·同「我创建·默认收藏」
	"唐磊 - 丁香花", // 可能重复·B(较可能同一首)·同「唐磊 - 丁香花」·同「我创建·默认收藏」
	"张杰 - 他不懂", // 可能重复·A(高度相似)·同「张杰-他不懂」·同「我创建·默认收藏」
	"张学友 - 烦恼歌", // 同「我创建·默认收藏」
	"轩东 - 碎银几两", // 同「我创建·默认收藏」
	"王睿卓、Damn5z - 重生之我在异乡为异客", // 同「我创建·默认收藏」
	"姜姜 - 一笑江湖", // 可能重复·B(较可能同一首)·同「闻人听書_ - 一笑江湖」·同「我创建·默认收藏」
	"蔡健雅 - 越来越不懂", // 可能重复·A(高度相似)·同「越来越不懂-蔡健雅」·同「我创建·默认收藏」
	"吴静 - 女儿情", // 可能重复·B(较可能同一首)·同「吴静 - 女儿情」·同「我创建·西游记音乐合集」
	"许嵩、何曼婷 - 素颜", // 可能重复·A(高度相似)·同「素颜--许嵩&何曼婷」·同「我创建·默认收藏」
	"克里、南乔 - 穿越之小小的一片云", // 同「我创建·默认收藏」
	"邵帅 - 你是人间四月天", // 可能重复·B(较可能同一首)·同「小沈阳、邵帅 - 你是人间四月天 (Live)」·同「我创建·默认收藏」
	"邓丽君 - 我只在乎你", // 可能重复·B(较可能同一首)·同「小阿枫 - 我只在乎你」·同「我创建·默认收藏」
	"罗大佑 - 童年", // 可能重复·B(较可能同一首)·同「罗大佑 - 童年」·同「我创建·默认收藏」
	"鞠文娴 - BINGBIAN病变 (女声版)", // 同「我创建·默认收藏」
	"窝窝 - 远山少年", // 可能重复·A(高度相似)·同「远山少年」·同「我创建·默认收藏」
	"老狼 - 同桌的你", // 可能重复·B(较可能同一首)·同「老狼 - 同桌的你」·同「我创建·默认收藏」
	"全幺九 - 这一别山高路长", // 同「我创建·默认收藏」
	"王强 - 秋天不回来", // 可能重复·B(较可能同一首)·同「王强 - 秋天不回来」·同「我创建·默认收藏」
	"刘若英 - 后来", // 可能重复·B(较可能同一首)·同「刘若英 - 后来」·同「我创建·默认收藏」
	"许嵩 - 玫瑰花的葬礼", // 同「我创建·默认收藏」
	"任素汐 - 胡广生 (我欠你啥子嘛)", // 可能重复·B(较可能同一首)·同「任素汐 - 胡广生」·同「我创建·默认收藏」
	"孙燕姿 - 遇见", // 可能重复·B(较可能同一首)·同「孙燕姿 - 遇见 (DJ版)」·同「我创建·默认收藏」
	"王铮亮 - 时间都去哪儿了", // 同「我创建·默认收藏」
	"成龙、金喜善 - 美丽的神话", // 可能重复·A(高度相似)·同「孙楠、韩红 - 美丽的神话」·同「我创建·默认收藏」
	"宇西 - 安和桥", // 可能重复·B(较可能同一首)·同「宋冬野 - 安和桥」
	"旺仔小乔 - 星光下的梦想", // 可能重复·A(高度相似)·同「星光下的梦想」
	"王洛宾、李毓敏 - 青春舞曲", // 可能重复·B(较可能同一首)·同「王洛宾、李毓敏 - 青春舞曲」
	"sapientdream - Promise", // 可能重复·C(可能同一首)·同「顾依辰 - Promise. (片段)」
	"赵德柱 - 杀死那个石家庄人", // 可能重复·B(较可能同一首)·同「卡门 - 杀死那个石家庄人」
	"山丹丹民歌组合 - 弥渡山歌",
	"草东没有派对 - 山海", // 可能重复·B(较可能同一首)·同「爱吃巧乐兹 - 山海 (合唱版片段)」
	"菜园子不CAi - 童话镇", // 可能重复·B(较可能同一首)·同「童话镇-陈一发儿」
	"周杰伦 - 七里香", // 可能重复·B(较可能同一首)·同「周杰伦 - 七里香」
	"王睿卓 - 重生之我在异乡为异客 (纯享版)", // 同「我创建·默认收藏」
	"G.E.M.邓紫棋 - 光年之外",
	"魏新雨 - 恋人心", // 可能重复·A(高度相似)
	"纯音乐 - My Soul (我的灵魂)", // 可能重复·B(较可能同一首)·同「July - My Soul (我的灵魂)」
	"唐朝 - 国际歌",
	"解忧草、冰幽 - 辞·九门回忆", // 可能重复·B(较可能同一首)·同「等什么君(邓寓君) - 辞九门回忆」
	"罗大佑 - 你的样子", // 可能重复·A(高度相似)·同「林志炫 - 你的样子」
	"bôa - Duvet",
	"边靖婷、小淅儿、叶聪明、可爱晨、ya妖精 - 难却 (416戏腔版)",
	"安琥 - 天使的翅膀", // 可能重复·A(高度相似)·同「徐誉滕 - 天使的翅膀」
	"GooGoo、王之睿 - 我的纸飞机",
	"老帽 - 我只在乎你 (烟嗓版)",
	"和田薫 - ふたりの気持ち (两人的心情)",
	"许巍 - 执着",
	"一颗狼星 - 星月原野",
	"晚巧 - 鲁冰花 (童年版)",
	"时光胶囊 - 青丝 Remix", // 可能重复·C(可能同一首)·同「时光胶囊 - 青丝」
	"陆通 - 膨胀",
	"林俊杰 - 修炼爱情",
	"孙燕姿 - 开始懂了", // 可能重复·A(高度相似)·同「开始懂了-孙燕姿」
	"林俊杰 - 不潮不用花钱", // 可能重复·B(较可能同一首)·同「林俊杰 - 不潮不用花钱 (男明星0.8x版)」
	"周华健 - 我是谁",
	"陈小春 - 乱世巨星",
	"梁倩雨 - 万物起舞",
	"柯柯柯啊 - 山茶花读不懂白玫瑰 (吉他版)", // 可能重复·C(可能同一首)·同「梨笑笑 - 山茶花读不懂白玫瑰」
	"大哲 - 闯码头", // 可能重复·B(较可能同一首)·同「何鹏、大哲 - 闯码头 (DJ何鹏版)」
	"美美jocie - 不怕不怕 (Original Radio Remix)",
	"BEYOND - 大地",
	"Imagine Dragons - Believer", // 可能重复·B(较可能同一首)·同「Imagine Dragons、Lil Wayne - Believer」
	"李娜 - 信天游", // 可能重复·B(较可能同一首)·同「乌兰图雅 - 信天游」
	"屠洪刚 - 中国功夫",
	"柯受良 - 大哥",
	"花粥 - 二十岁的某一天",
	"刘德华 - 笨小孩",
	"LBI利比（时柏尘） - 跳楼机",
	"杜宣达 - 指纹", // 可能重复·B(较可能同一首)·同「一杯陈豆浆、梁森田 - 指纹」
	"Redbone - Come and Get Your Love (Single Version)",
	"许冠杰 - 天才白痴梦",
	"成龙 - 醉拳",
	"高夫 - 大雨还在下 (新版)", // 可能重复·B(较可能同一首)·同「1个球 - 大雨还在下」
	"James Major - Teeth", // 可能重复·B(较可能同一首)·同「5 Seconds of Summer - Teeth」
	"Imagine Dragons - Bones",
	"Timmy Trumpet、savage - Freaks (Radio Edit)",
	"周杰伦 - 牛仔很忙",
	"2CELLOS、Hans Zimmer - Pirates of the Caribbean",
	"徐千雅 - 彩云之南", // 可能重复·A(高度相似)·同「彩云之南-徐千雅」
	"杜贴心 - 宫崎骏的夏天 (治愈版)",
	"Sheet Music Boss - Rush A",
	"孙燕姿 - 直来直往",
	"俄罗斯国防部亚历山德罗夫红旗歌舞团、伊戈尔·拉耶夫斯基、瓦莱里亚·库勒努什金娜 - 喀秋莎 (feat. 伊戈尔·拉耶夫斯基 & 瓦莱里亚·库勒努什金娜)",
	"柯柯柯啊 - 乌兰巴托的夜",
	"接个吻，开一枪 - 烟袋斜街",
	"AxR - Rise", // 可能重复·A(高度相似)·同「John Dreamer - Rise (上升 - 史诗音乐)」
	"Lou Bega - Angelina",
	"林海 - 欢沁",
	"晴诚 - 森林狂想曲",
	"Alexander Nakarada - The Wellerman",
	"灵魂配乐师 - Realm Ideal 理想境 (纯音乐)",
	"Cartoons - Witch Doctor (Radio Mix)",
	"周柃 - 万物起舞",
	"大白c - Bad guy (古琴版)",
	"橘猫烧鲷鱼 - 星光下的梦想 (怀念童年版)", // 可能重复·A(高度相似)·同「星光下的梦想」
	"井胧 - 把孤独当作晚餐",
	"徐誉滕 - 等一分钟", // 可能重复·B(较可能同一首)·同「徐誉滕 - 等一分钟」
	"徐佳莹 - 身骑白马", // 可能重复·B(较可能同一首)·同「Deepain - 身骑白马」
	"梁静茹 - 暖暖",
	"张靓颖 - 画心", // 可能重复·B(较可能同一首)·同「琪大妈-画心」
	"六哲、陈娟儿 - 错错错", // 可能重复·B(较可能同一首)·同「六哲、陈娟儿 - 错错错」
	"信乐团 - 离歌", // 可能重复·A(高度相似)·同「离歌-信乐团」
	"许茹芸 - 独角戏", // 可能重复·B(较可能同一首)·同「薛之谦 - 独角戏 (Live)」
	"庄心妍 - 一万个舍不得", // 可能重复·B(较可能同一首)·同「享儿 - 一万个舍不得」
	"陈粒 - 虚拟", // 可能重复·B(较可能同一首)·同「王贰浪 - 虚拟」
	"福禄寿FloruitShow - 我用什么把你留住 (remix)", // 可能重复·C(可能同一首)·同「福禄寿FloruitShow - 我用什么把你留住 (Live)」
	"Penny - 打火机",
	"韩红 - 天亮了", // 可能重复·C(可能同一首)·同「韩红 - 天亮了 (Live)」
	"杨宗纬 - 其实都没有", // 可能重复·B(较可能同一首)·同「于冬然 - 其实都没有」
	"那英 - 默", // 可能重复·B(较可能同一首)·同「那英 - 默」
	"程佳佳 - 别错过 (DJ阿卓、DJ阿龙版)", // 可能重复·B(较可能同一首)·同「程佳佳 - 别错过」
	"任素汐 - 亲爱的你啊",
	"隔壁老樊_樊凯杰 - 四块五", // 可能重复·B(较可能同一首)·同「隔壁老樊_樊凯杰 - 四块五的妞 (DJ版)」
	"赵雷 - 成都", // 可能重复·B(较可能同一首)·同「赵雷 - 成都」
	"陈粒 - 走马", // 可能重复·A(高度相似)·同「曲肖冰 - 走马」
	"金南玲 - 逆流成河", // 可能重复·B(较可能同一首)·同「金南玲 - 逆流成河 (典藏版)」
	"王心凌 - 梦的光点", // 可能重复·B(较可能同一首)·同「王心凌 - 梦的光点」·同「我创建·动画片」
	"陈奕迅 - 爱情转移", // 可能重复·B(较可能同一首)·同「陈奕迅 - 爱情转移」
	"海来阿木 - 别知己 (典藏正版)", // 可能重复·B(较可能同一首)·同「海来阿木、阿呷拉古、曲比阿且 - 别知己」
	"光泽 - 空心", // 可能重复·B(较可能同一首)·同「光泽 - 空心」
	"王樾安 - 会开花的云", // 可能重复·B(较可能同一首)·同「王樾安 - 会开花的云」
	"周林枫 - 阿嬷",
	"自然卷 - 坐在巷口的那对男女",
	"陈粒 - 小半",
	"房东的猫 - 和宇宙的温柔关联",
	"French Kiss - Jealousy (Dance Radio)",
	"王媛渊 - 三妻四妾", // 可能重复·B(较可能同一首)·同「王媛渊 - 三妻四妾」
	"小贱 - 说好了不见面",
	"Fool's Garden - Lemon Tree", // 可能重复·A(高度相似)·同「Lemon Tree - Fool's Garden」
	"许明明 - 青春的颜色 (合唱版)",
	"安与骑兵 - 红山果",
	"庾澄庆 - 情非得已", // 可能重复·B(较可能同一首)·同「庾澄庆 - 情非得已」
	"隔壁老樊_樊凯杰 - 多想在平庸的生活拥抱你", // 可能重复·B(较可能同一首)·同「隔壁老樊_樊凯杰 - 多想在平庸的生活拥抱你 (Live)」
	"庄心妍 - 爱囚", // 可能重复·B(较可能同一首)·同「莫叫弟弟 - 爱囚」
	"Jam - 不露声色",
	"陈奕迅 - 红玫瑰", // 可能重复·B(较可能同一首)·同「陈奕迅 - 红玫瑰」
	"蒋蒋 - 残雪", // 可能重复·B(较可能同一首)·同「蒋蒋 - 残雪」
	"李白. - 美周郎 (谈笑风生回首斜阳)", // 可能重复·C(可能同一首)·同「李荣浩、王俊凯 - 李白 (Live)」
	"闷猪 - 留什么给你", // 可能重复·B(较可能同一首)·同「留什么给你(Live)-孙楠」
	"海龟先生 - 男孩别哭", // 可能重复·B(较可能同一首)·同「李巨儒 - 男孩别哭」
	"BloXberg、Mark Cox - Fresh 'n' Sexy (Radio Edit)",
	"占二曦 - 生死相随 (民谣版)", // 同「我创建·默认收藏」
	"凤飞飞 - 追梦人", // 可能重复·B(较可能同一首)·同「凤飞飞 - 追梦人」
	"曲肖冰 - 走马",
	"M&a、Бэтси - Симпл димпл поп ит сквиш (弹弹小酒窝)",
	"吴雨霏 - 吴哥窟", // 可能重复·B(较可能同一首)·同「王大美 - 吴哥窟」
	"Fyex、DJ Samir - Eternal Rave",
	"阎其儿Jill - 童话镇", // 可能重复·B(较可能同一首)·同「童话镇-陈一发儿」
	"Lil Nas X、Billy Ray Cyrus - Old Town Road (feat. Billy Ray Cyrus)(Remix)",
	"GuTs - Best Arrangement",
	"七元 - 丁香花 (女生版)",
	"Raim & Artur、Adil、Artur、RaiM - Simpa", // 同「我创建·和平精英音乐合集」
	"薛之谦 - 租购",
	"Anson Seabra - Peter Pan Was Right",
	"吕大叶、马子林Broma、陈觅Lynne、王以诺 - 篝火旁", // 可能重复·A(高度相似)·同「篝火旁」
	"苏星婕 - 把回忆拼好给你", // 可能重复·B(较可能同一首)·同「cici_ - 把回忆拼好给你」
	"大布、苏泽龙 - 无心斗艳",
	"Rnbstylerz - Like Wooh Wooh",
	"李宇春 - 下个，路口，见", // 可能重复·B(较可能同一首)·同「洋子默 - 下个路口见」
	"邓寓君(等什么君) - 春不晚",
	"CHROMANCE - Wrap Me In Plastic", // 可能重复·B(较可能同一首)·同「모모랜드 (MOMOLAND)、CHROMANCE - Wrap Me In Plastic」
	"浅影阿 - 须尽欢", // 可能重复·B(较可能同一首)·同「郑浩 - 须尽欢」
	"花粥、王胜娚 - 出山", // 可能重复·B(较可能同一首)·同「花粥、王胜娚 - 出山」
	"邓寓君(等什么君) - 鸳鸯戏", // 可能重复·C(可能同一首)·同「略略略 - 鸳鸯戏 (吉他版)」
	"徐良、小凌 - 客官不可以", // 可能重复·C(可能同一首)·同「今晚打老虎 - 客官不可以 (Live 片段)」
	"林俊杰 - 醉赤壁", // 可能重复·B(较可能同一首)·同「林俊杰 - 醉赤壁」
	"蒋雪儿Snow.J - 燕无歇", // 可能重复·B(较可能同一首)·同「七叔（叶泽浩） - 燕无歇」
	"七元 - 壁上观 (边水版)",
	"汪苏泷、徐良 - 后会无期",
	"潘成（皮卡潘） - 白鸽乌鸦相爱的戏码", // 可能重复·B(较可能同一首)·同「潘成（皮卡潘） - 白鸽乌鸦相爱的戏码」
	"王宇宙Leto、乔浚丞 - 若月亮没来 (若是月亮还没来)",
	"菲菲公主（陆绮菲） - 第57次取消发送",
	"浅影阿 - 探故知 (DJlucky小阳版)",
	"花澤香菜 - 恋愛サーキュレーション (恋爱循环)",
	"大叔很下饭 - 敕勒歌 (马头琴版)",
	"灵魂配乐师 - 手碟空灵 (SuNian手碟空灵版)",
	"Georgia Gibbs - Seven Lonely Days",
	"黑豹乐队 - 无地自容",
	"萧萧 - 爱要坦荡荡",
	"好听吗、Tz安竹 - 别让爱凋落",
	"Anurag Kulkarni、Anup Rubens - Nijamena", // 可能重复·C(可能同一首)·同「夜狸Yeli - Nijamena (Live)」
	"Passion Pit - Take a Walk (Radio Edit)",
	"柊奈緒 - レクイエム (安魂曲)", // 可能重复·B(较可能同一首)·同「柊奈緒 - レクイエム (安魂曲)(inst.)」
	"情书海 - 莫奈花园",
	"Darin - Be What You Wanna Be",
	"邓寓君(等什么君) - 踏雪 (纯享版)",
	"时空储蓄罐 - Charm and Rules",
	"王以诺、徐培涌、徐漫佳 - 来去打工 (合唱版)",
	"番番、韩圣 - 芦苇飞 (说唱版)", // 同「我创建·默认收藏」
	"G.E.M.邓紫棋 - 泡沫", // 可能重复·A(高度相似)·同「泡沫」
	"黄龄 - 三拜红尘凉",
	"零一九零贰 - 忘川彼岸2025", // 可能重复·B(较可能同一首)·同「零一九零贰 - 忘川彼岸」
	"降央卓玛 - 走天涯", // 可能重复·B(较可能同一首)·同「龙梅子、老猫 - 走天涯」·同「我创建·Yy」
	"平生不晚 - 难却 (待上浓妆好戏开场)(DJ细霖版)",
	"许嵩 - 幻听", // 可能重复·B(较可能同一首)·同「许嵩 - 幻听」
	"EXO - Baby, Don't Cry (人鱼的眼泪)(Chinese Ver.)",
	"王杰 - 不浪漫罪名", // 同「我创建·默认收藏」
	"阿悠悠 - 一生与你擦肩而过", // 可能重复·A(高度相似)·同「阿悠悠 - 一生与你擦肩而过」
	"单依纯 - 想你时风起",
	"薛之谦 - 意外", // 可能重复·B(较可能同一首)·同「薛之谦 - 意外」
	"张信哲 - 别怕我伤心",
	"海来阿木 - 阿果吉曲", // 可能重复·B(较可能同一首)·同「海来阿木 - 阿果吉曲」
	"宁小泽 - 我终于告别了爱情 (我终于狼狈的弄丢了自己)",
	"张韶涵、HOYO-MiX - 昔涟",
	"王冕 - 勉为其难", // 可能重复·B(较可能同一首)·同「王冕 - 勉为其难」
	"曹格 - 寂寞寂寞不好", // 可能重复·A(高度相似)·同「寂寞寂寞不好-曹格」
	"叶炫清 - 九张机", // 可能重复·B(较可能同一首)·同「黑猫 - 九张机」
	"五凉十坊武威特产馆 - 我独行在天地间",
	"就是南方凯 - 离别开出花",
	"宁小泽、顾焕gkuank - 飞鸟爱上了鱼 (撕裂版)",
	"草帽酱、DJ阿泽 - 青衣 (DJ阿泽版)",
	"伍佰 & China Blue - 突然的自我 (Live)",
	"唐伯虎Annie - 落 (花开花落日升日没)",
	"Ayo97、周思涵 - 感谢你曾来过",
	"张韶涵 - 淋雨一直走", // 可能重复·B(较可能同一首)·同「张韶涵 - 淋雨一直走」
	"鞠婧祎 - 叹云兮", // 可能重复·B(较可能同一首)·同「鞠婧祎 - 叹云兮」
	"汪苏泷、BY2 - 有点甜", // 可能重复·B(较可能同一首)·同「赵炘屿、柒月 - 有点甜」
	"A-Lin - 天若有情", // 可能重复·B(较可能同一首)·同「A-Lin - 天若有情」
	"光良 - 童话", // 可能重复·A(高度相似)
	"周杰伦 - 手写的从前",
	"陈奕迅 - 孤独患者",
)

// 2509（9首）
songs.push(
	"平生青涯 - 一点归鸿", // 可能重复·A(高度相似)·同「一点归鸿-平生青涯」
	"鱼大仙儿 - 我曾", // 可能重复·A(高度相似)·同「我曾」
	"杜宣达 - 原来我从未忘记你",
	"陈奕迅 - 富士山下", // 可能重复·B(较可能同一首)·同「陈奕迅 - 富士山下」
	"迟志强、张秀艳 - 十不该", // 同「我创建·Yy」
	"刘牧 - 十三不亲",
	"庾澄庆 - 春泥", // 可能重复·A(高度相似)·同「庾澄庆 - 春泥」
	"旺仔加真露 - 若把你", // 可能重复·B(较可能同一首)·同「旺仔加真露 - 若把你」
	"5媚娘 - 夜深了", // 可能重复·B(较可能同一首)·同「5媚娘 - 夜深了」
)

// zb（2首）
songs.push(
	"Ugress - Undead Funeral March",
	"DJ铁柱 - 泰式电摇舞DJ (Kiat Jud Dai)",
)

// 直播（3首）
songs.push(
	"BGHY苏刚、花臂轩 - 泰式蹦迪", // 同「我创建·改编/鬼畜/片段/DJ」
	"Various Artists - 玛丽医生 (乡村民谣版)", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」·同「我创建·改编/鬼畜/片段/DJ」
	"Ben Morfitt (SquidPhysics) - GTA San Andreas Theme (Remake)",
)

// 预添加（8首）
songs.push(
	"蔡文姬、澜 - Cheap Thrills (二胡版)", // 可能重复·B(较可能同一首)·同「蔡文姬、澜 - Cheap Thrills (二胡版)」
	"八音盒 - Sacred Play Secret Place (DJ版)",
	"六哲、陈娟儿 - 错错错", // 可能重复·B(较可能同一首)·同「六哲、陈娟儿 - 错错错」
	"少女泪 - 小小的一片云呀 (童年走马灯)",
	"斯佳丽Scarlett - 单恋一枝花 (你应该大声说拜拜)",
	"王力宏 - 爱错", // 可能重复·A(高度相似)·同「爱错」
	"李荣浩 - 不将就", // 可能重复·B(较可能同一首)·同「李荣浩 - 不将就」
	"薛之谦 - 演员", // 可能重复·B(较可能同一首)·同「薛之谦 - 演员」
)

// 我的怀旧经典（1首）
songs.push(
	"刀郎 - 西海情歌", // 可能重复·B(较可能同一首)·同「刀郎 - 西海情歌」
)

// mom（2首）
songs.push(
	"梅朵 - 如果最先遇到的人是我", // 同「我创建·默认收藏」
	"龙梅子 - 下辈子做你的女人",
)

// 潮流尝鲜（270首）
songs.push(
	"戴羽彤 - 漠河舞厅", // 可能重复·B(较可能同一首)·同「柳爽-漠河舞厅」
	"羊羊 - 用情", // 可能重复·A(高度相似)·同「用情」·同「我创建·默认收藏」
	"古巨基 - 匆匆那年 (Live)", // 可能重复·B(较可能同一首)·同「王菲 - 匆匆那年」
	"李荣浩 - 麻雀", // 可能重复·A(高度相似)·同「麻雀」
	"程佳佳 - 山楂树の恋", // 可能重复·B(较可能同一首)·同「程佳佳 - 山楂树の恋」
	"Maroon 5 - Sugar",
	"一壶酒馆 - 传奇 (格桑花版)",
	"吴彤 - 好春光 (贺岁版)",
	"张韶涵 - 破茧", // 可能重复·B(较可能同一首)·同「张韶涵 - 破茧」
	"Joel Adams - Please Don't Go", // 同「我创建·和平精英音乐合集」
	"花粥 - 遥不可及的你",
	"岳云鹏 - 西楼儿女", // 可能重复·B(较可能同一首)·同「海来阿木 - 西楼儿女」
	"G.E.M.邓紫棋 - 泡沫", // 可能重复·A(高度相似)·同「泡沫」
	"怪阿姨 - 放纵L", // 可能重复·B(较可能同一首)·同「怪阿姨 - 放纵L」
	"晴天姐妹 - 最后的人 (手鼓版)",
	"郭采洁 - 我的未来式",
	"马天宇 - 该死的温柔", // 可能重复·B(较可能同一首)·同「马天宇 - 该死的温柔」
	"李健 - 贝加尔湖畔",
	"萧忆情Alex - 不谓侠", // 可能重复·B(较可能同一首)·同「小阿七 - 不谓侠」
	"徐海俏 - 南下",
	"茄子蛋 - 浪子回头",
	"Jain - Lil Mama",
	"Camila Cabello、Young Thug - Havana",
	"萨顶顶 - 万物生 (Chinese Version)",
	"虎二 - 窗", // 可能重复·B(较可能同一首)·同「虎二 - 窗」
	"沈梦溪 - 妈妈的话", // 可能重复·B(较可能同一首)·同「Zyboy忠宇 - 妈妈的话」
	"徐泽（要不要买菜） - 多情种", // 可能重复·A(高度相似)·同「要不要买菜 - 全是爱 (片段)」
	"Selena Gomez、Marshmello - Wolves", // 可能重复·B(较可能同一首)·同「Mia Love、James Major - Wolves」
	"马旭东 - 入戏太深", // 可能重复·A(高度相似)·同「入戏太深 - 马旭东」
	"柏松 - 世间美好与你环环相扣",
	"赵雷 - 我记得",
	"渡 - 须尽欢", // 可能重复·B(较可能同一首)·同「郑浩 - 须尽欢」
	"一棵小葱、张曦匀 - 壁上观",
	"陈奕迅 - 白玫瑰",
	"郭旭 - 不找了", // 可能重复·C(可能同一首)·同「林达浪 - 不找了 (片段)」
	"李健 - 传奇", // 可能重复·B(较可能同一首)·同「王菲 - 传奇」
	"许明明 - 青春的颜色 (合唱版)",
	"Anna F. - Too Far",
	"Greyson Chance - Summertrain",
	"ДЕТИ RAVE - УРЫЛ 0$ (抢劫0$)(Explicit)",
	"邵帅 - 写给黄淮 (Demo)",
	"河图 - 第三十八年夏至",
	"老狼、王婧 - 想把我唱给你听", // 可能重复·B(较可能同一首)·同「半吨兄弟、王小草 - 想把我唱给你听」
	"陈粒 - 奇妙能力歌",
	"凤凰传奇 - 奢香夫人", // 可能重复·B(较可能同一首)·同「凤凰传奇 - 奢香夫人」
	"Billie Eilish - bad guy", // 同「我创建·two」
	"郭斯 - 小神仙",
	"四熹丸子 - 天亮以前说再见 (雪花多舍不得冬天)", // 可能重复·A(高度相似)·同「天亮以前说再见」
	"王媛渊 - 三妻四妾", // 可能重复·B(较可能同一首)·同「王媛渊 - 三妻四妾」
	"国风新语、浮生梦、汐音社 - 探窗",
	"陈粒 - 易燃易爆炸",
	"隔壁老樊_樊凯杰 - 四块五", // 可能重复·B(较可能同一首)·同「隔壁老樊_樊凯杰 - 四块五的妞 (DJ版)」
	"方天雷 - 依兰爱情故事",
	"安与骑兵 - 红山果",
	"蒋雪儿Snow.J - 落了白",
	"龙梅子、老猫 - 爱情专属权", // 可能重复·B(较可能同一首)·同「龙梅子、老猫 - 爱情专属权」·同「我创建·Yy」
	"孟维来 - 野人",
	"薛之谦 - 绅士", // 可能重复·A(高度相似)·同「绅士-薛之谦」
	"Blaxy Girls - If You Feel My Love (Chaow Mix)",
	"于和伟 - 只字不提",
	"Tank - 三国恋",
	"薛之谦 - 动物世界",
	"Anson Seabra - Keep Your Head Up Princess",
	"Jada Facer、Kyson Facer - A Thousand Years",
	"MAKJ、Timmy Trumpet、Andrew W.K. - Party Till We Die (feat. Andrew W.K.)",
	"平生不晚 - 传说 (戏腔版)",
	"丢火车乐队 - 白兰鸽巡游记",
	"京剧·吴昊 - 走卒 (戏腔女版)",
	"烟(许佳豪) - 再见我的女孩",
	"小沈阳 - 大笑江湖", // 可能重复·B(较可能同一首)·同「小沈阳 - 大笑江湖」
	"家家 - 命运", // 可能重复·B(较可能同一首)·同「家家 - 命运」
	"Chris Medina - What Are Words",
	"程响 - 故事终章",
	"郭静 - 下一个天亮", // 可能重复·B(较可能同一首)·同「颜人中 - 下一个天亮」
	"刘大拿 - 寂寞沙洲冷 (女声治愈版)",
	"曲婉婷 - 没有什么不同",
	"阿吉太组合 - 阿衣莫", // 可能重复·B(较可能同一首)·同「阿吉太组合 - 阿衣莫」
	"柏松 - 寻常岁月诗", // 可能重复·B(较可能同一首)·同「冬日暖阳 - 寻常岁月诗」
	"任素汐 - 王招君 (你看你拉住我的模样)",
	"黛青塔娜、HAYA乐团 - 寂静的天空",
	"매드 클라운 (Mad Clown)、金娜英 - 다시 너를 (再次见到你)", // 可能重复·B(较可能同一首)·同「阿YueYue、螃蟹 - 다시 너를 (再次见到你)」
	"解忧草、冰幽 - 辞·九门回忆", // 可能重复·B(较可能同一首)·同「等什么君(邓寓君) - 辞九门回忆」
	"张韶涵、王赫野 - 篇章", // 可能重复·B(较可能同一首)·同「中铁十四局隧道公司 - 篇章-2022届新学员」
	"于冬然 - 望故乡",
	"王樾安 - 会开花的云", // 可能重复·B(较可能同一首)·同「王樾安 - 会开花的云」
	"L（桃籽） - 偷我心的人",
	"弦子 - 做自己的光",
	"黄静美 - 谢谢你,让我学会放弃",
	"叶炫清 - 双面",
	"刘惜君 - 菩提偈",
	"小阿七 - 雪啊请不要再下",
	"谌宥 - 回忆舍不得删除 (抒情版)",
	"苏诗丁 - 回首遇见",
	"凤九 - 剑魂", // 可能重复·B(较可能同一首)·同「鱼多余 - 剑魂 (DJ版)」
	"谭维维 - 越人歌",
	"杨丞琳、胡宇桐、李润祺 - 如愿 (Live)", // 可能重复·C(可能同一首)·同「王菲 - 如愿」
	"罗婷婷 - 不惊",
	"杨博然 - 不咸不淡",
	"屿汐学长 - 七分糖",
	"周深 - 小美满",
	"余又 - 海与天",
	"筱亦凡 - 声声慢 (新版)",
	"黎林添娇 - 闭关", // 可能重复·A(高度相似)·同「宿敌_田人」
	"以冬 - 心中长出一片森林",
	"毛阿敏、郑云龙 - 我们不怕",
	"傅锵锵 - 奇怪还是会想你",
	"张德伊玲 - 只若初见",
	"单依纯 - 永不失联的爱 (Live)", // 可能重复·C(可能同一首)·同「虎二 - 永不失联的爱」
	"单依纯 - 想你时风起",
	"阿YueYue、戾格、小田音乐社 - 沈园外", // 可能重复·A(高度相似)·同「沈园外」
	"温奕心 - 一路生花", // 可能重复·B(较可能同一首)·同「温奕心 - 一路生花」
	"唐伯虎Annie - 落 (花开花落日升日没)",
	"萨顶顶 - 左手指月", // 可能重复·C(可能同一首)·同「萨顶顶 - 左手指月 (Live)」
	"张碧晨、毛不易 - 黑月光",
	"司南 - 春三月",
	"Rachel Platten - Lone Ranger", // 同「我创建·QQ飞车音乐合集哈、。」
	"王力宏 - 需要人陪", // 可能重复·B(较可能同一首)·同「付豪 - 需要人陪」
	"丹正母子 - 乌兰巴托的夜",
	"张杰 - 明天过后", // 可能重复·A(高度相似)·同「明天过后-张杰」
	"徐良、阿悄 - 红装",
	"吴雨霏 - 生生世世爱", // 可能重复·B(较可能同一首)·同「夜夜笙歌 - 生生世世爱 (纯音乐版)」
	"GRAE - Taxi",
	"刘大壮 - 我很好",
	"majiko - 心做し (心理作用)(カバー)",
	"王富贵 - 生而平凡", // 可能重复·B(较可能同一首)·同「王富贵 - 生而平凡」
	"侯泽润 - 大风吹倒梧桐树",
	"汪苏泷 - 巴赫旧约", // 可能重复·B(较可能同一首)·同「汪苏泷 - 巴赫旧约」
	"隔壁老樊_樊凯杰 - 姬和不如",
	"Dream Tunes - Every Time We Touch",
	"于冬然 - 听说你",
	"Uu (刘梦妤) - 那女孩对我说", // 可能重复·A(高度相似)·同「那女孩对我说」
	"郝云 - 活着",
	"鬼卞 - 佳人",
	"艾辰 - 白鸽乌鸦相爱的戏码", // 可能重复·B(较可能同一首)·同「潘成（皮卡潘） - 白鸽乌鸦相爱的戏码」
	"王靖雯 - 善变", // 可能重复·B(较可能同一首)·同「王靖雯 - 善变」
	"王宇宙Leto、乔浚丞 - 城北的花",
	"G.E.M.邓紫棋 - 句号", // 可能重复·B(较可能同一首)·同「G.E.M.邓紫棋 - 句号」
	"回音哥 - 海绵宝宝", // 可能重复·A(高度相似)·同「Various Artists - Funk Shui (Main Track｜Full Length)」
	"Maroon 5 - Maps",
	"Uu (刘梦妤) - 气象站台",
	"薛之谦 - 一半",
	"魏晗（懋懋） - 百年孤寂 (新版)",
	"Maroon 5 - Memories", // 可能重复·B(较可能同一首)·同「ＴＲＡ＄Ｈ - Memories」
	"梨笑笑 - 山茶花读不懂白玫瑰", // 可能重复·C(可能同一首)·同「梨笑笑 - 山茶花读不懂白玫瑰」
	"祥嘞嘞、汐音社 - 空台戏 (甘露寺老臣从头劝)",
	"Justin Timberlake、Carey Mulligan、Stark Sands - Five Hundred Miles",
	"MC 몽、Mellow - 죽을 만큼 아파서 (死一样的痛苦)(Feat. 멜로우)", // 同「我创建·QQ飞车音乐合集哈」
	"萧敬腾 - 王妃",
	"Lana Del Rey - Salvatore", // 可能重复·A(高度相似)·同「Salvatore」
	"Alice Merton - No Roots",
	"粥粥和小伙 - 青春的颜色",
	"苏星婕 - 等不来花开", // 可能重复·B(较可能同一首)·同「pro - 等不来花开」
	"一只白羊 - 赐我",
	"叶启田 - 爱拼才会赢", // 可能重复·B(较可能同一首)·同「叶启田 - 爱拼才会赢」·同「我创建·Yy」
	"陈小云 - 爱情的骗子我问你",
	"Alan Walker、Noah Cyrus、Digital Farm Animals、Juliander - All Falls Down", // 可能重复·B(较可能同一首)·同「Alan Walker、Noah Cyrus、Digital Farm Animals、Juliander - All Falls Down」·同「我创建·two」
	"黄龄 - 免我蹉跎苦",
	"Zella Day - East of Eden",
	"GooGoo、王之睿 - 我的纸飞机",
	"老王乐队 - 我还年轻 我还年轻",
	"安子与九妹乐队 - 布谷鸟", // 可能重复·B(较可能同一首)·同「吴欣怡 - 布谷鸟」
	"初音ミク - Ievan Polkka",
	"G.E.M.邓紫棋 - 倒数", // 可能重复·B(较可能同一首)·同「G.E.M.邓紫棋 - 倒数」
	"陈雷 - 欢喜就好",
	"一颗狼星 - 星月原野",
	"Mozgi - Аябо (我再也不)",
	"名决 - 时间的过客", // 可能重复·B(较可能同一首)·同「大宝软妹、w别丢下甜甜 - 时间的过客」
	"木小雅 - 可能否 (新版)", // 可能重复·B(较可能同一首)·同「冷雪儿 - 可能否」
	"丸子呦 - 广寒宫", // 可能重复·B(较可能同一首)·同「丸子呦 - 广寒宫」
	"京剧·吴昊 - 此去半生 (青衣戏腔版)",
	"吉星出租 - 暮色回响",
	"闻人听書_ - 美人画卷", // 可能重复·B(较可能同一首)·同「林小珂 - 美人画卷」
	"蒋雪儿Snow.J - 莫问归期", // 可能重复·B(较可能同一首)·同「蒋雪儿、七叔(叶泽浩) - 莫问归期」
	"陈奕迅 - 不要说话",
	"Tungevaag、Raaban、Richard Smitt - All For Love",
	"Ghostface Playa、Makar Fadeev - Why Not (何不)(Explicit)",
	"MARKEYBEE - Experience",
	"叶蒨文 - 潇洒走一回", // 可能重复·B(较可能同一首)·同「叶蒨文 - 潇洒走一回」·同「我创建·新白娘子传奇」
	"刘思涵 - 走在冷风中", // 可能重复·B(较可能同一首)·同「刘思涵 - 走在冷风中」
	"Alexandra Stan、Manilla Maniacs - ALL MY PEOPLE",
	"Mike Candys - Baby军工小曲 (气场全开版)",
	"垚垚 - Counter Attack (钢琴版)",
	"BY2 - 爱丫爱丫", // 可能重复·B(较可能同一首)·同「李浩然 - 爱丫爱丫」
	"向晚丶 - call of silence (纯音乐)", // 可能重复·B(较可能同一首)·同「吴忧吴虑 - Call of Silence (钢琴版)」
	"bôa - Duvet",
	"毛不易 - 借 (Live)", // 可能重复·B(较可能同一首)·同「毛不易-借」
	"Dante Flows - Tegenpolen (Explicit)",
	"宮本浩次 - 冬の花 (冬之花)",
	"cici_ - 童话镇 (一秒掉入童话世界)",
	"林陈（自动挡吉他手） - 生活没有说明书",
	"陶喆 - 小镇姑娘",
	"陆十二. - 安河桥 (女版)", // 可能重复·B(较可能同一首)·同「安河桥」
	"你家七哥ya - 火苗", // 可能重复·B(较可能同一首)·同「格格 - 火苗」
	"Audiomachine - Conundrum",
	"鷺巣詩郎、高橋洋子 - 残酷な天使のテーゼ (残酷天使的行动纲领)(Director's Edit.Version)(Explicit)",
	"KALEO、slowed down audioss - Way down We Go (Slowed Down Version)",
	"F.I.R.飞儿乐团 - 千年之恋",
	"戴羽彤 - 孤独颂歌", // 可能重复·B(较可能同一首)·同「陈文非 - 孤独颂歌」
	"Gone Bad - My Way (风可以越过荆棘)",
	"周杰伦 - 七里香", // 可能重复·B(较可能同一首)·同「周杰伦 - 七里香」
	"TypeD - 理想境 (Ideal Realm)",
	"胡彦斌 - 月光", // 可能重复·B(较可能同一首)·同「徐良、阿悄 - 月光」·同「我创建·动画片」
	"卢润泽 - 土坡上的狗尾草",
	"姚晓棠 - 会开花的云", // 可能重复·B(较可能同一首)·同「王樾安 - 会开花的云」
	"Jordann - Dehors (外面)(Single Version)",
	"毛不易 - 呓语",
	"李秉成 - 只为你着迷",
	"王梦露 - 大雨还在下 (烟嗓版)",
	"OneRepublic - Counting Stars",
	"苏星婕 - 红色高跟鞋 (释怀版)",
	"KALEO - Way down We Go",
	"魏玉慧 - 相思遥",
	"张杰 - 天下", // 可能重复·B(较可能同一首)·同「邓寓君(等什么君) - 天下」
	"萧萧 - 爱要坦荡荡",
	"张晓棠、石头 - 弱水三千",
	"Michael Calfan、INNA - Call Me Now",
	"刘烨溦 - 不如回家喝自来水",
	"Zyboy忠宇 - 妈妈的话·2024", // 可能重复·B(较可能同一首)·同「Zyboy忠宇 - 妈妈的话」
	"于冬然 - 少一点天份", // 可能重复·B(较可能同一首)·同「孙盛希 - 少一点天份」
	"陈粒 - 光",
	"王睿卓、Damn5z - 重生之我在异乡为异客", // 同「我创建·默认收藏」
	"潘成（皮卡潘） - 白鸽乌鸦相爱的戏码", // 可能重复·B(较可能同一首)·同「潘成（皮卡潘） - 白鸽乌鸦相爱的戏码」
	"祝青（G2er）、灼夭 - 风催雨",
	"周林枫 - 阿嬷",
	"邓寓君(等什么君) - 游京", // 可能重复·B(较可能同一首)·同「海伦 - 游京」
	"冰洁 - 春不晚 (女生版)",
	"草帽酱 - 青衣",
	"卢润泽 - 别让爱凋落",
	"Rauf、Faik - 5 минут (五分钟)",
	"Fin Draper - Cradles",
	"KOKIA - ありがとう・・・ (谢谢…)",
	"Fall Out Boy - Immortals", // 可能重复·B(较可能同一首)·同「Fall Out Boy - Immortals」
	"毛不易 - 东北民谣",
	"徐泽（要不要买菜） - 玫瑰",
	"Maksim、Nikša Bratoš、Remi Kazinoti、Craig Pruess、Orchestra - Croatian Rhapsody (克罗地亚狂想曲)", // 同「我创建·默认收藏」
	"Lenka - The Show",
	"Lightfox - Solo", // 可能重复·C(可能同一首)·同「River - Solo」
	"Radical Face - Welcome Home",
	"FuGa pang - 【FREE】lucky", // 可能重复·A(高度相似)·同「FuGa pang - Lucky」
	"Arc North、New Beat Order、Aaron Richards - Numb", // 可能重复·C(可能同一首)·同「XXXTentacion - NUMB」
	"Adam Christopher - So Far Away (Acoustic)",
	"Pitbull、Kesha - Timber",
	"绾绾w - 我不信你不惭愧 (抒情版)",
	"Calvin Harris、Ellie Goulding - Outside", // 可能重复·C(可能同一首)·同「Calvin Harris、Ellie Goulding - Outside」
	"Justin Bieber - Love Me", // 同「我创建·QQ飞车音乐合集哈」
	"Fall Out Boy - My Songs Know What You Did In The Dark Light Em Up", // 同「我创建·QQ飞车音乐合集哈」
	"Alan Walker、K-391、Tungevaag、Mangoo - Play",
	"Claire Rosinkranz - Hotel",
	"One Direction - What Makes You Beautiful",
	"Powfu、beabadoobee - death bed",
	"MEDUZA、Dermot Kennedy - Paradise",
	"和田薫 - ふたりの気持ち (两人的心情)",
	"Sasha Alex Sloan - Dancing With Your Ghost", // 可能重复·B(较可能同一首)·同「韩ye - Dancing With Your Ghost (Remix)」
	"VIZE、R3HAB、Enny-Mae - One Last Time",
	"Full Trunk - Let's Go (Explicit)",
	"吕嘉慧 - 乌鸦坐神台",
	"jaycd - 梦中的婚礼 (钢琴版)",
	"sapientdream - Promise", // 可能重复·C(可能同一首)·同「顾依辰 - Promise. (片段)」
	"七元 - 壁上观 (边水版)",
	"也可 - 不如 (女声版)", // 可能重复·B(较可能同一首)·同「秦海清 - 不如」
	"金南玲 - 逆流成河", // 可能重复·B(较可能同一首)·同「金南玲 - 逆流成河 (典藏版)」
	"泡芙芙Scarlett - 月光凉，落满窗",
	"CrazyG - 理想境 (纯享版)",
	"王若熙 - 游京 (悠悠古城春心荡漾)",
	"戴羽彤 - 童话镇", // 可能重复·B(较可能同一首)·同「童话镇-陈一发儿」
	"占二曦 - 生死相随 (民谣版)", // 同「我创建·默认收藏」
	"阿YueYue - 叹云兮", // 可能重复·B(较可能同一首)·同「鞠婧祎 - 叹云兮」
	"沉虞CHENY - 此去半生",
	"一颗狼星、国风集 - 春庭雪", // 可能重复·B(较可能同一首)·同「邓寓君(等什么君) - 春庭雪」
	"尹昔眠 - 三拜红尘凉",
)

// TA（59首）
songs.push(
	"周林枫 - 魑魅魍魉 (地府招生曲)",
	"黄霄雲 - 烟火里的尘埃", // 可能重复·A(高度相似)·同「艾辰 - 烟火里的尘埃」
	"梁博 - 出现又离开 (Live)",
	"于冬然 - 座位",
	"告五人 - 带我去找夜生活", // 可能重复·B(较可能同一首)·同「告五人 - 带我去找夜生活 (对爱的执念从不是海0.8x版)」
	"张韶涵 - 暮色回响",
	"凤凰传奇 - 全是爱", // 可能重复·A(高度相似)·同「要不要买菜 - 全是爱 (片段)」·同「我创建·Yy」
	"周传雄 - 冬天的秘密", // 可能重复·B(较可能同一首)·同「张家旺 - 冬天的秘密 (片段)」
	"斯佳丽Scarlett - 单恋一枝花 (你应该大声说拜拜)",
	"G.E.M.邓紫棋 - 桃花诺",
	"GooGoo - 不要慌太阳下山有月光",
	"雷佳 - 人世间", // 可能重复·B(较可能同一首)·同「《人世间》主题曲」·同「我创建·默认收藏」
	"蓝心羽 - 阿拉斯加海湾",
	"四个女生 - 心愿",
	"李玉刚 - 新贵妃醉酒", // 可能重复·B(较可能同一首)·同「李玉刚 - 新贵妃醉酒 (2013CCTV-15音乐频道精彩音乐汇现场)」
	"王唯旖 - 舍得", // 可能重复·B(较可能同一首)·同「王呈章 - 舍得」
	"菲菲公主（陆绮菲） - 第57次取消发送",
	"九三、浅影阿 - 北京东路的日子 (毕业合唱版)",
	"崔子格 - 卜卦", // 可能重复·B(较可能同一首)·同「崔子格 - 卜卦」
	"孙盛希 - 少一点天份", // 可能重复·B(较可能同一首)·同「孙盛希 - 少一点天份」
	"窝窝 - 月亮照山川", // 同「我创建·默认收藏」
	"孟颖 - 黎明前的黑暗", // 可能重复·B(较可能同一首)·同「9馨 - Bater Official」
	"HITA - 赤伶", // 可能重复·B(较可能同一首)·同「等什么君(邓寓君) - 赤伶」
	"徐秉龙、沈以诚 - 白羊", // 可能重复·B(较可能同一首)·同「徐秉龙、沈以诚 - 白羊」
	"泡芙芙Scarlett - 芦苇飞",
	"浅影阿、汐音社 - 探故知",
	"王睿卓 - 茶花开了",
	"陈墨一（吖毛） - 回不去的何止时间", // 可能重复·B(较可能同一首)·同「陈墨一（吖毛） - 回不去的何止时间 (网友改编)」·同「我创建·默认收藏」
	"花粥、马雨阳 - 盗将行", // 可能重复·B(较可能同一首)·同「艾辰 - 盗将行」
	"汪拾米 - 盛开",
	"迪玛希Dimash - 有你",
	"阿YueYue、刘兆宇 - 冬眠·2023",
	"h3R3刘清云、张鑫 - 先说谎的人",
	"王蓝茵 - 恶作剧",
	"李荣浩 - 戒烟", // 可能重复·B(较可能同一首)·同「Gifty - 戒烟」
	"李荣浩 - 模特",
	"赵方婧 - 小巷",
	"徐俊雅 - 爱你 (把我们衣服纽扣互扣)",
	"蔡健雅 - 坠落",
	"范玮琪、张韶涵 - 如果的事",
	"陈子晴 - 偏向",
	"林俊杰 - Always Online",
	"蔡健雅 - 越来越不懂", // 可能重复·A(高度相似)·同「越来越不懂-蔡健雅」·同「我创建·默认收藏」
	"小乐哥（王唯乐） - 执迷不悟", // 可能重复·C(可能同一首)·同「小乐哥（王唯乐） - 执迷不悟」
	"徐佳莹 - 一样的月光",
	"毛不易 - 一程山路",
	"周杰伦 - 蒲公英的约定", // 可能重复·A(高度相似)·同「周杰伦-蒲公英的约定」
	"林俊杰 - 当你",
	"欧阳耀莹 - 戒不掉",
	"邵帅 - 暖一杯茶", // 可能重复·B(较可能同一首)·同「邵帅 - 暖一杯茶」
	"F.I.R.飞儿乐团、彭佳慧 - 心之火", // 可能重复·C(可能同一首)·同「F.I.R.飞儿乐团、彭佳慧 - 心之火」·同「我创建·花千骨」
	"周杰伦 - 最长的电影",
	"陈奕迅 - 稳稳的幸福",
	"Ayo97、周思涵 - 感谢你曾来过",
	"G.E.M.邓紫棋 - 再见", // 可能重复·A(高度相似)·同「周杰伦 - 说了再见」
	"陈奕迅 - 孤独患者",
	"G.E.M.邓紫棋 - 倒数", // 可能重复·B(较可能同一首)·同「G.E.M.邓紫棋 - 倒数」
)

// 我收藏的歌单·酷狗：
// 温柔纯音乐（适合写作业）（3首）
songs.push(
	"赵海洋 - 瞬间的永恒 (钢琴曲)",
	"Richard Abel - Kiss The Rain (雨的印记)",
	"Ludovico Einaudi、Daniel Hope、I Virtuosi Italiani - Experience (经验)",
)

// 找不到名的英文歌（21首）
songs.push(
	"BLACKPINK - DDU-DU DDU-DU (Korean Ver.)",
	"薛之谦、翟潇闻 - Always online (2021新春潮乐会现场)",
	"BLACKPINK - 붐바야 (Korean Ver.)",
	"Justin Bieber - As Long As You Love Me (DJ白一阳版)",
	"罗百万 - 帝国崩塌进行曲 (纯音乐)",
	"Vitas - Звезда (The star)",
	"hanser - 室内系的TrackMaker",
	"Jawsh 685、Jason Derulo - Savage Love (Laxed - Siren Beat)(Explicit)",
	"YahikoNy - BonBon (Monkey Mo Remix)",
	"伊清璇 - This Is What You Came For", // 可能重复·B(较可能同一首)
	"BLACKPINK - Sure Thing (Live At IN YOUR AREA SEOUL TOUR 2018)",
	"Alan Silvestri - Portals (From ＂Avengers： Endgame＂／Score)",
	"susie、Farfashah - My Nam's Suzie",
	"刘至佳 - 热带雨林",
	"Vayshy - De Yang Gatal Gatal Sa",
	"Stray Kids - ソリクン (歌唱能手)(Japanese ver.)",
	"cinnamons、evening cinema - Summertime",
	"Era Istrefi - Bonbon",
	"Lil Preemp - I Love It When You Call Me Senorita",
	"Twinbed - Trouble I'm In",
	"Jibbs - Chain Hang Low",
)

// 深夜抑郁了（emo）（11首）
songs.push(
	"Bruno Mars - Talking to the Moon",
	"琥珀琴师Louis - Somewhere (纯钢琴版)",
	"纯音乐 - The Right Path (纯钢琴版)",
	"江映东 - In the eyes",
	"文武贝 - 夜的钢琴曲5",
	"蓝云木 - Old Memory",
	"ＴＲＡ＄Ｈ - WAITING", // 可能重复·B(较可能同一首)
	"Sleep Dealer - Hidden Path",
	"Nick Shatirishvili - La Vie Ne Ment Past",
	"Cymophane - Tassel (流苏)",
	"陈壹千 - 心似烟火",
)

// 许嵩&汪苏泷&徐良：似水流年，青春如梦（22首）
songs.push(
	"汪苏泷 - 祝我快乐",
	"徐良 - 友情出演",
	"小凌、徐良 - 无颜女",
	"许嵩 - 微博控",
	"汪苏泷 - 唯你懂我心",
	"徐良、阿悄 - 天真",
	"汪苏泷 - 三国杀",
	"徐良、孙羽幽 - 情话", // 可能重复·B(较可能同一首)
	"徐良、孙羽幽 - 情话 (Single Version)",
	"徐良、孙羽幽 - 虐心",
	"许嵩 - 燕归巢",
	"汪苏泷 - 你让我懂",
	"汪苏泷、阿悄 - 埋葬冬天",
	"汪苏泷 - 苦笑",
	"汪苏泷 - 忽而今夏",
	"许嵩 - 坏孩子",
	"徐良、Britneylee小暖 - 和平分手",
	"许嵩 - 认错",
	"汪苏泷 - 放不下",
	"徐良、汪苏泷 - 十大金曲串烧 (2015第15届音乐风云榜现场)",
	"汪苏泷 - 小星星",
	"许嵩 - 半城烟沙",
)

// 伤感情歌：爱你却换来彻骨的痛（70首）
songs.push(
	"半吨兄弟、付豪 - 我在你眼里到底算什么",
	"半吨兄弟 - 我是不是该安静的走开",
	"付豪 - 我们应该不会再见了",
	"小阿枫 - 下辈子也要找到你",
	"张茜（张惜淇）、半吨兄弟 - 爱似水仙 (合唱版)",
	"小阿枫 - 用心爱你你不懂", // 可能重复·B(较可能同一首)
	"半吨兄弟 - 用心爱你你不懂",
	"花姐 - 一个多情又无情的人", // 可能重复·B(较可能同一首)
	"花姐 - 一个多情又无情的人 (DJ光音坊版)",
	"付豪 - 爱情指南 (DJ伟然版)",
	"王韵 - 入了心的人",
	"小阿枫 - 移情别恋",
	"小阿枫 - 心要让你听见",
	"小阿枫 - 我只在乎你", // 可能重复·B(较可能同一首)
	"虎二 - 我们不需这样",
	"花姐 - 此情一直在心间",
	"虎二 - 谁在怀念",
	"小阿枫 - 情人鹤顶红",
	"付豪 - 男人至死是少年",
	"半吨兄弟 - 女人的选择",
	"小阿枫 - 错过的情人",
	"虎二 - 你说可以吗",
	"付豪 - 你希望她过得好吗",
	"付豪 - 你不配我的泪",
	"付豪 - 喝不够的酒",
	"小阿枫 - 曾经心痛",
	"付豪 - 再也不是你",
	"付豪 - 戒不掉的烟", // 可能重复·B(较可能同一首)
	"烟(许佳豪)、超星 - 戒不掉的烟",
	"半吨兄弟 - 我这一生",
	"半吨兄弟 - 我是真的爱上你", // 可能重复·B(较可能同一首)
	"en (王翊恩) - 我是真的爱上你",
	"成学迅 - 时间没教会我忘记",
	"虎二 - 你一定要幸福",
	"范茹 - 时间你慢些走",
	"付豪 - 凌晨三点的夜晚",
	"大壮 - 谁不是在流浪",
	"花姐 - 无情的街孤单的夜",
	"付豪 - 也很值得",
	"魏佳艺 - 掌心之中",
	"半吨兄弟 - 风雨无阻", // 可能重复·B(较可能同一首)
	"周华健 - 风雨无阻",
	"侯泽润 - 惩罚与奖励",
	"半吨兄弟 - Andy (烟嗓版)",
	"魏佳艺 - 生于人间何罪之有",
	"付豪 - 需要人陪", // 可能重复·B(较可能同一首)
	"杜天宇 - 男人的累自己体会",
	"海来阿木 - 归途有风",
	"半吨兄弟 - 壮志在我胸", // 可能重复·B(较可能同一首)
	"半吨兄弟 - 壮志在我胸 (DJ京仔版)",
	"魏佳艺 - 漂泊的人 (烟嗓版)", // 可能重复·B(较可能同一首)
	"魏佳艺 - 漂泊的人 (烟嗓版)(DJ默涵版)",
	"苏谭谭 - 一半疯了一半算了", // 可能重复·B(较可能同一首)
	"三秒 - 一半疯了一半算了",
	"苏谭谭 - 一半疯了一半算了 (DJ默涵版)",
	"半吨兄弟 - 老男孩 (烟嗓版)",
	"半吨兄弟 - 如果爱忘了 (烟嗓版)",
	"虎二 - 离开我你快乐吗",
	"大欢 - 思念的纠缠",
	"烟(许佳豪) - 都怪我不配",
	"花姐 - 错的人是我",
	"子尧（阮洪尧） - 我曾爱过一个人",
	"刘晓超 - 想问情深有几许",
	"梅伊伊 - 一生只爱你一次", // 可能重复·B(较可能同一首)
	"梅伊伊 - 一生只爱你一次 (DJ默涵版)",
	"鱼精 - 一生只爱你一次",
	"付豪 - 谁卑微了承诺",
	"半吨兄弟 - 我们说好的 (烟嗓版)",
	"半吨兄弟 - 野花做了场玫瑰花的梦 (DJ九零版)", // 可能重复·B(较可能同一首)
	"半吨兄弟 - 野花做了场玫瑰花的梦", // 可能重复·B(较可能同一首)
)

// 一个人听的苗族歌曲（108首）
songs.push(
	"Theloswing - Txoj Kev",
	"张福斌 - hlub koj xwb",
	"网络歌手 - Tseem nco koj",
	"杨军 - 苗家的生活",
	"华语群星 - Tsuas Muaj Los Nag by Wave and Joy",
	"天使的凤凰【杰】 - Thov ib zaug ntxiv-T",
	"Maa Vue - TXIV LUB XIM XAUS", // 可能重复·C(可能同一首)
	"Tinker Bell - Txiv Lub Xim Xaus (Remix)",
	"Yasmi - Nkauj See",
	"Yasmi - Sij Hawm No",
	"Yasmi、Ali Chang - Hmo No",
	"徐金 - 苗族歌曲伤感情歌",
	"HMOOBNYAUJKOJ音乐 - xav nyob ze koj",
	"徐金 - TxivNraugNtsuag",
	"徐金 - Cia Luag Mam Hlub", // 可能重复·B(较可能同一首)
	"Miao Qiang - Cia Luag Mam Hlub",
	"et yaj sua ham - kev hlub txiav tsis tau",
	"Tinker Bell - Descendants",
	"Miao Qiang - Hmoov Zoo Tau Ntsib Koj (苗族歌曲)",
	"hmoob - tu siab nrho", // 可能重复·C(可能同一首)
	"徐金 - Hmoob",
	"DeathRhyme、Maa Vue - Lub Ntuj (Hmong rap)",
	"Fbixkub - 4 Xyoos Dhau Los",
	"YAYA MOUA、Yeng Moua - Noj Peb Caug",
	"Miao Qiang - Yeej Tsis Paub(苗族歌曲)女生版 (Live)",
	"网络歌手 - leej muam",
	"Miao Qiang - Pub Lub Siab Rau Kuv",
	"Maa Vue、David Yang - ROV POM KOJ DUA",
	"kiana lor - Tsis Tu Siab 2.0",
	"David Yang - Ntawm Koj",
	"网络歌手 - POOB SIAB SAUM TOJ ROOB",
	"Escapes - Hlub Li Npau Suav",
	"若我只是个过客 - 变心",
	"Abyeeb Yaj、Mang Vang - Ntshai koj tsis hlub",
	"Nikki Thao - Xav Hais Qhia Tias Hlub Koj",
	"Maa Vue - Nyob Ua Ke",
	"Maa Vue - Lub Hli Puag Lub Hnub",
	"Gao Nou kue、Mang Vang、TINKER B - YOGHMOOVDABTSI",
	"古美芬 - 你走了我的心已死 (苗语女生版)",
	"古美芬 - 为何你要这样丢下我 (苗语女生版)",
	"罗娜依 - hlub kuv tsis txhob ncaim kuv mus",
	"罗娜依 - 要怎么说",
	"Abyeeb Yaj - Nws siab phem los koj tias OK",
	"Ka Lia Universe、Kenny Logic - Nraug Nas (Dear Love)",
	"杨纳兰、白老板 - 一生最爱的你",
	"Abyeeb Yaj - Bye bye Tsis hlub tus neeg laim cais",
	"华语群星 - 苗族伤感歌曲",
	"Nikki Thao - Neeg Phem",
	"Nikki Thao - Wb Yog Ib Khub",
	"Nuna Yaj - Zaum nrog hwj beer",
	"nraug hmoob - Koj Mus Yuav Txiv Qh",
	"网络歌手 - Ws Tsis Yog Vim Txoj Hmoo",
	"阿卯之音 - 阿卯恋情",
	"Deeda Thao - Ua Tsaug Nab Khoom",
	"苗族Maiv Thoj - Nyiag Nyiam Koj (苗族歌曲)",
	"Maa Vue - Tsis Muaj Koj",
	"Maa Vue - ib Hnub",
	"Deeda Thao、Mai Vee Vang - Maj Mam Qhia",
	"DeathRhyme、Tinker Bell、Angel - Nkauj Hmoob (MixRap)",
	"Deeda Thao - Ntuj es Txiv Leej Tub",
	"DeathRhyme - Koj Puas Kam (Hmong rap)",
	"Hmoob nkauj - Quas Koj Ntxhais Rau Kuv Tub",
	"Maa Vue - Sij Hawm Tsis Tos",
	"Pajzaub Thoj - Daim Ntawv Saum Ntuj",
	"Tinker Bell、DeathRhyme - Puas muaj hnub tau koj (Hmong rap)",
	"DeathRhyme - Nco ntsoov txog kuv (Hmong rap)",
	"Tinker Bell - The Shaman (New edition)",
	"乔思莞 - 苗族说唱歌曲",
	"Maa Vue - Kob Nag",
	"华语群星 - Qub Neeg Qub Siab",
	"DeathRhyme - Kua Muag Rov (Hmongrap)",
	"罗娜依 - 跟你走",
	"陶发英 - 来到苗族风情园",
	"Miao Qiang - Cia Koj Rau Luag Puag",
	"歹匕 - Tus Kuv Hlub",
	"DeathRhyme、Chialy Lor - Sib hawm twb tig (Hmong rap)",
	"DeathRhyme - Tso Tseg",
	"杨七花 - Tsis Muaj koj lawm",
	"Melinda Vang、DeathRhyme - Khuv Xim (Single Version)",
	"DeathRhyme、Tupao Xiong - Ntxub (Deathrhyme、Album Version)",
	"DeathRhyme - Kev Hlub Dhau Los",
	"罗娜依 - 生死恋",
	"邹兴兰 - 爱的碗惜",
	"荟儿 - 咪多蒙",
	"Yeng Moua - Yog Vim Li Cas",
	"Maa Vue - Tsab Ntawv",
	"Nikki Thao - Yog Hlub Nrog Kuv",
	"DeathRhyme - Txiv Lub Kua Muag",
	"Melinda Vang、DeathRhyme - Hmoov Tsis Zoo",
	"Magiic Hang、Douachi Yang - Ua Siab Ntev",
	"da vang、HISO - Nyuam Qhuav Sib Ntsib",
	"YASMI、Deeda Thao - Txhob Tos Txoj Hmoo (&Joy)",
	"DeathRhyme - Mus Ua Nyab",
	"中国西南苗族音乐 - 妈妈我嫁人了你别哭",
	"Abyeeb Yaj - Tus ib txwm hlub",
	"Ntxheb Yaj、Tiaj Xyooj - Paj Tag Nuj Nplhaib Zag",
	"Miao Qiang - Leej Nus Dai Siab",
	"Kwm Lis - Kev Hlub Tws Rau Koj",
	"Deeda Thao、Kay Xiong - Tus Luag Lis Ntxhi", // 可能重复·B(较可能同一首)
	"Hmoob nkauj - 苗族歌曲 - Tus Luag Lis Ntxhi",
	"Hmoob nkauj - 苗族歌曲Txhob tos lwm tiam",
	"万秀萍、古美芬 - 天高路远",
	"Hmoob nkauj - 苗族歌曲Tsis Muaj Nws Koj Puas Hlub Kuv",
	"苗族阿花 - 苗族歌曲Tos Ntsoov Koj",
	"yasmi Hmoob - teesm nyob tos koj",
	"Miao Qiang - tsis muaj leej twg txiav tau wb",
	"Maa Vue - Tu Moo",
	"苗族Maiv Thoj - Txaus Siab Rau Yam Yus Muaj (苗族歌曲)",
)

// 超好听英文，你绝对爱（4首）
songs.push(
	"Shiloh Dynasty - Still Waiting",
	"Just Kiddin、Camden Cox - Stay The Night",
	"Taylor Grey - Intentionally",
	"Hedley - Lose Control (Explicit)",
)

// 许嵩 徐良 汪苏泷TOP50（13首）
songs.push(
	"许嵩 - 南山忆",
	"许嵩 - 叹服",
	"许嵩 - 灰色头像",
	"汪苏泷 - 因为了解",
	"汪苏泷 - 他的爱",
	"汪苏泷 - 慢慢懂",
	"徐良、阿悄 - 月光", // 可能重复·B(较可能同一首)
	"徐良、小凌 - 飞机场 (Remix)",
	"汪苏泷 - 风度",
	"徐良 - 那时雨",
	"徐良 - 北京巷弄",
	"许嵩 - 山水之间",
	"许嵩、黄龄 - 惊鸿一面",
)

// 一网打尽抖音最火的宝藏歌曲2023（45首）
songs.push(
	"KK彭、Zoe - 高攀",
	"蔡健雅 - 失语者",
	"袁小葳、阿辰（阎辰） - 化作烟火为你坠落",
	"鞠婧祎 - 花",
	"周蕙 - 约定",
	"王子健 - 舍离去",
	"李荣浩 - 乌梅子酱",
	"那奇沃夫、KKECHO - 苦咖啡·唯一",
	"韵儿 - 感情游戏",
	"王大毛、DJ小鱼儿 - 黑桃A (合唱版)",
	"残雪 - 半张合影 (男版)",
	"川青 - 生分",
	"808-G11（关丁凡） - 数绵羊",
	"张洛一 - 相拥星空",
	"含大仙儿 - 人间的晚风",
	"张洛一 - 寻觅",
	"MAY - 落尘香",
	"ycccc、R7 - 满天星辰不及你 (DJ R7版)",
	"张洛一 - 在即",
	"小鬼阿秋 - 你爱我坏", // 可能重复·B(较可能同一首)
	"小鬼阿秋 - 你爱我坏 (DJ沈念版)",
	"周林枫 - 镜中渊",
	"彭安琪Angie - 过界",
	"辛雯 - 后会未有期",
	"1K - 就忘了吧",
	"向思悦、不二熊 - 上岸的鱼",
	"李浩然 - 爱丫爱丫", // 可能重复·B(较可能同一首)
	"李尖尖 - 氧化氢",
	"余又 - 回音",
	"云汐 - 离人赋",
	"戴羽彤 - 等着我回来",
	"阿梨粤、R7 - 秒针 (DJ R7版)",
	"就是南方凯 - 巡光",
	"颜人中 - 下一个天亮", // 可能重复·B(较可能同一首)
	"麻辣仙人球 - 你的秘语",
	"就是南方凯 - 你就是远方",
	"南葵 - 星与岛",
	"王志心 - 听众",
	"Zkaaai - 失语者 (治愈版)",
	"张洛一 - 遥不可及的星河",
	"Liko - 寄信予海",
	"麻辣仙人球 - 星座信箱",
	"杨玛丽 - 遗失的爱",
	"张洛一 - 如果时光倒流",
	"辛雯 - 心跳回应",
)

// QQ飞车BGM-琳琅天上（13首）
songs.push(
	"R!N／Gemie、SawanoHiroyuki[nZk] - Saving Us",
	"Lil Baby、Drake - Yes Indeed (Explicit)",
	"The Cab - Angel With a Shotgun",
	"GFRIEND - 시간을 달려서 (Rough) (时间流逝)",
	"American Authors - What We Live For",
	"Shakira - Try Everything (From ＂Zootopia＂｜Soundtrack)", // 可能重复·B(较可能同一首)
	"AOA - Good Luck",
	"Blake Shelton - Friends",
	"8 Stops7 - My Would-Be Savior (Album Version)", // 可能重复·B(较可能同一首)
	"Agent 51、Chris Armes、Eric Davis、Sean Scura、Michael Levinson - Wrecking Ball (Explicit)",
	"Fort Minor、Styles of Beyond - Remember The Name (Album Version)", // 可能重复·B(较可能同一首)
	"Nightwish - Bye Bye Beautiful (DJ Orkidea Remix)", // 可能重复·B(较可能同一首)
	"Lola Coca - GQ",
)

// 压抑的音乐适合emo（16首）
songs.push(
	"Sweet Rain - 눈꽃송E (The Snow Flower)",
	"Ayasa绚沙 - 渡月橋 ~君 想ふ~ (渡月桥~思君~)(Remix)",
	"BGM姐姐 - 渡月桥思君 (小提琴)",
	"二胡妹 - 告白之夜 (二胡版)",
	"折戸伸治 - 潮鳴り (潮鸣)",
	"纯音乐 - luv u 2",
	"Kan Gao、Laura Shigihara - Born a Stranger (生而陌路)",
	"Sigur Rós - All alright",
	"ROOK1E、J'san - Pure Imagination (纯粹的幻想)",
	"nekoi - Glass",
	"五音旋律 - Night Crusing (小提琴版)",
	"澤野弘之 - Blue Dragon(piano&guitarver)",
	"Ólafur Arnalds - 3055",
	"OCTOBER - Who's Lovin' You (谁爱着你)",
	"AniFace - Last Reincarnation",
	"蛋卷 - 抑郁症以及其他 (Bouns Track 03)",
)

// 【学生时代的回忆】依然记得当时的甜蜜（9首）
songs.push(
	"新乐尘符、贺子玲 - 快说你爱我",
	"刘昊霖 - 儿时",
	"尤长靖 - 昨日青空",
	"王一博 - 年少心事",
	"胡夏、杨颖、王彦霖、白队合唱团 - 凤凰花开的路口 (Live)", // 可能重复·C(可能同一首)
	"都叫我芹菜 - 凤凰花开的路口",
	"南征北战NZBZ - 骄傲的少年",
	"格拉思亚 - 没有理想何必远方",
	"郁可唯 - 时间煮雨 (3D环绕版)",
)

// 【毕业季】散伙的是这场盛夏，而不是我们。（5首）
songs.push(
	"牛奶咖啡 - 再见，昨天",
	"王源 - 友谊地久天长", // 可能重复·B(较可能同一首)
	"逃跑计划 - 再见 再见",
	"可米小子 - 青春纪念册",
	"五月天 - 干杯",
)

// 这又是谁的青春啊（3首）
songs.push(
	"阿婷音乐 - Nota Single Day (钢琴版)",
	"少女时代 - Gee (Korean Ver.)", // 可能重复·B(较可能同一首)
	"Tune Ministry - Thats Not My Name (ATributetoTheTingTings)",
)

// 适合失恋听的歌曲100首赶紧收藏（48首）
songs.push(
	"半吨兄弟 - 最后一次",
	"程今 - 或许",
	"陈子晴、B.I.N - 时间深海",
	"陈雅森 - 擦伤",
	"零柒零一 - 枯木与海",
	"彭宇昕Chloe - 满分距离",
	"彭宇昕Chloe - 星星永远发着光",
	"任然 - 雀跃",
	"刘雨昕 - New And More",
	"张齐山 - 幻星岛",
	"汪六六 - 在他乡 (女生版)",
	"邓岳章 - 魔鬼邂逅",
	"队长、黄礼格 - 11", // 可能重复·C(可能同一首)
	"王靖雯 - 说说话",
	"邓典 - 神魂颠倒",
	"王忻辰、苏星婕 - 放晴",
	"莫叫姐姐 - 那个年代 (莫叫语版)",
	"吕口口 - 沉默以对",
	"刘大壮 - 凑热闹",
	"吴瑭 - 海啸",
	"我是土豆 - 云压雨",
	"欣蒂 - 星河万里",
	"董一涵 - 风中有朵雨做的云 (柔情版)",
	"Lorien - 万年星光",
	"en (王翊恩) - 北纬23°26’",
	"Uu (刘梦妤) - 全名",
	"莫叫姐姐 - 爱情让我痛",
	"王靖雯 - 下一个",
	"音格概念、逸霄 - 零点又十分",
	"陈小满 - 忘了自己",
	"蔡鹤峰 - 失忆 (男生版)",
	"谜兔 - 坠入星河",
	"刘家奇阿 - 我丢了她",
	"颜人中 - 处处遗憾",
	"呆呆破 - 假装快乐",
	"邢不行先生 - 骗",
	"莫叫姐姐 - 累了痛了放手了",
	"王靖雯 - 空欢喜",
	"小田音乐社、尹昔眠 - 错把路灯当月光",
	"薛之谦、郭聪明 - 耗尽",
	"哈利Halleeee - 星星失眠",
	"Joysaaaa - 即刻",
	"刘大壮 - 最",
	"크림 - 금요병 (周五病)",
	"高鱼 - 过活",
	"小乐哥（王唯乐） - 收敛",
	"单依纯 - 爱的回归线 (Live)", // 可能重复·C(可能同一首)
	"陈韵若、陈每文 - 爱的回归线", // 可能重复·C(可能同一首)
)

// 学生时代：静听属于我们的歌声（12首）
songs.push(
	"金莎 - 最后一个夏天",
	"时代少年团 - 少年时代",
	"曲甲 - 校园时光",
	"阿禹ayy - 一吻天荒 (热血版)",
	"后弦、SARA - 你还欠我一个拥抱",
	"王筝 - 我们都是好孩子",
	"S.H.E - 你曾是少年",
	"高骏生、黄梓溪、李子涵 - 宠溺",
	"霍含蕾Rea - 星河陨落",
	"小阿七 - 浪",
	"夏婉安 - 一个人",
	"Liko、庄淇玟29 - 像雨吹起了风",
)

// 重度抑郁症才会患上的歌。（9首）
songs.push(
	"Jo Blankenburg - Villanelle",
	"Cat naps - time", // 可能重复·C(可能同一首)
	"Mei - ♡ ʇnq n ǝʌol ı",
	"Martin Arteta、11：11 Music Group、creamy、Jasper - Past Lives",
	"村上純 - 別れの予感",
	"¿Téo？ - Ascended Vibrations",
	"The Tumbled Sea - ø",
	"dylanf - 天空云海",
	"Sylvain Chauveau - Blanc",
)

// 感受粤语的浪漫（19首）
songs.push(
	"苏小宝、杨邪 - 真的爱你 (DJ咚鼓版)",
	"耀仔 - 根本你不懂得爱我 (DJ耀仔版)",
	"王大美 - 吴哥窟", // 可能重复·B(较可能同一首)
	"新腾 - 爱的故事上集 (DJ新腾版)",
	"Dj榜单 - 阿星私人订制",
	"应嘉俐、嘭心 - 活着viva (DJ House版)",
	"草蜢 - 半点心 (DJ泽豪、DJ沐泽版)", // 可能重复·B(较可能同一首)
	"草蜢 - 半点心",
	"常颖杰 - 必杀技",
	"邓丽欣 - 电灯胆 (DJ版)",
	"阿NICK - 庆幸 (DJ版)",
	"仁川 - 还是放弃无谓献丑 (治愈版)",
	"梦涵 - 爱的暴风雨 (DJ霄霄版)",
	"张与桐（阿细） - 灰尘",
	"一杯陈豆浆 - 森林", // 可能重复·B(较可能同一首)
	"一杯陈豆浆、梁森田 - 指纹", // 可能重复·B(较可能同一首)
	"胡歌 - 指纹",
	"一杯陈豆浆 - 错过的情人 (粤语版)",
	"Zyboy忠宇 - 春娇与志明 (17秒片段)",
)

// 修仙歌曲bgm+游戏必备歌曲（19首）
songs.push(
	"听风人 - 我曾爱过一个人 (笛子版)",
	"夜夜笙歌 - 生生世世爱 (纯音乐版)", // 可能重复·B(较可能同一首)
	"夜狸Yeli - Nijamena (Live)", // 可能重复·C(可能同一首)
	"搬运工 - So weak (DJ版)",
	"Mono Inc.、Martin Engler - Children Of The Dark (Instrumental)",
	"萌帅 - 生生世世爱 (笛声版)",
	"Nanne - Håll om mig (DJRE版)",
	"DJ小九九 - 曾爱过一个人",
	"麦振鸿 - 雪见·落入凡尘",
	"纯音乐 - 人声鼎沸",
	"麦振鸿 - 仙剑奇缘",
	"溏心李诗凡 - 雪见—仙凡之旅",
	"纯音乐 - 应天府城郊",
	"小旭音乐 - 西游伏妖篇-酒馆音乐",
	"麦振鸿、风铃 - 莫失莫忘",
	"李柄桦 - So Weak (正版)",
	"萧人凤、贾卓伦、骆集益 - 仙剑问情",
	"纯音乐 - 大黑天 (38秒片段)",
	"Max Oazo、Moonessa - Once Upon A Time (House Extended Mix)",
)

// 亡妻回忆录主题（3首）
songs.push(
	"是我迷恋 - 多远都要在一起 (0.8x版)",
	"曲肖冰 - 谁",
	"小笨瓜 - 突然好想你 (深情版)",
)

// 2025抖音超火超劲爽车载D j 醒脑舞曲（65首）
songs.push(
	"王优秀 - 墨尔本的秋天 (DJ京仔版)",
	"常超凡 - 醉过多少回 (DJ光波、DJ童波版)",
	"艾北 - 爱财爱己 (DJ EVA版)",
	"常超凡 - 我喝的不是酒 (DJ版)",
	"唐薇 - 九九女儿红 (DJ何鹏版)",
	"坡上老王 - 不挽留没回头 (DJ默涵版)",
	"苏谭谭 - 一半醒一半醉 (DJ默涵版)",
	"渡 - 须尽欢 (DJ花落过花开浅摇版)",
	"王小乱 - 再也不是你 (DJ光波、DJ童波版)",
	"张冬玲 - 爱情着了火 (DJ阿远版)",
	"胜屿 - 难得有情人 (DJ默涵版)",
	"雅楠 - 爱情堡垒 (DJ光波、DJ童波版)",
	"汪六六 - 在他乡 (DJ R7版)",
	"战学文 - 别人 (DJ伟然版)",
	"半吨兄弟 - 老男孩 (DJ老鹏版)",
	"王小乱 - 不挽留没回头 (DJ版)", // 可能重复·C(可能同一首)
	"魏佳艺 - 九十九步退一步 (DJ默涵版)",
	"小曼 - 只要你还需要我 (DJ何鹏版)",
	"陈雅森 - 我们不再是从前 (DJ伟然版)",
	"云南烟嗓子 - 留什么给你 (DJ阿卓、DJ阿龙版)",
	"半吨兄弟 - 今天 (DJ京仔版)",
	"半吨兄弟 - 黄昏 (DJ默涵版)",
	"刘晓超 - 舞女泪 (DJ默涵版)",
	"大神慧 - 香水有毒 (DJ沈念版)",
	"沐阳 - 赌徒 (DJ默涵版)",
	"葛漂亮 - 突然的自我 (DJ童波版)",
	"大欢 - 化风行万里 (DJ默涵版)",
	"R7 - 谢谢你的爱1999 (DJ版)", // 可能重复·C(可能同一首)
	"谢霆锋 - 谢谢你的爱1999",
	"葛漂亮 - 烟雨唱扬州 (DJ京仔版)",
	"房雪娇 - 向孟婆借一碗汤 (DJ版)",
	"小阿枫 - 最远的你是我最近的爱 (DJ光音坊版)",
	"半吨兄弟 - 爱我的人和我爱的人 (DJ R7版)",
	"曲肖冰 - 爱要怎么说出口 (DJ阿卓、DJ阿龙版)",
	"半吨兄弟 - 爱你爱的好疲惫 (DJ阿卓、DJ阿龙版)",
	"黄文文 - 偷得人间二两风 (DJ版)",
	"付豪 - 借酒浇愁 (DJ何鹏版)",
	"朱小朱、DJ京仔 - 我曾用心爱着你 (DJ京仔版)",
	"吕口口 - 爱上你是一个错 (DJ沈念版)",
	"半吨兄弟 - 最远的你是我最近的爱 (DJ默涵版)",
	"曲肖冰 - 我是真的爱上你 (DJ阿卓、DJ阿龙版)",
	"豆包 - 兄弟再干一杯 (DJ阿卓、DJ阿龙版)",
	"阿梨粤 - 你的眼神 (DJ默涵版)",
	"欧阳尚尚 - 爱情主演 (DJ何鹏版)",
	"王雨缦、DJ京仔 - 漂洋过海来看你 (DJ京仔版)",
	"唐小力 - 爱上你是一个错 (DJ唐小力版)",
	"DJ散人、卓依婷 - 追梦人 (完整版｜DJ版)",
	"吕口口 - 生日礼物 (DJ沈念版)",
	"王小草 - 下个，路口，见 (DJ铁柱版)",
	"王雨缦 - 让我欢喜让我忧 (DJ豪大大版)",
	"豆包 - 分手在那个秋天 (DJ阿卓、DJ阿龙版)",
	"DJ House - 特别的爱给特别的你 (DJ House版)",
	"刘晓超、赵雨星 - 曾经心痛 (DJ默涵版)",
	"张雨生 - 大海 (DJ赵允哲版)", // 可能重复·B(较可能同一首)
	"张雨生 - 大海",
	"葛漂亮 - 挪威的森林 (DJ默涵版)",
	"张偲偲 - 风中的遗憾 (DJ R7版)",
	"安旭 - 狗尾草 (DJ小谷版)",
	"半吨兄弟 - 冬天的秘密 (DJ默涵版)",
	"李晓杰、DJ小鱼儿 - 朋友的酒 (DJ小鱼儿版)",
	"半吨兄弟 - 香水有毒 (DJ京仔版)", // 可能重复·B(较可能同一首)
	"七喜 - 香水有毒 (DJ京仔版)",
	"王雨缦、DJ京仔 - 梦醒时分 (DJ京仔版)",
	"王小草 - 老男孩 (DJ阿哲版)",
	"电音任瑶 - 预谋 (DJ电摇版)",
)

// 恐怖背景音乐！（14首）
songs.push(
	"橙光原创音乐 - 囚室",
	"Charlie Clouser - Main Titles", // 可能重复·B(较可能同一首)
	"Legion - Holy Ghost (remix：Legion)",
	"skel - Shiver",
	"韦启良 - 误入迷失森林",
	"柒音 - The Grotto (纯音乐版)",
	"山岡晃 - Never Forgive Me, Never Forget Me",
	"网络歌手 - 天堂岛之歌",
	"苏坤杰 - 人形の館 (人偶之馆)",
	"高梨康治 - 朱(あけ)に染まる (染成朱红)",
	"高梨康治 - 地獄の川流れ (流动的地狱之河)",
	"Makcumbelov、DEFOX - Lata",
	"Christophe Frutuoso - Resident Evil Main Title Theme",
	"Black Hole Sun - The X Files",
)

// 8090经典老歌400首大全丨青春年少追忆情（48首）
songs.push(
	"隔壁老扬 - 桥边姑娘 (DJ默涵版)",
	"安儿陈 - 从此 (DJ默涵版)",
	"红小乐 - 人间就这一个我 (DJ版)",
	"高畅 - 曾经的我们 (DJ版)", // 可能重复·C(可能同一首)
	"高畅 - 曾经的我们",
	"韩宝仪 - 粉红色的回忆 (DJ T.G.A.阿航、DJ傻白婷版)",
	"R7、DJ鱼籽 - 不浪漫罪名 (DJ R7、DJ鱼籽版)",
	"半吨兄弟 - 鬼迷心窍 (DJ默涵版)",
	"云南顶呱呱南瓜 - 与你到永久 (DJ阿卓、DJ阿龙版)",
	"R7 - 粉红色的回忆 (DJ R7版)",
	"广东永琳 - 真的爱着你 (DJ R7版)",
	"刘晓超 - 旧梦 (DJ默涵版)",
	"半吨兄弟 - 萍聚 (DJ默涵版)",
	"刘晓超 - 长相依 (DJ默涵版)",
	"安儿陈 - 曲中人 (DJ版)", // 可能重复·C(可能同一首)
	"常超凡 - 曲中人",
	"胜屿 - 你的眼神 (DJPad仔版)",
	"花姐 - 爱你一万年 (DJ光音坊版1)",
	"孙露 - 寂寞沙洲冷 (DJ阿福、DJ皮皮子版)",
	"半吨兄弟 - 最浪漫的事 (DJ京仔版)",
	"明慧 - 真的爱着你 (DJ京仔版)",
	"海来阿木 - 三生三幸 (DJ小拳权版)",
	"小阿枫 - 留不住的风 (DJ R7版)",
	"王一一 - 多想做个没心没肺的人 (DJ德朋版)",
	"楠姝 - 三月里的小雨 (DJ版)",
	"R7、网络歌手 - 铁血丹心 (DJ R7版)",
	"1个球 - 外婆的澎湖湾 (DJ阿卓、DJ阿龙版)",
	"一杯陈豆浆、插袋先生 - 少女的祈祷 (DJ版)",
	"咖菲 - 中意你 (女版)(DJ阿卓版)",
	"R7 - 三月里的小雨 (DJ R7版)",
	"怪阿姨 - 拥抱风拥抱雨 (DJ阿卓版)",
	"半吨兄弟 - 忘了你忘了我 (DJ九零版)",
	"小雨点 - 累了痛了不爱了 (DJ彭锐版)",
	"弹棉花的小花 - 吻得太逼真 (DJ版)",
	"郑亦辰 - 错的时间遇见对的你 (DJ何鹏版)",
	"半吨兄弟 - 忘了你忘了我 (DJ沈念版)",
	"寂悸 - 潮湿的心 (DJ版)",
	"怪哥 - 负心的你 (DJ阿卓版)",
	"龙梅子 - 情路弯弯 (Remix)(DJ阿远版)",
	"于洋 - 望爱却步 (DJ何鹏版)",
	"豆包 - 神奇草原 (DJ阿卓、DJ阿龙版)",
	"半吨兄弟 - 再见只是陌生人 (DJ默涵版)",
	"R7、网络歌手 - 羞答答的玫瑰静悄悄的开 (DJR7)",
	"王雨缦、DJ京仔 - 一千个伤心的理由 (DJ京仔版)",
	"花姐 - 爱的迷魂汤 (DJ 加快版)",
	"咖菲、猪老三儿 - 中意你 (DJ阿卓、DJ阿龙版)",
	"李雅羚 - 你知道我在等你吗 (DJ版)",
	"花姐 - 爱的迷魂汤 (DJ默涵版)",
)

// 深夜emo天花板 | 抖音伤感热歌（44首）
songs.push(
	"沈梦溪 - 形同陌路",
	"沈梦溪 - 最后我们",
	"王靖雯 - 谦让",
	"张朕、婉枫 - 风经过，唱离合 (风经过告诉我说你很想我)",
	"陈墨一（吖毛） - 你答应我的事 (件件没着落)",
	"姜雨涵 - 在我最爱你的时候",
	"银洛洛 - 飘向远方",
	"黑豆ado - 何必受情伤",
	"银洛洛 - 借着风哼着歌",
	"余火火 - 如果思念有生命",
	"Zxxy - 心之火 (R&B版)",
	"vine - 请先说你好 (何必纠结过去)",
	"就是南方凯 - 列车开往春天 (每个梦都会实现)",
	"赖仔Morris - 千年",
	"宝石Gem、哩哩 - 执子之手",
	"你们的好朋友大雨 - 他明明",
	"赵梵 - 天亮与天黑",
	"欧阳朵 - 早该忘记",
	"柯柯柯啊 - 雨过天不晴",
	"虎虎 - 不盼良人",
	"袁kk - 始终",
	"汪苏泷 - 我想念",
	"TizzyT、万妮达Vinida Weng - 冷战",
	"郑润泽 - 瞬",
	"Zealot周星星 - 毒药",
	"于冬然 - 以朋友的身份",
	"于冬然 - 亲爱的不要哭",
	"陆杰awr - 后来我们的爱",
	"胡66 - 捂住耳朵",
	"阿肆 - 直到你降临",
	"周杰伦 - 借口",
	"周杰伦 - 反方向的钟",
	"王靖雯 - 遗憾也值得",
	"张碧晨、王赫野 - 字字句句 (Live)",
	"周杰伦 - 圣诞星 (feat. 杨瑞代)",
	"陈势安 - 天后",
	"向思思 - 总会有人",
	"en (王翊恩) - 其实都没有 (深情版)",
	"王力宏 - 你不知道的事",
	"周杰伦 - 说好的幸福呢",
	"陆杰awr - 晚风遇见你",
	"李荣浩 - 慢冷 (Live)",
	"Zkaaai - 迟来的情话 (女声版)",
	"叶斯淳 - 我曾遇到一束光",
)

// 等一分钟 黄昏 包容 后来 撕夜 雨一直下 英雄泪（88首）
songs.push(
	"刘德华 - 谢谢你的爱 (国语版)",
	"王杰 - 谁明浪子心",
	"洋澜一 - 没爱你的本事",
	"安儿陈 - 边哭边爱",
	"刘阳阳 - 有一种爱是你在",
	"艺凌 - 想你的时候问月亮",
	"徐靖博 - 分手那天",
	"林子祥 - 敢爱敢做",
	"艺凌 - 先说对不起",
	"方辰 - 黄泉之中红尘酒",
	"张洛一 - 人间总有一两风",
	"大美 - 遗憾的过客",
	"郭富城 - 听风的歌",
	"周华健 - 难念的经",
	"谭咏麟 - 无言感激",
	"大美 - 九十九步退一步",
	"安儿陈 - 此后",
	"苍狼 - 烟入肺酒入魂",
	"啊怯 - 野花",
	"凝音 - 除了梦里再没见过你",
	"刘阳阳 - 人心如海不可测",
	"张国荣 - 沉默是金",
	"刘德华 - 如果你是我的传说",
	"蔡琴 - 你的眼神",
	"光良 - 第一次",
	"林子祥 - 谁能明白我",
	"陈百强 - 一生何求",
	"音宝 - 想要忘记的故事",
	"王杰 - 伤心1999",
	"戴佩妮 - 怎样",
	"张艾嘉 - 爱的代价",
	"伍佰 & China Blue - 再度重相逢",
	"王杰 - 忘了你 忘了我",
	"毛宁 - 晚秋",
	"张宇 - 小小的太阳",
	"欢子 - 愚爱",
	"陈慧琳 - 都是你的错",
	"郑秀文 - 唉声叹气",
	"车继铃 - 最远的你是我最近的爱",
	"BEYOND - 不再犹豫",
	"张学友 - 只想一生跟你走",
	"张宇 - 男人的好",
	"王杰 - 一无所有 (是否我真的一无所有)", // 可能重复·B(较可能同一首)
	"王杰 - 是否我真的一无所有",
	"BEYOND - 逝去日子",
	"任贤齐 - 天涯",
	"莫文蔚 - 忽然之间",
	"安儿陈 - 没人懂我心里苦",
	"伍佰 & China Blue - 浪人情歌",
	"孟庭苇 - 把他换作你",
	"刘小慧 - 初恋情人",
	"钟镇涛 - 让一切随风",
	"张学友 - 等你等到我心痛",
	"王力宏 - 风中的遗憾",
	"张柏芝 - 星语心愿",
	"成龙、陈淑桦 - 明明白白我的心",
	"任贤齐 - 只爱你一个人",
	"杨丞琳 - 左边",
	"光头李进 - 你在他乡还好吗",
	"刘德华 - 来生缘",
	"张学友 - 遥远的她",
	"郑中基 - 你的眼睛背叛你的心",
	"陈慧娴 - 飘雪",
	"王杰 - 一场游戏一场梦",
	"潘美辰 - 我曾用心爱着你",
	"李翊君、李富兴 - 萍聚",
	"赵传 - 我终于失去了你",
	"齐秦 - 往事随风",
	"张宇 - 曲终人散",
	"刘德华 - 爱火烧不尽",
	"邰正宵 - 一千零一夜",
	"任贤齐 - 对面的女孩看过来",
	"许绍洋 - 花香",
	"李克勤 - 红日", // 可能重复·B(较可能同一首)
	"林依轮 - 爱情鸟",
	"BEYOND - 真的爱你",
	"谭咏麟 - 讲不出再见",
	"BEYOND - 农民",
	"音乐磁场 - 我记得你眼里的依恋",
	"BEYOND - 无尽空虚",
	"刘德华 - 今天",
	"陶喆 - 普通朋友",
	"王冰洋 - 飞舞",
	"雷诺儿 - 别在我离开之前离开",
	"郑源 - 为什么相爱的人不能在一起",
	"宇桐非 - 感动天感动地",
	"王菲 - 爱与痛的边缘",
	"刘若英 - 很爱很爱你",
)

// 重温经典 | 那些影视剧宿命感拉满的歌曲（14首）
songs.push(
	"孟维来 - 羽落",
	"檀健次 - 等不到的等待",
	"胡歌 - 六月的雨",
	"严艺丹 - 三寸天堂",
	"麦振鸿 - 景天-护甲",
	"周杰、林心如 - 你是风儿我是沙",
	"王心凌 - 黄昏晓",
	"王心凌 - 彩虹的微笑",
	"胡歌 - 光棍",
	"张婧 - 这样爱了",
	"周华健 - 刀剑如梦",
	"张碧晨 - 下一秒",
	"胡歌 - 风起时",
	"刘涛 - 红颜旧",
)

// 漫画解说背景音乐（14首）
songs.push(
	"小班同学 - 解忧曲 (纯音乐版)", // 可能重复·C(可能同一首)
	"T3nzu - Drive Forever (Slowed)",
	"顾依辰 - 压迫感 (DJ版)",
	"Kordhell - Scopin (Explicit)",
	"牛尾憲輔 - Night Crusing (夜间巡航) (Kiiiu0.9x版)",
	"bhnn - Положение",
	"指尖笑 - 不问ciaga (不问别离)",
	"苏果卡 - 见证奇迹 (DJ版)",
	"X-GANG、Payin' Top Dolla、WYR GEMI - Hennesy",
	"Oliver Stock - Come With Me",
	"XXXCA - Do It (Orginal Mix)",
	"Moondeity、Eduard Vodovozik - ANKH (Explicit)",
	"柊奈緒 - レクイエム (安魂曲)(inst.)", // 可能重复·B(较可能同一首)
	"LIKPIA - 夏·烟火",
)

// 那些你听过但不知道名字的英文歌（21首）
songs.push(
	"Passion Pit - Take a Walk (Album Version)",
	"Maroon 5、Wiz Khalifa - Payphone (Explicit)",
	"Walk off the Earth、D Smoke - Bet On Me",
	"Sia - Move Your Body",
	"PoyloK - DARK RAVE (Reverb Slow)",
	"Hi Noise - Want U More (Radio Edit)",
	"T3muz - lll Do lt (Radio Edit)(DJ版)",
	"Hi Noise - We Never",
	"Dion Timmer、The Arcturians - The Best Of Me",
	"PoyloK、Alexandra Stan、Manilla Maniacs - All My People (鹿紫云一处刑曲)",
	"Hayden James、Boy Matthews - Just Friends (Explicit)",
	"1outa - Just Friends",
	"Kadebostany - Early Morning Dreams (remix：Kled Mone)",
	"Gin - Scopin",
	"ELYSA、King CAAN - Go Again (CR3Times 0.8X版)",
	"oX7、142 - Rule",
	"oX7 - Angetenar (2024)",
	"Wild Cards、James Delaney - Falling Down (feat. James Delaney)",
	"Klaas - Big Words",
	"Breathe Carolina、Dropgun、Kaleena Zanders - Sweet Dreams",
	"Deep East Music - Monsieur Melody",
)
